[
  {
    "id": "5cb0284f-d65a-4a48-bd8e-467eef213857",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/5cb0284f-d65a-4a48-bd8e-467eef213857",
    "created_at": "Fri Jan 22 21:57:26 UTC 2021",
    "company": "Expensify ",
    "company_url": "https://we.are.expensify.com/",
    "location": "Remote",
    "title": "Full Stack Engineer ",
    "description": "\u003cp\u003e\u003cstrong\u003eYour Mission, Should You Choose to Accept:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJoin our passionate team of top-notch engineers to solve a real-world problem, and help people spend less time managing expenses and more time pursuing their real goals.\u003c/p\u003e\n\u003cp\u003eAs we revolutionize the way people manage their expenses, being part of the Expensify team means building the easiest, fastest, and most efficient platform to automate everything expense-related.\u003c/p\u003e\n\u003cp\u003eOur employees work from all over the world, but if you’re looking for a change of scene we offer visa sponsorship and relocation assistance to join us at one of our rad locations:\nSan Francisco\nPortland\nMichigan\nNew York\nLondon\nMelbourne\nAnd more to come!\u003c/p\u003e\n\u003cp\u003eEven though we work hard at Expensify, we make sure our employees are happy. Our most talked about perk is our Offshore where we spend a month abroad working from a remote location as a team. This year we’re going to Spain, do you want to join?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhether you’re building features like calendar integrations, importing credit card transactions, or pulling information from receipts, you’re self-driven and collaborative. You’re an autonomous individual who is passionate about writing beautiful and concise code. You’re willing to work with other engineers, designers, and customer facing teams to turn our dreams into reality.\u003c/p\u003e\n\u003cp\u003eAs a Web Full Stack Engineer, your responsibilities include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplementing improvements\u003c/li\u003e\n\u003cli\u003ePlanning, building, and maintaining cross-stack features like accounting integrations, advanced receipt scanning, and more.\u003c/li\u003e\n\u003cli\u003eGuiding and enabling others in the organization: we'll share our editor tricks, dotfiles and productive workflows. Share yours!\u003c/li\u003e\n\u003cli\u003eAsking questions about things you don’t understand and challenging the status quo.\u003c/li\u003e\n\u003cli\u003eFor the best possible fit, we are looking for someone who:\u003c/li\u003e\n\u003cli\u003eHas experience writing real-world software to solve real-world problems.\u003c/li\u003e\n\u003cli\u003eCommunicates well, both interpersonally and in their code.\u003c/li\u003e\n\u003cli\u003eIs a natural problem solver, knows how to solve problems by automating their solutions.\u003c/li\u003e\n\u003cli\u003eUnderstands the role and impact that programming can have on the organization as a whole.\u003c/li\u003e\n\u003cli\u003eWants to develop and grow their skills in programming and leadership within the organization.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking for people who have a strong understanding of algorithms and design patterns that can apply those concepts into a production level codebase. Knowledge and experience with Javascript, React, React Native, PHP, C++, Java, iOS or Android is a plus. This position is the foundation for launching a career with Expensify, with the expectation that you’ll carry these skills into new domains.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation \u0026amp; Benefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull-time, salaried position\u003c/li\u003e\n\u003cli\u003e401k with employer match\u003c/li\u003e\n\u003cli\u003e100% Medical/Dental/Vision contributions\u003c/li\u003e\n\u003cli\u003eCommuter benefits\u003c/li\u003e\n\u003cli\u003eFree lunch\u003c/li\u003e\n\u003cli\u003eFlexible vacation policy\u003c/li\u003e\n\u003cli\u003eRelocation available\u003c/li\u003e\n\u003cli\u003eWork from home when you need to\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNext Steps\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eApplying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are probably many ways to do that, but the easiest way to help us out is by answering the following questions:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eWhat's the URL of your website? If you don't have one, why not?\u003c/li\u003e\n\u003cli\u003eWhat's your coding history? When did you start, and what have you done between then and now?\u003c/li\u003e\n\u003cli\u003eWhat do you want to do with the rest of your life, and how is Expensify a step toward your long-term goals?\u003c/li\u003e\n\u003cli\u003eHow did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eResume not your thing? That’s great, we don’t really read them anyway! Forward your responses to the questions to \u003ca href=\"mailto:jobs@expensify.com\"\u003ejobs@expensify.com\u003c/a\u003e. We're excited to hear from you!\u003c/strong\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your application responses to \u003ca href=\"mailto:jobs@expensify.com\"\u003ejobs@expensify.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1NXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e21d3ba733836e6bc61b5a0809e3a9aa0ab7f8d9/expensify-logo.png"
  },
  {
    "id": "42cae8c4-e30e-4a85-a8f7-14ae6daf2ef6",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/42cae8c4-e30e-4a85-a8f7-14ae6daf2ef6",
    "created_at": "Fri Jan 22 11:22:03 UTC 2021",
    "company": "Relationship One",
    "company_url": "https://vonq.io/2XYjcCO",
    "location": "remote position",
    "title": "Front-End Developer",
    "description": "\u003cp\u003eThe Front-End Developer will utilize HTML, CSS, and JavaScript to create and update landing pages, emails, and other web-based assets. This includes bringing complex content hubs to life for clients utilizing the Uberflip platform and helping diagnose and fix functionality errors and rendering issues across multiple web browsers and email clients. Additionally, this role assists with email campaign execution and bulk asset migrations as well as building custom front-end solutions using RESTful API calls to Oracle Marketing Cloud platforms (Eloqua, Responsys).\u003c/p\u003e\n\u003cp\u003eWe believe forming diverse teams in an inclusive environment is not only the key to our success - it's the human thing to do. Our collaborative culture encourages people to bring their whole selves to work where they can both inspire and be inspired.\u003c/p\u003e\n\u003cp\u003eWe encourage people from underrepresented groups to apply and we are committed to equal employment opportunity for all regardless of race, color, ethnicity, ancestry, religion, national origin, gender, sex, gender identity or expression, sexual orientation, age, marital or parental status, disability, veteran status, etc.\u003c/p\u003e\n\u003ch2\u003eRoles \u0026amp; Responsibilities\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eCreate landing pages and HTML emails supported across a variety of browsers and email clients both desktop and mobile\u003c/li\u003e\n\u003cli\u003eBuild rich content hubs for clients on the Uberflip platform utilizing HTML, CSS, and JavaScript ES6\u003c/li\u003e\n\u003cli\u003eSupport clients and consultant teams with answers to JavaScript, HTML, and CSS questions\u003c/li\u003e\n\u003cli\u003eCreate front-end solutions to support automated marketing campaigns and events across various Marketing Automation platforms (Marketo, Eloqua, Responsys, SendGrid, Salesforce Marketing Cloud, etc.)\u003c/li\u003e\n\u003cli\u003eAssist in project discovery, requirements gathering, and project scoping\u003c/li\u003e\n\u003cli\u003eBuild out and conduct QA test plans for front-end projects and support client-side UAT efforts as needed\u003c/li\u003e\n\u003cli\u003eServe as best practice consultant and hands-on expert for web development processes and technologies\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMinimum of 4 years experience with email/landing page/form development\u003c/li\u003e\n\u003cli\u003eMust be proficient in HTML and CSS including responsive layouts\u003c/li\u003e\n\u003cli\u003eMust be proficient in JavaScript development, including vanilla JS, ES6, and jQuery\u003c/li\u003e\n\u003cli\u003e2 years experience JSON and RESTful APIs\u003c/li\u003e\n\u003cli\u003eProcess and project management skills for the full life of a software project\u003c/li\u003e\n\u003cli\u003eExperience in creating and working with formal QA test plans\n-Exceptional attention to detail and quality\u003c/li\u003e\n\u003cli\u003eExcellent interpersonal, verbal, and written communications skills and the ability to present technical information to others with clarity and ease\u003c/li\u003e\n\u003cli\u003eAble to identify and resolve technical issues quickly, efficiently, and effectively\u003c/li\u003e\n\u003cli\u003eSelf-starter mentality with a passion for learning and a hunger for personal and professional growth\u003c/li\u003e\n\u003cli\u003ePortfolio / GitHub repository / other examples of front-end development work is required\u003c/li\u003e\n\u003cli\u003eMust reside in and be eligible to work in the United States\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBonus Qualifications\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with marketing automation platforms, specifically with Eloqua, Responsys, Marketo, Salesforce Marketing Cloud, and SendGrid\u003c/li\u003e\n\u003cli\u003eSupport desk environment experience.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInterested?\u003c/h2\u003e\n\u003cp\u003eApply now by using the application form.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/2XYjcCO\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://vonq.io/2XYjcCO\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWVXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2323f2dba17fece9c1cb209a1795949a05d6153f/relationship%20one.jpg"
  },
  {
    "id": "4ee2864c-df86-47fe-bc97-670f306e7cb4",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4ee2864c-df86-47fe-bc97-670f306e7cb4",
    "created_at": "Fri Jan 22 10:39:58 UTC 2021",
    "company": "IMG.LY",
    "company_url": "https://img.ly",
    "location": "remote",
    "title": "Senior Frontend Engineer ",
    "description": "\u003cp\u003eWho we are\u003c/p\u003e\n\u003cp\u003eHi! We are that super-groundbreaking technology provider you’ve probably never heard of! Our flagship products, the PhotoEditor SDK and VideoEditor SDK are fully customizable photo and video editing solution for web and mobile platforms that are being used by marvelously big brands like HP, Hootsuite, ZARA, and hundreds of other companies around the world. Our products for photo and video editing are world-class and market leaders, and we’re damn proud of it. 💪\u003c/p\u003e\n\u003cp\u003eWhere we work\u003c/p\u003e\n\u003cp\u003eOur office is in the very heart of Bochum, but our team is working wherever they can thrive. From Bochum over Berlin, at the seaside or beyond the hills. We give you the freedom and tools to choose where you work best. We are currently on our way to become a remote-first company. We won’t get back to the old normal, as we don’t believe in an old normal.\u003c/p\u003e\n\u003cp\u003eWhy we need you\u003c/p\u003e\n\u003cp\u003eWe’ve become a quite buzzy startup in tech circles but we want to be a lot more than the buzz. Therefore we merged the talents of our team, bringing together the best of design, arts, and tech. After successfully developing our SDK flagships over the past years, we're going back to our roots and to what we are best at - creating the best development experience possible. And that's where you step in.\u003c/p\u003e\n\u003cp\u003eWhat you’ll do\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJoin us at magical times where you’ll play a pivotal role in further developing and improving our UI development utilizing your expertise implementing React components and workflows. And behold, VideoEditor SDK for Web is coming ...\u003c/li\u003e\n\u003cli\u003eWe're currently in a phase of maintaining, fine-tuning and improving the status quo of our SDKs, and bethink of what we assume to be most important - improving the developer experience and ease to use.\u003c/li\u003e\n\u003cli\u003eYou’ll build and implement pixel perfect React UIs, enhance our core technology with new features and core concepts, integrate it in other tool kits and support our customers with the integration.\u003c/li\u003e\n\u003cli\u003eYou’ll collaborate with your fellow designer colleagues to directly convert components and interactively shape the UI together.\u003c/li\u003e\n\u003cli\u003eYou’ll provide technical leadership on React frontend and UI development and mentor our team on best practices around frontend technologies.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis might be a job for you if you ...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave expertise developing professional frontends in React, Angular, VueJS or similar\u003c/li\u003e\n\u003cli\u003ehave a passion for technology and design, and maybe are interested in new fields like creative coding\u003c/li\u003e\n\u003cli\u003ealready have basic skills in TypeScript, JavaScript, or Rollup, ‘cause these are a big thumbs up\u003c/li\u003e\n\u003cli\u003ehave experience with state management libraries such as Redux or MobX, as well as the React testing library or Cypress\u003c/li\u003e\n\u003cli\u003eare passionate about developing creative tools that help create stunning content\u003c/li\u003e\n\u003cli\u003elike to work self-sufficient and feel comfortable with jumping in at the deep and, but that's okay, 'cause you are convivial fellow and social butterfly 🦋\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are a razor-sharp team of coders and designers that’ll be always by your side to code, create and collaborate and together with you to always have the edge over everybody else. We are open about technology choices, and we like to tinker with the new stuff. So, the odds are overwhelming that, no matter what you like, you’ll find a place here to run free your affinity for cutting-edge technologies.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eWe don't need a novel as a cover letter. A polished CV or your LinkedIn profile can be a safe bet. But, we are far more interested in the projects you’ve been working on, some code, or anything that you want to show us. Rise above the noise. Surprise us at \u003ca href=\"mailto:jobs@img.ly\"\u003ejobs@img.ly\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbU9XIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e5baef263151658d7e13b057b1c704fcc982c96b/imgly-logo.png"
  },
  {
    "id": "6b4c12e9-d92f-4d2a-b496-7706a1369f9c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6b4c12e9-d92f-4d2a-b496-7706a1369f9c",
    "created_at": "Fri Jan 22 10:20:43 UTC 2021",
    "company": "Torus Labs Private Limited",
    "company_url": "https://tor.us",
    "location": "Singapore/Remote",
    "title": "Software Engineer | Backend, Front-end, SDK/Integrations",
    "description": "\u003cp\u003eTorus Labs is a VC-backed company that works on applied cryptography and we specialise in private key management software. Our company vision is to proliferate the usage of cryptographic keys to enable use cases that empower the individual. Our solution allows for applications to set up a public key infrastructure while maintaining flows that end-users are familiar with. You can (git) check out all of our open-source code at \u003ca href=\"https://github.com/torusresearch\"\u003ehttps://github.com/torusresearch\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBefore embarking on Torus the founding team worked on different Ethereum Foundation projects including ENS and Plasma research. We're heavily execution-driven, flexible and impact-focused. Our aim is to provide a seamless user experience to the applications that integrate us, ultimately driving adoption in the ecosystem. You will work hands-on on Torus, various tools and rapidly deliver innovative solutions.\u003c/p\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of experience in a software integration engineering role\u003c/li\u003e\n\u003cli\u003eStrong interest in cryptography/blockchain\u003c/li\u003e\n\u003cli\u003eExperience with Javascript, Go, Rust and/or Solidity\u003c/li\u003e\n\u003cli\u003eStrong communication and coordination skills\u003c/li\u003e\n\u003cli\u003eHave a deep understanding of branching and software configuration management\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits: -\u0026gt; Dynamic team of diverse backgrounds -\u0026gt; Opportunities to attend international blockchain events -\u0026gt; Flexible while execution-driven and impact-focused -\u0026gt; Comfortable and unique workspace -\u0026gt; Compelling equity package -\u0026gt; Annual leaves -\u0026gt; Competitive take-home salary -\u0026gt; Office Cat\u003c/p\u003e\n\u003cp\u003eCheck us out at \u003ca href=\"https://tor.us\"\u003ehttps://tor.us\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply at \u003ca href=\"https://angel.co/company/torus-2/jobs/1060042-software-engineer-backend-front-end-sdk-integrations\"\u003ehttps://angel.co/company/torus-2/jobs/1060042-software-engineer-backend-front-end-sdk-integrations\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHlXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e22e2c306c11a66bde3df7816914865818b9509a/torus-wordmark-blue.png"
  },
  {
    "id": "166674ef-ff92-47d0-a727-748bd23bfdde",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/166674ef-ff92-47d0-a727-748bd23bfdde",
    "created_at": "Fri Jan 22 02:30:31 UTC 2021",
    "company": "Compudyne",
    "company_url": "http://www.compudyne.com",
    "location": "St. Paul, MN",
    "title": "Sr. DevOps Engineer",
    "description": "\u003cp\u003e\u003cstrong\u003eFind your niche\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a Senior Development Operations Engineer (DevOps), you are responsible for designing, developing and building IT solutions for Compudyne. You will combine your proficiency in systems administration, software development and automation to improve key systems that are utilized throughout the business. A key responsibility will include deploying code to production in a repeatable way that increases efficiency. You will have an affinity for automation, well commented code/documentation, and follow established best practices.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDevelop your skills\u003c/strong\u003e \u003c/p\u003e\n\u003cp\u003eGoing in you should have 5 year’s experience working in both software development and systems administration.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe ideal candidate will have\u003c/em\u003e  \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficiency in Java and JavaScript programming languages\u003c/li\u003e\n\u003cli\u003eDesire to work in Systems Administration\u003c/li\u003e\n\u003cli\u003ePowerShell, SQL and Rest API experience\u003c/li\u003e\n\u003cli\u003eExperience in the ConnectWise suite of applications\u003c/li\u003e\n\u003cli\u003eA strong reputation in Stack Overflow\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eResponsibilities\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop front-end and back-end solutions, specifically in Java and JS\u003c/li\u003e\n\u003cli\u003eUse version control tools and multi-tier application design\u003c/li\u003e\n\u003cli\u003eFollow best practices, such as DRY code, design first mentality, and highly commented code\u003c/li\u003e\n\u003cli\u003eWork proficiently in networking, database management, internal systems and Windows servers administration\u003c/li\u003e\n\u003cli\u003eSupport and maintain Compudyne’s internal systems and infrastructure\u003c/li\u003e\n\u003cli\u003eDesign databases utilizing both SQL and NoSQL\u003c/li\u003e\n\u003cli\u003eUnderstand servers and server administration\u003c/li\u003e\n\u003cli\u003eDevelop software that ensures integration and supports business needs\u003c/li\u003e\n\u003cli\u003eUnderstand and utilize scripting languages and frameworks for automation\u003c/li\u003e\n\u003cli\u003eExecute and manage continuous integration and deployment for systems\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUtilization of the following technologies and systems are preferred:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBack-end languages: Java, Node.js\u003c/li\u003e\n\u003cli\u003eFront end languages: JavaScript (including frameworks), HTML, CSS\u003c/li\u003e\n\u003cli\u003eAutomation: PowerShell\u003c/li\u003e\n\u003cli\u003eDatabase: SQL, NoSQL (especially MySQL, MSSQL, and Elasticsearch)\u003c/li\u003e\n\u003cli\u003eVersion control: Git, BitBucket, SourceTree, Jira\u003c/li\u003e\n\u003cli\u003eNetworking: reverse proxy, load balancing, firewalls rules \u0026amp; NAT\u003c/li\u003e\n\u003cli\u003eCentral authentication platforms: SAML, Active Directory, LDAP, MFA\u003c/li\u003e\n\u003cli\u003eRemote procedure calls: REST APIs\u003c/li\u003e\n\u003cli\u003eSystems Administration: Windows servers, Linux Servers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBe a part of something big\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCompudyne began as a local computer reseller in 1988 with the belief that high-quality equipment and first-rate technical support are the keys to developing superior IT services. In the years since, we built a national presence by providing a complete array of technology services, from network management and security to hosted servers and connectivity.\u003c/p\u003e\n\u003cp\u003eIntegrity and relationships are the principles that lead us on our mission to be the most knowledgeable professional IT firm for our clients.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional Information\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCompudyne is only accepted local applicants at this time.\u003c/p\u003e\n\u003cp\u003eAll your information will be kept confidential according to EEO guidelines.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply:\n\u003ca href=\"https://smrtr.io/4R9th\"\u003ehttps://smrtr.io/4R9th\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2lXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--73ed37774af4988cebc1f27c8882024b6b89461a/Compudyne_Logo_Color.jpg"
  },
  {
    "id": "98701506-35a3-4490-807c-73e5f4066d45",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/98701506-35a3-4490-807c-73e5f4066d45",
    "created_at": "Fri Jan 22 02:23:54 UTC 2021",
    "company": "WELL Health",
    "company_url": null,
    "location": "United States",
    "title": "Senior Backend Software Engineer",
    "description": "\u003cp\u003eWELL is a patient communication infrastructure for healthcare. We enable enterprise health systems, private practices, and vendors to conduct seamless conversations with patients across multiple channels — including texting, email, telephone, and live chat.\u003c/p\u003e\n\u003cp\u003eWith WELL, patients receive all of their healthcare communication from one trusted source — their provider. The platform empowers service representatives to converse with patients in real time, ensuring patients feel heard while driving staff efficiency and increased revenue.\u003c/p\u003e\n\u003cp\u003eFounded in 2015, WELL is based in Santa Barbara, California and is the highest rated patient engagement software on G2. WELL serves many of the country’s leading health systems and more than 20 million patients.\u003c/p\u003e\n\u003cp\u003eWELL is honored to be ranked number 170 on the 2020 Inc. 5000 list of fastest growing private companies. WELL is also proud to have been named one of the 2020 Central Coast Best Places to Work by the Pacific Coast Business Times, and one of the 2020 Best Places to Work in Healthcare by Modern Healthcare. Most recently, WELL Health was recognized as one of the Best Midsize Companies to Work for in Los Angeles in 2021 by Built In LA. To learn more about WELL, please visit our LinkedIn.\u003c/p\u003e\n\u003cp\u003eSUMMARY\u003c/p\u003e\n\u003cp\u003eWELL is looking for a talented, experienced backend developer to join our fast-paced, growing engineering department. This developer will primarily be working with Node.js. As a Node.js Backend Engineer at WELL, you will work directly alongside a team of bright and motivated backend engineers, under the guidance of our Engineering Director.\u003c/p\u003e\n\u003cp\u003eYou will be responsible for working with the rest of the team to maintain and grow features in the backend code base. This work will range from supporting Node.js web facing APIs, to writing SQL queries, to developing workflows in Golang.\u003c/p\u003e\n\u003cp\u003eIn addition to being a strong developer, you will have a keen interest in how software and modern communication channels can improve the patient experience. You will also have the attention to detail and quality needed to meet high Service Level Agreements (SLAs) in a product that serves roughly 20 million patients nationwide. You will also be flexible and adaptable enough to thrive in a fluid startup environment.\u003c/p\u003e\n\u003cp\u003eRESPONSIBILITIES\u003c/p\u003e\n\u003cp\u003eBuild new backend services using Typescript on Node.js, open source technology and tools including NestJS.\nAs an experienced engineer, you will help the team adhere to software best practices, level up others in your areas of expertise, and contribute to the architecture of our ongoing refactor project.\nCollaborate with the product team in an agile environment to break down requirements, plan and estimate tasks.\nDrive quality by writing effective unit, integration and functional tests for high availability systems and libraries.\nCreate high availability and high throughput systems using Redis, Postgres, Kinesis, S3, MongoDB, and AWS services.\nEffectively collaborate with Product, QA, UX, Client Success, and other internal groups (both technical and non-technical).\u003c/p\u003e\n\u003cp\u003eREQUIREMENTS\u003c/p\u003e\n\u003cp\u003eBachelor's Degree in Computer Science\n5+ years designing and implementing backend services and distributed systems in a professional environment\nStrong grasp of Javascript/ES fundamentals, Typescript, or strong experience in another modern OO language\nProficiency in SQL (PostgreSQL) database design\nExperienced working with asynchronous requests in large scale applications\nCommitment to testing best practices\u003c/p\u003e\n\u003cp\u003eBONUS\u003c/p\u003e\n\u003cp\u003eCollaboration/contributions with the open source community\nStrong leadership skills\nExperience with:\nGo, Python\nDocker\nTerraform\nAWS\nEvent sourced and microservice architecture\u003c/p\u003e\n\u003cp\u003eLOCATION\u003c/p\u003e\n\u003cp\u003eWELL is headquartered in Santa Barbara, CA and has a satellite office in Orange County, CA. Today, all WELL positions are remote, and we are looking forward to when our company returns to in-office work. We are open to candidates that are looking for a permanently remote role depending on their level of experience. Historically, remote team members visit the Santa Barbara office regularly, and we’ve found that works best when they are on the West Coast, specifically in Southern California.\u003c/p\u003e\n\u003cp\u003ePERKS AND BENEFITS\u003c/p\u003e\n\u003cp\u003eFantastic company culture – frequent Zoom company events (Lunch \u0026amp; Learns, trivia, yoga, etc.) and daily fun brought to you by many creative Slack channels.\u003c/p\u003e\n\u003cp\u003eWorkplace groups – company committees available for all to join (Diversity \u0026amp; Inclusion and Workplace Engagement).\u003c/p\u003e\n\u003cp\u003eLearning and development – frequent events and tools available to help our employees #PursueGrowth.\u003c/p\u003e\n\u003cp\u003eCareer mobility – we promote from within and have opportunities for employees to transfer between teams.\u003c/p\u003e\n\u003cp\u003eSanta Barbara office perks: dog-friendly office, healthy (and unhealthy) snacks, Kombucha on tap, light-filled space, Sonos workplace, ergonomic desk setup, and the occasional taco truck.\u003c/p\u003e\n\u003cp\u003eMacBook Pros provided\u003c/p\u003e\n\u003cp\u003eUnlimited PTO\u003c/p\u003e\n\u003cp\u003eGenerous equity package\u003c/p\u003e\n\u003cp\u003eFull health benefits – medical/dental/vision\u003c/p\u003e\n\u003cp\u003eWELL Health Inc. is an Equal Opportunity Employer and is committed to fair and equitable hiring practices. All hiring decisions at WELL are based on strategic business needs, job requirements and individual qualifications. All candidates are considered without regard to race, color, religion, gender, sexuality, national origin, age, disability, genetics or any other protected status.\u003c/p\u003e\n\u003cp\u003eWELL is dedicated to creating an inclusive and diverse workplace, where everyone feels safe to be themselves and express their thoughts and opinions. WELL is committed to providing employees with a work environment free of discrimination and harassment; WELL will not tolerate discrimination or harassment of any kind.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply directly here: \u003ca href=\"https://grnh.se/fc7184fd2us\"\u003ehttps://grnh.se/fc7184fd2us\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1NXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6a48c42a51c008149b27db5e943ff9fa4653a0d8/Well-Blue-Heart-Stroke-with-TM.png"
  },
  {
    "id": "edcde840-5bc0-4ecd-92f1-21b3e6f4e6e0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/edcde840-5bc0-4ecd-92f1-21b3e6f4e6e0",
    "created_at": "Fri Jan 22 01:31:48 UTC 2021",
    "company": "Fiddler AI",
    "company_url": "http://http",
    "location": "Palo Alto, CA ",
    "title": "Frontend Engineer",
    "description": "\u003cp\u003e\u003cstrong\u003eOur Story\u003c/strong\u003e\nTrust is a fundamental part of humanity, but with the rise of the internet over the last couple of decades, we’ve seen a plethora of trust issues emerge like spam, fraudulent transactions, hate speech, and online abuse. Today, with AI, computers take on more tasks usually done by humans, with an increase in efficiency and productivity. However, We understand the implications of AI, and the potential danger of not having visibility into how it affects the real world. There is a lack of trust in AI outcomes because often AI models can be opaque.   We started Fiddler because we believe there is a need for a new kind of Explainable AI Platform. One that enables organizations to get ahead of these issues by building trustworthy, transparent, and understandable AI solutions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho We Are\u003c/strong\u003e\nOur team is motivated by helping the world to unlock the AI BlackBox. We help humans harness AI to create more understanding around results, create actionable insights, eliminate biases, and identify performance gaps. We know that AI is the future and believe that learning the “why” behind the results is crucial to any business or platform.\u003c/p\u003e\n\u003cp\u003eWe are still an early-stage startup, and are rapidly growing our team! This is an exciting time to join an XAI startup that is quickly becoming a leader in the space.\u003c/p\u003e\n\u003cp\u003eFiddler Labs is recognized as a pioneer in the field of Explainable AI and has received numerous accolades, including 100 most promising Technology Pioneers of 2020 by the World Economic Forum, Forbes 50 most promising AI startups, and a Cool Vendor in Gartner’s 2019 Cool Vendors in Enterprise AI Governance and Ethical Response report.\nWe are looking for a design-oriented and collaborative Frontend Engineer to help us continue to build this platform.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You'll Do\u003c/strong\u003e\nDesign, build, support, and own the front-end components of our enterprise software product, including UIs and visualization for AI explainability and monitoring\nWork with data science teams to understand their requirements, and our design / product team do design clear, simple data visualizations and intuitive interfaces\nWork with the technical and product team to iterate on different user interfaces, and continuously look for ways to improve the customer usability experience\nCreate reusable and maintainable frontend systems\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat We're Looking For\u003c/strong\u003e\nBS/MS in Computer Science or equivalent industry experience\nDeep experience with React, Javascript, and Redux. Experience with Node.js, Enzyme, and Jest is a plus\nStrong product and design sensibilities, with an attention to detail\nAbility to rapidly iterate on designs, in a highly collaborative environment\nExperience related to javascript plotting tools such as D3, highcharts, etc.\nUnderstanding of asynchronous javascript handling\nAbility to leverage and modify front-end components like bootstrap, semantic UI or material UI\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply here: \u003ca href=\"https://jobs.lever.co/fiddlerlabs/c6c9be0b-1c12-4803-b3af-c17fe043f269\"\u003ehttps://jobs.lever.co/fiddlerlabs/c6c9be0b-1c12-4803-b3af-c17fe043f269\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0tXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f2edb3c4fc78f6558cda597c95a6c0b3c1e5cd40/Logo%20200px.png"
  },
  {
    "id": "4c38e5a7-6ecd-478f-9571-4f83845c2833",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4c38e5a7-6ecd-478f-9571-4f83845c2833",
    "created_at": "Thu Jan 21 15:20:37 UTC 2021",
    "company": "Telmar",
    "company_url": "http://Telmar",
    "location": "UK remote",
    "title": "Full Stack Software Engineer - Fully Remote",
    "description": "\u003cp\u003eROLE SUMMARY\u003c/p\u003e\n\u003cp\u003eReports To: Engineering Resource Manager\nRemote working and Flexible hours\u003c/p\u003e\n\u003cp\u003eAbout Telmar:\nTelmar was purchased by LiiV in 2018  and is a provider of SaaS/software to advertising and media companies, providing the most influential agencies, media owners and planners with innovative cloud-based tools to help create, plan and predict the most successful media campaigns. With over 50 years of experience providing data and analytical tools for the marketing and advertising industry, Telmar’s easy-to-use software products and solutions support over 8,000 databases, making it the industry’s most trusted third-party data analysis software globally.\u003c/p\u003e\n\u003cp\u003eIn the role of Full Stack Engineer, you will be responsible for designing, developing, and maintaining applications that are deployed on our cloud-delivered Telmar Unified Platform, our end to end media planning and buying web based solutions that span all media types globally.\u003c/p\u003e\n\u003cp\u003eAn example module is our Out of Home Application, a product which provides a comprehensive outdoor advertising planning system with detailed site level and market average reach and frequency evaluation.\u003c/p\u003e\n\u003cp\u003eAs a Full Stack Engineer you are a crucial part of a dynamic agile team, you will collaborate with very experienced technologists in the media planning industry and will have an awesome opportunity to build cutting-edge technology essential to the media planning industry.\u003c/p\u003e\n\u003cp\u003eMain Responsibilities and Tasks:\nCollaborate closely with the team to plan, prototype, scope and develop frontend and backend web application components/features\nUse Git version control system, create, build and deploy company internal npm modules and packages\nTest, measure, optimize performance, and engage in continuous improvement using appropriate tools\nBuild and use various customized tools: deployment scripts, build tools, etc.\nHave security as a primary concern in the architecture, build and deployment of solutions\nMentor less experienced Engineers and provide the learning framework to support learning.\u003c/p\u003e\n\u003cp\u003ePERSON SPECIFICATION\u003c/p\u003e\n\u003cp\u003eEducation, Experience, Knowledge, and Skills:\nGeneral programming and knowledge of Javascript, TypeScript, DOM manipulation, Javascript object model to implement rich, interactive web applications\nProven experience with Frontend Angular development, Node.js\nExperience of Git and conducting code reviews\nAdvanced demonstrated fluency in JavaScript, HTML, and CSS\nKnowledge and understanding of AWS Gateway API, AWS Lambda (Node.js), ElasticSearch\nExperience of implementing UI/UX design using Material UI\nKnowledge of HTML5, CSS3\nA good understanding of RESTful APIs, JSON data objects\nExperience with Agile methodologies and change management i.e. Jira and be able to author technical acceptance criteria\nKnowledge of modern authorization mechanisms, such as JSON Web Token, Amazon Cognito and Amplify Auth framework\u003c/p\u003e\n\u003cp\u003ePersonal Attributes:\nExcellent problem-solving skills\nAbility to keep up to date with advances in Technology and best practices from the industry.\nProven ability to work effectively in a distributed working environment\nOutstanding written and verbal communication skills\nOrganized, detail-oriented, and deadline-driven\nStrong interpersonal skills and the ability to work proactively, independently and as a team player\nAbility to work efficiently and productively in a fast-paced environment\nWillingness to learn new skills\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply via the link below:\n\u003ca href=\"https://liiv.bamboohr.com/jobs/view.php?id=55\"\u003ehttps://liiv.bamboohr.com/jobs/view.php?id=55\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUtXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9f27a4aea54de02611c954ffb0b13d0dbd333d4f/telmar-LiiVco-Logo-blue%20(2).png"
  },
  {
    "id": "9ef799fa-5253-47bc-a101-82557c675e4d",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9ef799fa-5253-47bc-a101-82557c675e4d",
    "created_at": "Thu Jan 21 16:55:07 UTC 2021",
    "company": "Scanbot / doo GmbH",
    "company_url": "https://scanbot.io",
    "location": "Bonn",
    "title": "QA Automation Engineer (m/f/d)",
    "description": "\u003cp\u003eHi!\u003c/p\u003e\n\u003cp\u003eWe are Scanbot / doo GmbH! We are a German software development company founded in 2011, with business presences in Bonn and San Francisco. Scanbot enables the integration of scanning and data extraction functionalities into existing mobile applications for the insurance, healthcare, logistics, and banking industry. The Software Development Kit (SDK) utilizes highly sophisticated algorithms and machine learning to integrate scanning functionalities and data extraction into any app. More than 200 businesses worldwide use the Scanbot SDK, including DAX 30 and Fortune 500 companies. Scanbot is backed by three venture capital companies: Freigeist, Target Partners, and Evoco.\u003c/p\u003e\n\u003cp\u003eWe are looking for a QA Automation Engineer (m/f/d) who will design and build modern CI/CD pipelines and tools to improve the quality of our products and enable faster releases. This is an ideal role if you would like to broaden your scope and understand different native and cross-platform technologies for mobile, web, and server-based environments. Our successful B2B product Scanbot SDK is used by large companies all around the world.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you will be doing\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop and maintain automated tests to validate the functionality of all our products.\u003c/li\u003e\n\u003cli\u003eDesign and develop tools to facilitate testing.\u003c/li\u003e\n\u003cli\u003ePartner closely with developer teams and product management to continuously improve our products.\u003c/li\u003e\n\u003cli\u003ePerform manual software testing and implement concepts to achieve full automation.\u003c/li\u003e\n\u003cli\u003eTroubleshoot automation tools.\u003c/li\u003e\n\u003cli\u003eHelp to maintain and improve our SDK example apps and technical documentation.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat are we looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEnthusiasm for shipping high-quality software by ensuring a great QA.\u003c/li\u003e\n\u003cli\u003e2+ years of experience in testing mobile and/or web apps.\u003c/li\u003e\n\u003cli\u003eFirst experience in developing Android and/or iOS apps with Android Studio and/or Xcode.\u003c/li\u003e\n\u003cli\u003eExperience with at least two of the following programming languages: Kotlin, Swift, JavaScript/TypeScript, C#, Dart, C++.\u003c/li\u003e\n\u003cli\u003eFamiliarity with programming script languages.\u003c/li\u003e\n\u003cli\u003eAdvanced experience with common CI/CD tools like Jenkins, as well as virtualization tools like Docker.\u003c/li\u003e\n\u003cli\u003eExperience with common software development tools like git (GitHub), bug, and issue tracking (JIRA).\n. Willingness to think outside the box of QA and to build skills in the development and DevOps areas to become an even better QA engineer.\u003c/li\u003e\n\u003cli\u003eExperience with cross-platform development frameworks like Cordova, Xamarin, React Native, Emscripten or Flutter would be a big plus.\u003c/li\u003e\n\u003cli\u003eExperience with cloud services is a plus (AWS, GCP).\u003c/li\u003e\n\u003cli\u003eFluency in English (fluency in German or other languages is not required, but a plus).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you can expect from us\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eResponsibility from the day you start.\u003c/li\u003e\n\u003cli\u003eExperience with cutting edge technologies like Machine Learning and Computer Vision.\u003c/li\u003e\n\u003cli\u003eAn experienced and inspiring team that is willing to ship improvements and features continuously.\u003c/li\u003e\n\u003cli\u003eA multitude of possibilities to improve professionally and personally.\u003c/li\u003e\n\u003cli\u003eA flat hierarchy with the possibility of direct influence.\u003c/li\u003e\n\u003cli\u003eModern tools and equipment (latest MacBooks / mobile devices / displays).\u003c/li\u003e\n\u003cli\u003eBeautiful and modern office right next to the Rhine river.\u003c/li\u003e\n\u003cli\u003eEasily accessible by train and car from the whole Cologne / Bonn area.\u003c/li\u003e\n\u003cli\u003eAn agile and flexible way of working.\u003c/li\u003e\n\u003cli\u003eSweet and healthy snacks and a large selection of drinks.\u003c/li\u003e\n\u003cli\u003e\"Come as you are Dresscode\".\u003c/li\u003e\n\u003cli\u003eLived Work-life balance.\u003c/li\u003e\n\u003cli\u003eAnd many more benefits.\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://scanbot.join.com/jobs/1797665-qa-automation-engineer-m-f-d-for-our-location-in-bonn?pid=71fbd6149a82b0b128ee\u0026amp;utm_source=stackoverflow\u0026amp;utm_medium=paid\u0026amp;utm_campaign=stackoverflow\u0026amp;utm_content=qa%2Bautomation%2Bengineer%2Bm%2Bf%2Bd%2B-%2Bfor%2Bour%2Blocation%2Bin%2Bbonn\"\u003ehttps://scanbot.join.com/jobs/1797665-qa-automation-engineer-m-f-d-for-our-location-in-bonn?pid=71fbd6149a82b0b128ee\u0026amp;utm_source=stackoverflow\u0026amp;utm_medium=paid\u0026amp;utm_campaign=stackoverflow\u0026amp;utm_content=qa%2Bautomation%2Bengineer%2Bm%2Bf%2Bd%2B-%2Bfor%2Bour%2Blocation%2Bin%2Bbonn\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--15d5c042005a6092997a926e942b77f24bb2783c/scanbot-sdk-1567511514-logo.png"
  },
  {
    "id": "6aa71001-c8e8-4c58-9bc6-72d05cb8ba99",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6aa71001-c8e8-4c58-9bc6-72d05cb8ba99",
    "created_at": "Thu Jan 21 15:51:45 UTC 2021",
    "company": "Bounteous",
    "company_url": "https://www.bounteous.com/",
    "location": "All Locations",
    "title": "PIM Developer",
    "description": "\u003cp\u003eWe are actively looking for a Developer to join our Data Management team! This position will be responsible for helping deliver some of our most complex PIM projects.  You will be working with a team of talented developers, leads, and architects to tackle important problems and resolve complex issues for some of the best companies and most recognizable brands on the Internet. You will be working in a distributed environment and must be able to be proactive and reach out to co-workers and clients on a regular basis.\u003c/p\u003e\n\u003cp\u003eIf you thrive in an environment where you are surrounded by motivated, energetic developers and technologists consider this opportunity the next step for you!\u003c/p\u003e\n\u003cp\u003eMinimum Qualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBA/BS in Computer Science or equivalent degree\u003c/li\u003e\n\u003cli\u003eMinimum of 3-5 years PHP, object-oriented programming, MVC applications, and web development experience\u003c/li\u003e\n\u003cli\u003eMinimum of 3 years of real-world e-commerce experience in the last 5 years\u003c/li\u003e\n\u003cli\u003eMinimum of 3 years of Symfony development experience\u003c/li\u003e\n\u003cli\u003eFamiliarity with the Agile development processes, including the use of coding standards and systems for version control, build, regression testing.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePreferred Qualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eActively participated in scalable website and web application development\u003c/li\u003e\n\u003cli\u003eHands-on experience with rich web front-end development frameworks and patterns – CSS, Html, JavaScript, RWD, PWA, React, Angular, HTML5\u003c/li\u003e\n\u003cli\u003eHands-on experience designing/developing/consuming APIs (REST, GraphQL)\u003c/li\u003e\n\u003cli\u003eHands-on experience working with relational databases and writing advanced SQL\u003c/li\u003e\n\u003cli\u003eRequire minimal supervision and provide oversight for assigned projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNice to Have's\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeCommerce platform engineering/business certifications.\u003c/li\u003e\n\u003cli\u003ePIM / MDM certifications (Akeneo, Enterworks, Salsify, other major enterprise PIM platform)\u003c/li\u003e\n\u003cli\u003eOther eCommerce platform experience (Magento, Shopify, Elastic path, Digital River)\u003c/li\u003e\n\u003cli\u003eExposure to Data Management platforms (PIM, MDM, DAM, ect.)\u003c/li\u003e\n\u003cli\u003eCMS exposure (AEM, Drupal, etc.)\u003c/li\u003e\n\u003cli\u003eAdvanced PHP and JavaScript\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/bounteous/55432fdb-e57d-4288-ac9c-0c9693b7e648?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/bounteous/55432fdb-e57d-4288-ac9c-0c9693b7e648?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e9a514e66d4b3bed31e386e7ab5d040b2b2f1b99/Bounteous%20Logo.jpeg"
  },
  {
    "id": "21135644-ddee-4259-8370-6759d9915168",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/21135644-ddee-4259-8370-6759d9915168",
    "created_at": "Thu Jan 21 14:52:51 UTC 2021",
    "company": "G-Research",
    "company_url": "https://www.gresearch.co.uk/",
    "location": "London, UK",
    "title": "Full Stack Software Engineer (C#/Angular)",
    "description": "\u003cp\u003eG-Research is Europe's leading quantitative finance research firm. We hire the brightest minds in the world to tackle some of the biggest questions in finance. We pair this expertise with machine learning, big data, and some of the most advanced technology available to predict movements in financial markets.\u003c/p\u003e\n\u003cp\u003eSoftware Engineering is core to our business. By designing and implementing real-time systems, our engineers are solving some of the world's most complex financial problems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Trading Platform Services Engineering group at G-Research consists of more than a dozen Software Engineers, and we are seeking additional engineers to join us. We are a customer-centric Engineering team working closely with our clients, with a strong focus on UX. Many of our projects involve working with other Engineering teams, making this an excellent opportunity to gain a good understanding of the business and trading platform.\u003c/p\u003e\n\u003cp\u003eWe are building cutting-edge systems to allow our clients to monitor and manage a complex platform in realtime. This includes platform configuration and release management for tens of thousands of trading services, and realtime processing of data streamed from systems all over the world. We leverage the latest technologies such as Kafka and Kubernetes to address the huge scale of the problems we are solving.\u003c/p\u003e\n\u003cp\u003eOur engineers are encouraged to take ownership of projects and deliver the best results using whichever technologies and methodologies they and the team see fit.\u003c/p\u003e\n\u003cp\u003eKey responsibilities of the role include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking in an agile, self-organising environment to develop full-stack web applications, with an emphasis on software engineering principles, effective UX, and polished UI design\u003c/li\u003e\n\u003cli\u003eIntegrating with trading platform components via a variety of mechanisms, e.g. REST APIs, Kafka\u003c/li\u003e\n\u003cli\u003eLiaising directly with customers to scope out, design and iterate on solutions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho are we looking for?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe ideal candidate will be an intelligent, passionate and creative software engineer with a proven ability to develop and deliver high-quality software. They will have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent OO programming skills, ideally in C# (or Java)\u003c/li\u003e\n\u003cli\u003eExperience with a frontend technology, e.g. Angular\u003c/li\u003e\n\u003cli\u003eA proven track record of full-stack engineering\u003c/li\u003e\n\u003cli\u003eExcellent communication skills\u003c/li\u003e\n\u003cli\u003eA self-starting attitude\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAdvantageous experience and skills include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with modern JavaScript frameworks and PWAs\u003c/li\u003e\n\u003cli\u003eUnderstanding of CI/CD principles and implementation, e.g. Jenkins\u003c/li\u003e\n\u003cli\u003eExposure to an agile and collaborative team environment\u003c/li\u003e\n\u003cli\u003eExperience with containers and cloud-native technologies, e.g. Docker, Kubernetes, Prometheus, .NET Core\u003c/li\u003e\n\u003cli\u003eExperience with messaging middlewares and stream processing technologies, e.g. Kafka\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy should you apply?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHighly competitive compensation plus annual discretionary bonus\u003c/li\u003e\n\u003cli\u003eInformal dress code and excellent work/life balance\u003c/li\u003e\n\u003cli\u003eComprehensive healthcare and life assurance\u003c/li\u003e\n\u003cli\u003e25 days holiday\u003c/li\u003e\n\u003cli\u003e9% company pension contributions\u003c/li\u003e\n\u003cli\u003eCycle-to-work scheme\u003c/li\u003e\n\u003cli\u003eSubsidised gym membership\u003c/li\u003e\n\u003cli\u003eMonthly company events\u003c/li\u003e\n\u003cli\u003eCentral London office close to 5 stations and 6 tube lines\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eApply on our website at \u003ca href=\"https://www.gresearch.co.uk/role/R524-Full-Stack-Software-Engineer/\"\u003ehttps://www.gresearch.co.uk/role/R524-Full-Stack-Software-Engineer/\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9326763f3832955eb1dbfa169a9842e8e447633b/logo.jpg"
  },
  {
    "id": "35842a28-ff88-47ba-99e5-f9960ae901a4",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/35842a28-ff88-47ba-99e5-f9960ae901a4",
    "created_at": "Wed Jan 20 20:13:28 UTC 2021",
    "company": "Mastermind",
    "company_url": "https://mastermind.co",
    "location": "Remote",
    "title": "Startup Software Developer",
    "description": "\u003cp\u003eThe Pandemic has turned the world upside-down and created an enormous opportunity to reinvent virtual learning. Mastermind is a high-growth, remote-first startup founded in 2020 focused on building a platform for Creators and next-gen teachers to share their passion/knowledge with the world and monetize their following with LIVE Courses and other virtual experiences.\u003c/p\u003e\n\u003cp\u003eFounded by repeat entrepreneurs Chris Sukornyk (formerly Chango) and Candice Faktor (formerly Wattpad) in 2020 you would be joining on the ground floor with and incredible team backed by major investors (yet to be announced). Come create the future of learning! You'll work on a small and extremely agile team, iterating rapidly toward the elusive Product-Market Fit. We hire for character first, skills second. Passion, curiosity and drive wanted!\u003c/p\u003e\n\u003cp\u003eAbout the Role\nIn your role as a full stack developer, you'll be working closely with a fast-moving product and technology team to push our product in new directions while also shaping the next iterations of the features our customers already love. You'll define the future of core pieces of our product across areas such as payments, reporting, security, video conferencing and more. From front-end usability to back-end algorithms, you'll hone your skills across multiple domains while helping to drive the product and vision forward.\u003c/p\u003e\n\u003cp\u003eSome of the responsibilities of a full stack developer at Mastermind are:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePerform end to end engineering of Mastermind’s core product from design, develop, test, release, deploy, upgrade and production\u003c/li\u003e\n\u003cli\u003ePerform code reviews for your peers\u003c/li\u003e\n\u003cli\u003eWhen required, participate in production support, including deployment, training and setting up and incident response\u003c/li\u003e\n\u003cli\u003eContribute to automation tools to aid development, testing and delivery of customer and product requirements\u003c/li\u003e\n\u003cli\u003eTake individual responsibilities to drive timely execution of projects and sprints, including estimates, status update and reviews\u003c/li\u003e\n\u003cli\u003eUphold the quality of the product or features, including unit test, functional test, integration, performance, security and scalability\u003c/li\u003e\n\u003cli\u003eUnderstand and contribute to company best practices for code quality and velocity\u003c/li\u003e\n\u003cli\u003eParticipate in architecture design and decisions, communicate significance/impact of a solution with the rest of the team\u003c/li\u003e\n\u003cli\u003eProduce documentation on code, system design, architecture and solutions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2-5 years of industry experience building fast, reliable, real-time web-based applications\u003c/li\u003e\n\u003cli\u003eExperience with NodeJS and React or similar technologies\u003c/li\u003e\n\u003cli\u003eA deep understanding of Typescript and Javascript APIs\u003c/li\u003e\n\u003cli\u003eKnowledge of relational and non-relational databases\u003c/li\u003e\n\u003cli\u003eExperience in working with modern build tools\u003c/li\u003e\n\u003cli\u003eUnderstand of common Design Patterns, OOPS concepts and SOLID design principles\u003c/li\u003e\n\u003cli\u003eA self-starter with a strong desire to work on a small collaborative team in an agile environment\u003c/li\u003e\n\u003cli\u003eAbility to collaborate with cross-functional team members\u003c/li\u003e\n\u003cli\u003eA pragmatic, customer-first, and get-things-done kind of attitude\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits and Perks\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTalented, passionate and collaborative team who will support and inspire you\u003c/li\u003e\n\u003cli\u003ePersonal growth plans that let you stretch yourself or grow in new directions\u003c/li\u003e\n\u003cli\u003eAnnual health \u0026amp; wellness stipend\u003c/li\u003e\n\u003cli\u003eAnnual online courses stipend\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:work@mastermind.co\"\u003ework@mastermind.co\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZytXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--431ee4b4de491ec2987b3d94250445b3ea5c0186/logo-small.png"
  },
  {
    "id": "dcf7cacf-ac39-4e6e-a5df-83135f69cff0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/dcf7cacf-ac39-4e6e-a5df-83135f69cff0",
    "created_at": "Wed Jan 20 14:03:36 UTC 2021",
    "company": "whynow",
    "company_url": "https://whynow.co.uk/",
    "location": "London",
    "title": "Full Stack Developer / WooCommerce Wizard",
    "description": "\u003cp\u003ewhynow is a new arts and culture digital platform promoting personal, powerful and positive stories in the capital and beyond.\u003c/p\u003e\n\u003cp\u003eAs a subscription platform, members of whynow get access to a growing range of videos, articles, podcasts and more.  We are looking for a woocommerce wizard who will work with us and be responsible for the maintenance and growth of both our frontend checkout system, built in React and the accompanying custom woocommerce extensions written in PHP running on our headless CMS.\u003c/p\u003e\n\u003cp\u003eThis position requires full stack programming skills in the following technologies: (Woocommerce, React, PHP, SQL, writing tests). The candidate should have a strong understanding of woocommerce and wordpress as a content management system. Although this is a focused position the ideal candidate should have a good grasp on the entire web development process from UX design through to development, testing and deployment. The candidate would need to have the ability to follow and track issues, write code and test changes on both the frontend and backend of our checkout system.\u003c/p\u003e\n\u003cp\u003eAs we are a young company in constant evolution our long term goal for this role would also be to facilitate moving away from the dependency on woocommerce at scale. This would involve consultancy on the alternative e-commerce packages available and working on the migration itself which would involve some nifty script writing and SQL query abilities.\nResponsibilities\nDeveloping and optimising the overall frontend checkout process\nDeveloping and maintaining the backend of the checkout\nMonitoring woocommerce version updates and addressing breaking changes\nBuild on and develop and test our coupon and promotional systems\nWrite tests for edge cases to catch potential bugs on checkout\nTroubleshooting customer subscription reporting that feeds into google analytics and hubspot\nConsulting and research on viable ecommerce platform alternatives\nFacilitating potential migration to another CMS and ecommerce platform at scale\nWorking on the development of new ecommerce features such as a store\u003c/p\u003e\n\u003cp\u003eSkills Required\nComplete understanding of web development basics:\nHTML5\nCSS3\nJavaScript\nStrong understanding of the woocommerce platform and some experience developing in this environment\nSolid understanding of development in the following web technologies relevant to our stack:\nReact\nPHP\nSQL\nExperience developing fully responsive ecommerce websites and applications\nComfortable working with chrome inspector debugging tools\nKnowledge of headless cms architecture and how to interact with RESTful APIs and data in JSON format\nProficient working knowledge of git version control\nStrong understanding of PHP development and wordpress\u003c/p\u003e\n\u003cp\u003ePLEASE NOTE:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eThis is a programming job. You MUST have 4+ years experience in web and software development technology.\u003c/li\u003e\n\u003cli\u003eYou MUST have experience in woocommerce or have completed some online training in this platform to be considered for this role.\u003c/li\u003e\n\u003cli\u003eYou MUST be in London and able to come into the office and work on location.\u003c/li\u003e\n\u003cli\u003eYou MUST be fluent in English.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eSalary competitive\nHoliday standard\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease email your CV and a cover letter to me at \u003ca href=\"mailto:connor@whynow.co.uk\"\u003econnor@whynow.co.uk\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1NXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--65a93ab1c962ad69d2724d5791201cb0f2377646/whynow-login-logo.png"
  },
  {
    "id": "e8745221-0880-4833-b564-5a9f7848b2b9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e8745221-0880-4833-b564-5a9f7848b2b9",
    "created_at": "Tue Jan 19 20:31:59 UTC 2021",
    "company": "ScriptDrop",
    "company_url": "http://ScriptDrop.co",
    "location": "Remote ",
    "title": "Software Developer ",
    "description": "\u003cp\u003eScriptDrop is looking for software engineers to help us scale our prescription delivery product. We are already actively delivering in markets across the U.S. and engineers will help build out additional integrations, features and new products.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Ability to own your technical stories and assignments —from writing code, clarifying requirements, meeting project timelines and delivering high-quality, workable features.\u003c/p\u003e\n\u003cp\u003e-Actively participate in design and architecture for assigned projects including design reviews and code reviews.\u003c/p\u003e\n\u003cp\u003e-Foster proactive and cooperative relationships within the project team.\u003c/p\u003e\n\u003cp\u003e-Exercise independent judgment in selecting methods and techniques for obtaining solutions.\u003c/p\u003e\n\u003cp\u003e-Code and test Elixir applications in accordance to design specifications and standards.\u003c/p\u003e\n\u003cp\u003e-Analyze applications and make necessary changes to optimize performance.\u003c/p\u003e\n\u003cp\u003e-Follow up with bugs in an efficient manner, including working hand in hand with test and support.\u003c/p\u003e\n\u003cp\u003e-Work with a variety of technical and non-technical people.\u003c/p\u003e\n\u003cp\u003e-Embrace changing requirements.\u003c/p\u003e\n\u003cp\u003e​\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-2-5 years of programming experience.\u003c/p\u003e\n\u003cp\u003e-Hands-on experience with various SQL databases (Postgres, MySQL, etc.).\u003c/p\u003e\n\u003cp\u003e-Hands-on programming experience with web UI development (HTML, CSS, JavaScript, React).\u003c/p\u003e\n\u003cp\u003e-Unit testing and logging.\u003c/p\u003e\n\u003cp\u003e-Strong communication skills.\u003c/p\u003e\n\u003cp\u003e-Hands-on experience with Elixir, Erlang or Ruby is a plus.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eVisit scriptdrop.co\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlNWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e12ea0dd6432ee35d482ca1fe8f47720b288fd45/Heart%20Icon%20-%20Navy%20Solid%20(RGB).png"
  },
  {
    "id": "c34a9766-5aab-4bba-b485-ba1e77ec8a6e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c34a9766-5aab-4bba-b485-ba1e77ec8a6e",
    "created_at": "Tue Jan 19 12:45:03 UTC 2021",
    "company": "CompuGroup Medical SE \u0026 Co. KGaA",
    "company_url": "https://vonq.io/3bPiMGR",
    "location": "Koblenz oder Home Office",
    "title": "Fullstack-Entwickler React/Java (m/w/d) Clickdoc Videosprechstunde",
    "description": "\u003ch2\u003eCompuGroup Medical hilft heilen\u003c/h2\u003e\n\u003cp\u003eCompuGroup Medical liefert wichtige Software, um Gesundheit und Lebensqualität zu verbessern. Wir bauen Brücken zwischen Ärzten, Apothekern, Kostenträgern, Laboren, Reha- und Pflegeeinrichtungen und Krankenhäusern und helfen ihnen, Menschen optimal zu versorgen. Die Arbeit aller medizinischen Leistungserbringer zu verstehen und immer mehr zu erleichtern ist unser Ziel. Seit über 30 Jahren unterstützen wir unsere Kunden, Informationen sicher zu speichern, auszutauschen und Wissen abzufragen.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFührendes internationales e-Health Unternehmen\u003c/li\u003e\n\u003cli\u003e746 Mio. € Jahresumsatz in 2019\u003c/li\u003e\n\u003cli\u003eCa. 6100 Mitarbeiter weltweit\u003c/li\u003e\n\u003cli\u003eEinzigartige Kundenbasis mit über 1 Mio. professionellen Nutzern weltweit\u003c/li\u003e\n\u003cli\u003eStandorte in 18 und Produkte in 56 Ländern\u003c/li\u003e\n\u003cli\u003eÜber 30 Jahre erfolgreich im Markt\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAls Fullstack-Entwickler React/Java (m/w/d) Clickdoc Videosprechstunde gestalten Sie heute schon mit, was die Zukunft bringt!\u003c/h2\u003e\n\u003cp\u003eUnser Produkt CLICKDOC PRO bringt Ärzte und Patienten über digitale\nTerminvereinbarungen und Sprechstunden schnell und sicher zueinander - über alle Endgeräte hinweg. Wie unsere rasant anwachsende Nutzerbasis wächst auch unser Team. Sie sind ein Softwareentwickler (m/w/d), der den Deep-Dive ins Gesundheitswesen sucht? Und nebenbei mit seinem Code Prozesse verbessern will, die einen maßgeblichen Beitrag zur Verbesserung des Gesundheitswesens leisten? Dann freuen wir uns auf Sie!\u003c/p\u003e\n\u003ch2\u003eIhr Beitrag:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eIn einem agilen Team (Scrum) arbeiten Sie als Softwareentwickler (m/w/d) an der Weiterentwicklung unserer Plattform für die sichere Videokommunikation für Ärzte und Krankenhäuser\u003c/li\u003e\n\u003cli\u003eHier arbeiten Sie mit Technologien wie ReactJS, HTML CSS, WebRTC und NodeJS sowie Java, Hibernate, Spring Boot und Groovy\u003c/li\u003e\n\u003cli\u003eÜber Code Reviews, Unit- und Integrationstest und Dokumentationen sichern Sie Ihre Arbeit übergreifend ab\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWas uns wichtig ist:-\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSie verfügen über eine abgeschlossene Ausbildung, z. B. als Fachinformatiker (m/w/d) oder ein abgeschlossenes Studium im Bereich IT, z. B. in Informatik, Software Engineering oder Computer Sciences\u003c/li\u003e\n\u003cli\u003eSie bringen Berufserfahrungen eines modernen Javascript Framework (React, Angular oder VueJS) mit\u003c/li\u003e\n\u003cli\u003eAußerdem besitzen Sie Kenntnisse in Hibernate, Spring Boot, Groovy, WebRTC und NodeJS und kennen sich mit MySQL und REDIS aus\u003c/li\u003e\n\u003cli\u003eFließende Deutsch- und Englischkenntnisse runden Ihr Profil ab\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWas Sie von uns erwarten können:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eFreiraum für Ihre Ideen innerhalb eines internationalen und hochspezialisierten Marktführer-Umfeldes\u003c/li\u003e\n\u003cli\u003eEine hohe, agile Lernkultur und engen Zusammenhalt im Team\u003c/li\u003e\n\u003cli\u003eFlache Hierarchien und kurze Entscheidungswege innerhalb der Abteilungen\u003c/li\u003e\n\u003cli\u003eModerne Technologien innerhalb eines stabilen Tech-Stacks\u003c/li\u003e\n\u003cli\u003eVielfältige Weiterentwicklungsmöglichkeiten und langfristige Perspektiven innerhalb des Unternehmens\u003c/li\u003e\n\u003cli\u003eZuschuss zur betrieblichen Altersvorsorge als Baustein einer sicheren Zukunft\u003c/li\u003e\n\u003cli\u003eZugang zu Rabatten und Sonderangeboten für Mitarbeitende\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSie erleichtern es uns schnell richtige Entscheidungen zu treffen, wenn Sie uns über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e Ihre aussagekräftigen Unterlagen mit Ihren Gehaltsvorstellungen übermitteln.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSynchronizing Healthcare\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWerden Sie jetzt ein Teil davon!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKennziffer:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ereq5497\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eStandort:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBünde, Koblenz oder Home Office\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJob Segment:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSoftware Development\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKontakt:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"mailto:career@cgm.com\"\u003ecareer@cgm.com\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3bPiMGR\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://vonq.io/3bPiMGR\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDZWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c92809e47ffac98fb21e3cbe8567ee36d33d1a2e/Compugroup.jpg"
  },
  {
    "id": "85c06c71-e088-413c-9db2-a6709ecba809",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/85c06c71-e088-413c-9db2-a6709ecba809",
    "created_at": "Tue Jan 19 10:51:00 UTC 2021",
    "company": "CompuGroup Medical SE \u0026 Co. KGaA",
    "company_url": "https://vonq.io/3oZQ35Z",
    "location": "Nürnberg",
    "title": "Webentwickler Typescript / Angular (m/w/d)",
    "description": "\u003ch2\u003eCompuGroup Medical hilft heilen\u003c/h2\u003e\n\u003cp\u003eCompuGroup Medical liefert wichtige Software, um Gesundheit und Lebensqualität zu verbessern. Wir bauen Brücken zwischen Ärzten, Apothekern, Kostenträgern, Laboren, Reha- und Pflegeeinrichtungen und Krankenhäusern und helfen ihnen, Menschen optimal zu versorgen. Die Arbeit aller medizinischen Leistungserbringer zu verstehen und immer mehr zu erleichtern ist unser Ziel. Seit über 30 Jahren unterstützen wir unsere Kunden, Informationen sicher zu speichern, auszutauschen und Wissen abzufragen.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFührendes internationales e-Health Unternehmen\u003c/li\u003e\n\u003cli\u003e746 Mio. € Jahresumsatz in 2019\u003c/li\u003e\n\u003cli\u003eCa. 6100 Mitarbeiter weltweit\u003c/li\u003e\n\u003cli\u003eEinzigartige Kundenbasis mit über 1 Mio. professionellen Nutzern weltweit\u003c/li\u003e\n\u003cli\u003eStandorte in 18 und Produkte in 56 Ländern\u003c/li\u003e\n\u003cli\u003eÜber 30 Jahre erfolgreich im Markt\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAls Webentwickler Typescript / Angular (m/w/d) gestalten Sie heute schon mit, was die Zukunft bringt!\u003c/h2\u003e\n\u003cp\u003ePrägen Sie als Webentwickler Typescript / Angular (m/w/d) unsere Software mit Ihrer Vision und programmieren Sie die digitale Zukunft des Gesundheitswesens! Mit CGM haben Sie Zugriff auf Erfahrungswerte von Jahrzehnten und gleichzeitig die Möglichkeit, mit uns gemeinsam Ihren Beitrag zu einer Verbesserung der medizinischen Versorgung zu leisten.\u003c/p\u003e\n\u003ch2\u003eIhr Beitrag:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eIn einem agilen Team (Scrum, SAFe) entwickeln Sie komplexe, international genutzte Web-Anwendungen auf Basis von Angular 8, TypeScript und HTML5\u003c/li\u003e\n\u003cli\u003eDazu programmieren Sie in enger Abstimmung mit unseren UX Experten kundenorientierte Lösungen auf höchstem Niveau\u003c/li\u003e\n\u003cli\u003eÜber Code Reviews, Unit- und Integrationstest und Dokumentationen sichern Sie Ihre Arbeit übergreifend ab\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWas uns wichtig ist:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossene Ausbildung, z. B. als Fachinformatiker (m/w/d) oder Studium im Bereich IT, z. B. in Informatik, Software Engineering oder Computer Sciences\u003c/li\u003e\n\u003cli\u003eErste Berufserfahrung in der Softwareentwicklung mit Angular, TypeScript, JavaScript und HTML5\u003c/li\u003e\n\u003cli\u003eIdealerweise haben Sie bereits Kenntnisse über den Aufbau von Monitoring Infrastrukturen sowie PaaS / IaaS Plattformen und Kotlin\u003c/li\u003e\n\u003cli\u003eFließende Englischkenntnisse (C1) und erste Deutschkenntnisse (mind. A2)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWas Sie von uns erwarten können:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eGestalten Sie die Plattform, mit der Tausende Apotheken ihre Prozesse digitalisieren, und machen Sie unsere Anwendungen fit für das rasante Wachstum unserer internationalen Nutzerbasis\u003c/li\u003e\n\u003cli\u003eDabei erhalten Sie einen tiefen Einblick in das Gesundheitswesen, eine Domäne mit stabiler Wachstumsaussicht und langfristiger Perspektive\u003c/li\u003e\n\u003cli\u003eEntwickeln Sie in einem agilen Team herausfordernde Technik mit höchster Sicherheit für komplexe Anwendungsfälle\u003c/li\u003e\n\u003cli\u003eAktuellste Technologien und Tools geben Ihnen Freiraum für Ihre Ideen und die Möglichkeit, die eignen Kompetenzen sukzessive auszubauen\u003c/li\u003e\n\u003cli\u003eNationale und internationale Entwicklungsmöglichkeiten sowie zahlreiche Weiterbildungsmaßnahmen und Schulungen unterstützen Sie in Ihren persönlichen Ambitionen\u003c/li\u003e\n\u003cli\u003eUnser umfangreiches betriebliches Gesundheitsmanagement fördert Sie in Ihrem Wohlbefinden\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSie erleichtern es uns schnell richtige Entscheidungen zu treffen, wenn Sie uns über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e Ihre aussagekräftigen Unterlagen mit Ihren Gehaltsvorstellungen übermitteln.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSynchronizing Healthcare\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWerden Sie jetzt ein Teil davon!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKennziffer:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ereq5252\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eStandort:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNürnberg\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJob Segment:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSoftware Development\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKontakt:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"mailto:career@cgm.com\"\u003ecareer@cgm.com\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3oZQ35Z\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://vonq.io/3oZQ35Z\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGVWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--43b76ff274351e995c62f587302be85802e8c6c6/Compugroup.jpg"
  },
  {
    "id": "9c321633-2c98-44d7-a09e-8f3a5f8edd16",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9c321633-2c98-44d7-a09e-8f3a5f8edd16",
    "created_at": "Mon Jan 18 19:42:36 UTC 2021",
    "company": "EME Hive",
    "company_url": "http://emehive.co",
    "location": "New York City",
    "title": "Software Engineer w/ Ruby Experience",
    "description": "\u003cp\u003eWHO WE ARE\u003c/p\u003e\n\u003cp\u003eEME Hive is a community-based, social live streaming app for finding like-minded friends and partners. Through the power of live streaming technology, users are able to form real-time connections with members of their own communities. By offering a subscription dating service as well as a live streaming platform, EME makes it easy for users to flirt, chat, and date in real-time -- all within the same app!\u003c/p\u003e\n\u003cp\u003eWe are a team of innovative, and friendly individuals who are redefining the rules of connecting with others. We believe that our dedication to livestreaming and online dating technologies will bring highly efficient and safer connections to many minority communities all over the world. We are currently looking for a Software Engineer with Ruby on Rails experience to join our growing team and share our enthusiasm for taking on today’s toughest challenges in livestreaming.\u003c/p\u003e\n\u003cp\u003eWHO YOU ARE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperienced software engineer - with high level technical skill\u003c/li\u003e\n\u003cli\u003eCollaborative, and excited to be a key player in the team\u003c/li\u003e\n\u003cli\u003ePassionate about open source technology, continuous learning, pair programming, peer code reviews, and technical talks\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWHAT YOU'LL DO\u003c/p\u003e\n\u003cp\u003eEME Hive is looking for a Software Engineer with Ruby on Rails experience to join our team and help drive the future of our business. You will be working with highly motivated and extremely talented engineers with quality, performance and scale in mind. Our core belief is that the customers are our number one priority so we work hard to deliver value back to them with everything we do. We believe strongly in team ownership of systems, which includes defining the vision of the services to prioritization of projects.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuilding EME Hive's best-in-class web-based UI that emphasizes ease-of-use, simplicity, clarity, and performance\u003c/li\u003e\n\u003cli\u003eContributing to all aspects of the services under the team’s ownership, which includes developing new and innovative features\u003c/li\u003e\n\u003cli\u003eOptimizing for scale\u003c/li\u003e\n\u003cli\u003eIdentifying opportunities for process and tool improvements\u003c/li\u003e\n\u003cli\u003eCollaborating on the vision of the services under the team's ownership\nOther responsibilities;\u003c/li\u003e\n\u003cli\u003eEngineers are expected to support systems they develop in production\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWHAT YOU MUST HAVE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eBS or MS degree in Computer Science\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e2+ years of relevant software development experience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDeep technical background coding in JavaScript, HTML, and CSS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience shipping iOS applications or Web applications with Ruby on Rails\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with software engineering practices (e.g., unit testing, code reviews, design documentation)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong knowledge of how the Web works and how to make it efficient (HTTP, caching, page rendering, etc)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSolid software development fundamentals (Data Structures, algorithms, problem solving, OO Design, and system architecture)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience working closely across a variety of teams including product management, designers, and backend engineers\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility to clearly communicate to technical and non-technical audiences\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA dedicated and enthusiastic approach to solving problems\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePassionate about what you do and care deeply about the things you build\nWHAT WE'D LIKE YOU TO HAVE, BUT NOT A DEAL BREAKER\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eData-informed product development experience (e.g., analytics, A/B testing)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with some technologies: AWS, Docker, Android or Machine Learning\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume and cover letter to \u003ca href=\"mailto:recruiting@emehive.co\"\u003erecruiting@emehive.co\u003c/a\u003e.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc21WIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--901f710581337a122dc565db7898bae68fd05007/purple.png"
  },
  {
    "id": "45fae1ec-9bcc-42a0-992e-ae3d2dfb5e26",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/45fae1ec-9bcc-42a0-992e-ae3d2dfb5e26",
    "created_at": "Mon Jan 18 08:50:43 UTC 2021",
    "company": "InnoGames GmbH",
    "company_url": "https://www.innogames.com",
    "location": "Hamburg",
    "title": "Frontend Developer (Haxe) - Video Game: Forge of Empires",
    "description": "\u003cp\u003eOur agile and cross-functional \u003cstrong\u003eForge of Empires\u003c/strong\u003e team is searching for a \u003cstrong\u003eFrontend Developer\u003c/strong\u003e:\u003c/p\u003e\n\u003cp\u003eAs a Frontend Developer, you will join a feature team of the Forge of Empires project to support growth, technical stability and longevity of our game.\u003c/p\u003e\n\u003cp\u003eAre you a talented Game Developer and passionate about online games? Live your passion for online games/Game Development and collaborate with like-minded people to provide the best user experience for our players!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContribute to the continuous development and improvement of one of our keystone games\u003c/li\u003e\n\u003cli\u003eDevelop new features and improve existing game features with a strong focus on UI and UX\u003c/li\u003e\n\u003cli\u003eParticipate in the whole feature development lifecycle with a commitment to high-quality results\u003c/li\u003e\n\u003cli\u003eCollaborate closely with Mobile- \u0026amp; Backend Developers, Game Designers, and Artists to implement new game features for our browser clients\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour skillset:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking experience in Frontend/Game Development with Haxe. ActionScript 3 or JavaScript experience is a bonus.\u003c/li\u003e\n\u003cli\u003eA right eye for details and a passion for implementing UI and UX\u003c/li\u003e\n\u003cli\u003eWell-versed in design patterns and software architecture\u003c/li\u003e\n\u003cli\u003eExperience with writing browser automation tests\u003c/li\u003e\n\u003cli\u003eSolution-oriented and efficient style of work\u003c/li\u003e\n\u003cli\u003eTeam player and a good communicator with fluent English language skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eFavorable\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassion for online games (strategy/F2P) and knowledge of relevant game mechanics\u003c/li\u003e\n\u003cli\u003eProfessional experience in the gaming industry, ideally working on comparable browser games\u003c/li\u003e\n\u003cli\u003eTheoretical understanding of Software Development, ideally based on a University degree in Computer Sciences, Business Information Systems or similar studies\u003c/li\u003e\n\u003cli\u003eKnow your way around popular scripting languages (Python / Bash / Groovy)\u003c/li\u003e\n\u003cli\u003eA proactive and motivated individual with a willingness to learn\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour power-ups:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGet competitive compensation as well as a sabbatical, mobile device, contribution to your public transport ticket, and more\u003c/li\u003e\n\u003cli\u003eDe-stress your private life with flexible working hours, the in-house gym, services such as a hairdresser, massage, bike inspection, and more\u003c/li\u003e\n\u003cli\u003eParticipate in tons of the company's get-togethers ranging from an in-house sofa concert to a virtual wine tasting\u003c/li\u003e\n\u003cli\u003eMake the most of our excellent training and development opportunities\u003c/li\u003e\n\u003cli\u003eFeel comfortable in an atmosphere to empower creative thinking and strong results\u003c/li\u003e\n\u003cli\u003eWork in an agile multicultural team – enabling you and your team to form and actively optimize work processes\u003c/li\u003e\n\u003cli\u003eOur company language is English, and we support all our employees and their partners with optional German lessons\u003c/li\u003e\n\u003cli\u003eReceive exceptional support with your relocation to Hamburg\u003c/li\u003e\n\u003cli\u003eShape the success story of InnoGames with our international team of driven experts in a stable growing company and award-winning employer\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur story:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInnoGames is Germany's leading developer and publisher of mobile and online games.\nThe company based in Hamburg is best known for Forge of Empires, Elvenar, and Tribal Wars. InnoGames' complete portfolio encompasses seven live games and several mobile titles in production.\u003c/p\u003e\n\u003cp\u003eBorn as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years.\nTo further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExcited to start your journey with InnoGames and join our dynamic team as a Frontend Developer?\u003c/strong\u003e\nWe look forward to receiving your application as well as your salary expectations and earliest possible starting date through our \u003ca href=\"https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub\"\u003eonline application form\u003c/a\u003e. Maximilian Kaeding would be happy to answer any questions you may have.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eApply and #stayhome!\u003c/strong\u003e\nDue to the \u003cstrong\u003ecoronavirus\u003c/strong\u003e outbreak, we switched our operations company-wide to home office and turned our hiring process into a \u003cstrong\u003efully virtual one\u003c/strong\u003e.\nWhen hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly.\nStay home and safe!\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub\"\u003ehttps://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVNWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--061afcc4596a7ac73b32e8a42dcfef844068986e/logo_innogames_devlop.png"
  },
  {
    "id": "168da008-9bc4-4154-8e6e-4b7c9cc820b2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/168da008-9bc4-4154-8e6e-4b7c9cc820b2",
    "created_at": "Sat Jan 16 16:31:21 UTC 2021",
    "company": "The Software Revolution, Inc.",
    "company_url": "http://www.tsri.com",
    "location": "Kirkland, WA",
    "title": "Senior Java Specialist - Optimization, Performance, Cloud",
    "description": "\u003cp\u003eTSRI has an opportunity for a Senior Java Software Developer to join our team supporting a major software modernization project. Preferably becoming a long term employee with full benefits, but individual contractors welcome as well.\u003c/p\u003e\n\u003cp\u003eKey Need:   Java, web client Service Request Optimization, with Web Peformance and a focus on  System performance.   JAVA development experience with successful implementations in OpenShift/Linux.\u003c/p\u003e\n\u003cp\u003eOur site:  \u003ca href=\"http://www.tsri.com\"\u003ewww.tsri.com\u003c/a\u003e    -- we have done numerous systems where we translate the legacy language into a modern language or framework of services ever since we spun out of Boeing in 1995.\u003c/p\u003e\n\u003cp\u003eLocation: Seattle Metro Area. Due to COVID the position requires work from home with high bandwidth Internet access and experience in remote development. Post COVID development work will require physical presence during normal business work hours at TSRI Headquarter office in Kirkland, WA.\u003c/p\u003e\n\u003cp\u003eRequired Qualification\u003c/p\u003e\n\u003cp\u003e-- Bachelor's degree computer science, software engineering, or related discipline.\u003c/p\u003e\n\u003cp\u003e-- 5-10 years of working experience in Java development\u003c/p\u003e\n\u003cp\u003e-- Experience with Web application frameworks, Web programming (Spring, HTML, CSS, JavaScript), SQL and relational databases, and Python scripting language is a plus.\u003c/p\u003e\n\u003cp\u003eTravel Required: None\u003c/p\u003e\n\u003cp\u003eWho is Eligible:  US Citizen, Green Card, NAFTA in that order.   No H1B/Stem as we are hoping for a long term employee capable of getting a clearance, though this project does NOT require a clearance.   We will work with contractors 1099/C2C or W2 without benefits, and of course Employees of ours receive generous benefits AND stock options as well.\u003c/p\u003e\n\u003cp\u003eSalary/Contract Rate: Open - we do have good medical, 401K, stock as part of the package.\u003c/p\u003e\n\u003cp\u003eTechnologies/Frameworks: Extreme Programming variant on Agile/Scrum, with gitLab, and other tool techs supporting a CI/CD environemnt on top of UNIX/LINUX.\u003c/p\u003e\n\u003cp\u003eBackground: Working with both TSRI and customer senior developers, within an agile Kanban software development team, Java design and implementation development efforts in support of a larger modernization project contract. The target for this modernization effort is a Spring Framework Java application with PostgreSQL database hosted on OpenShift/Linux/OpenStack environment. The effort will require understanding of modern Java implementations, Spring Framework, JDBC, database caching schemes and frameworks. A successful candidate will carry out performance analysis and improvements in the Java application, database access and in the end-to-end environment. Experience with profiling tools, finding checkpoints, identify performance refactoring’s and validating those improvements. Understanding of legacy MUMPS and Cache’ is helpful.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cp\u003e-- Requirements gathering and refinement, review and research Java implementation and performance refactoring for the target OpenShift/Linux environment.\u003c/p\u003e\n\u003cp\u003e-- Software design, utilizing object-oriented principles implement solutions in Java operating on OpenShift/Linux/Linux environment.\u003c/p\u003e\n\u003cp\u003e-- Profiling implementation, identification of bottlenecks and refactoring.\u003c/p\u003e\n\u003cp\u003e-- Develop software unit tests, add instrumentation for performance profiling, measure profiling results and refactor code in question.\u003c/p\u003e\n\u003cp\u003e-- Familiarity with latest performance profiling tools, Jprofiler and APM tools and services.\u003c/p\u003e\n\u003cp\u003e-- Help maintain code quality, organization, and automatization. Executing software quality packages (i.e. Sonarqube) and refactoring.\u003c/p\u003e\n\u003cp\u003e-- Translate application story’s, tasks and use cases into functional implementations.\u003c/p\u003e\n\u003cp\u003e-- Design, build, and maintain efficient, reusable, and reliable JAVA code.\u003c/p\u003e\n\u003cp\u003e-- Ensure the best possible performance, quality, and responsiveness of applications.\u003c/p\u003e\n\u003cp\u003e-- Identify bugs, and devise solutions to these problems.\u003c/p\u003e\n\u003cp\u003e-- Strong written and verbal communications and good scrum team contributor.\u003c/p\u003e\n\u003cp\u003eKey Qualifications\u003c/p\u003e\n\u003cp\u003eJAVA development experience with successful implementations in OpenShift/Linux\u003c/p\u003e\n\u003cp\u003eRequired Qualification\u003c/p\u003e\n\u003cp\u003e-- Bachelor's degree computer science, software engineering, or related discipline.\u003c/p\u003e\n\u003cp\u003e-- 5-10 years of working experience in Java development\u003c/p\u003e\n\u003cp\u003e-- Experience with Web application frameworks, Web programming (Spring, HTML, CSS, JavaScript), SQL and relational databases, and Python scripting language is a plus.\u003c/p\u003e\n\u003cp\u003eSkills\u003c/p\u003e\n\u003cp\u003e-- Proficient in JAVA, with a good knowledge of its ecosystems.\u003c/p\u003e\n\u003cp\u003e-- Past working experience or strong familiarity Java projects in production.\u003c/p\u003e\n\u003cp\u003e-- Proficient in Spring Framework.\u003c/p\u003e\n\u003cp\u003e-- Experience in Java caching frameworks (e.g., Ehcache, Redis, MemCache, Hazelcast).\u003c/p\u003e\n\u003cp\u003e-- Familiarity with the OpenShift/Linux core framework.\u003c/p\u003e\n\u003cp\u003e-- Skilled in writing reusable JAVA libraries.\u003c/p\u003e\n\u003cp\u003e-- Familiarity with Containers, REST API and orchestration.\u003c/p\u003e\n\u003cp\u003e-- Familiar with various design and architectural patterns and object-oriented design principles.\u003c/p\u003e\n\u003cp\u003e-- Familiarity with PostgreSQL Server\u003c/p\u003e\n\u003cp\u003e-- Understanding fundamental design principles behind a scalable application.\u003c/p\u003e\n\u003cp\u003e-- Implementing automated testing platforms and unit tests.\u003c/p\u003e\n\u003cp\u003e-- Proficient understanding of code versioning tools Git and Mercurial, and GitFlow best practices.\u003c/p\u003e\n\u003cp\u003e-- Familiarity with Continuous Integration, DevSecOps and Continuous Deployment software pipelines.\u003c/p\u003e\n\u003cp\u003e-- Familiarity with OpenStack services, software profilers and APM packages in the OpenShift Private Cloud environment\u003c/p\u003e\n\u003cp\u003e-- Experienced in Agile development methodologies (e.g., Scrum, Kanban)\u003c/p\u003e\n\u003cp\u003e-- Understanding of Model-View-Controller (MVC) and/or related frameworks (e.g., AngularJS, React) is a plus.\u003c/p\u003e\n\u003cp\u003e-- Familiarity with MUMPS and Cache’ is of significant benefit to this position.\u003c/p\u003e\n\u003cp\u003eTSRI is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"mailto:mnewcomb@tsri.com\"\u003emnewcomb@tsri.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDZWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d26bbfaef23c8cdff8a64a49ed36ec4940e32730/tsri.GIF"
  },
  {
    "id": "53a94d51-1dfa-4b24-8140-7dbf80c798fd",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/53a94d51-1dfa-4b24-8140-7dbf80c798fd",
    "created_at": "Fri Jan 15 16:39:10 UTC 2021",
    "company": "Skoobe",
    "company_url": "https://www.skoobe.de",
    "location": "Munich",
    "title": "Senior Frontend Developer (m/f/d)",
    "description": "\u003cp\u003eSkoobe is currently looking for a talented and experienced frontend developer with strong skills in HTML5, CSS3, JavaScript, REST, responsive web design, building management and UI testing tools for our office in Munich, Germany. You are able to apply your technical skills that you have acquired over many years (5+) effectively and you have great communication skills to advance our projects together with Skoobe’s project managers, designers and the back-end team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork as a part of our front-end team and be responsible for diverse and challenging front-end development efforts\u003c/li\u003e\n\u003cli\u003eImplement robust front-ends for mobile and web\u003c/li\u003e\n\u003cli\u003eThink about security, performance, caching and SEO\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience designing and writing web front-end applications\u003c/li\u003e\n\u003cli\u003eExtensive development experience in HTML5, CSS3 and JavaScript (ES6/7)\u003c/li\u003e\n\u003cli\u003eGood knowledge of back-end web interface in REST\u003c/li\u003e\n\u003cli\u003eExtensive knowledge of build tools like grunt, gulp or web-pack.\u003c/li\u003e\n\u003cli\u003eExtensive knowledge of UI testing tools like Jasmine, Karma, Mocha, Jest\u003c/li\u003e\n\u003cli\u003eExperience with Docker is a plus\u003c/li\u003e\n\u003cli\u003eYou are smart, adaptive and resourceful in finding good and practical solutions\u003c/li\u003e\n\u003cli\u003eYou are a good communicator\u003c/li\u003e\n\u003cli\u003eYou feel comfortable in an English-speaking work environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary\u003c/li\u003e\n\u003cli\u003eFlexible working hours and home office option\u003c/li\u003e\n\u003cli\u003eSkoobe VIP account – with free access to our digital library\u003c/li\u003e\n\u003cli\u003eTeam events and weekly team lunch\u003c/li\u003e\n\u003cli\u003eRegular attendance on industry events and trade shows\u003c/li\u003e\n\u003cli\u003eAccess to Campus Success, the online learning platform from Holtzbrinck Group\u003c/li\u003e\n\u003cli\u003eDynamic work environment\u003c/li\u003e\n\u003cli\u003eGerman language class for international applicants\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSkoobe is a Munich based start-up, financed by the publishing groups Georg von Holtzbrinck, Random House and Thalia. We spark passion for reading with the best app to discover (audio)books, an excellent reading and listening experience on different mobile devices, a fair price and an outstanding service. We focus on quality, speed and the needs of our customers.\u003c/p\u003e\n\u003cp\u003eSkoobe offers fast realisation of your ideas, space for open discussions, a goal-oriented work style and a supportive environment with flat hierarchies. You help to bring a global product forward and get free access to more books than you could ever read in your life. Our quiet and nicely collaborative open-plan office is located in the city center of Munich, close to a number of public transport options.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBecome part of our success!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf you have a passion for books as well as digital devices and want to become part of a young company in a traditional field. \u003cstrong\u003eWe are looking forward to receiving your application including your expected salary!\u003c/strong\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://skoobe.join.com/jobs/1779982-senior-frontend-developer-m-f-d?pid=71fbd6149a82b0b128ee\u0026amp;utm_source=stackoverflow\u0026amp;utm_medium=paid\u0026amp;utm_campaign=stackoverflow\u0026amp;utm_content=senior%2Bfrontend%2Bdeveloper%2Bm%2Bf%2Bd\"\u003ehttps://skoobe.join.com/jobs/1779982-senior-frontend-developer-m-f-d?pid=71fbd6149a82b0b128ee\u0026amp;utm_source=stackoverflow\u0026amp;utm_medium=paid\u0026amp;utm_campaign=stackoverflow\u0026amp;utm_content=senior%2Bfrontend%2Bdeveloper%2Bm%2Bf%2Bd\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcENWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--50055fdc658e2d47bd024d48ab6da3eda7a1bbed/skoobe.png"
  },
  {
    "id": "3d4fbfba-4f19-4ee7-8855-d81b352166a3",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/3d4fbfba-4f19-4ee7-8855-d81b352166a3",
    "created_at": "Fri Jan 15 11:45:32 UTC 2021",
    "company": "Positive Minds GmbH",
    "company_url": "https://www.positiveminds.io/en/",
    "location": "Dresden",
    "title": "Developer / Solution Engineer (f/m/d)",
    "description": "\u003cp\u003eFor our young start-up company, dedicated to building first-class customer experiences, we are seeking a Developer / Solution Engineer (f/m/d) in Dresden, Leipzig or Jena for a permanent full-time position.\u003c/p\u003e\n\u003cp\u003eYou will be part of our solution engineering team with excellent career opportunities that offer leadership in technology combined with strong understanding of our customer needs. We have always differentiated from other teams with our unique hands-on approach that limits team size to people who stay close to our customers and translate their business needs into best in market technical solutions.\u003c/p\u003e\n\u003cp\u003eContinuous learning and delivery of results are the core features we are looking for. A passion for software craftsmanship and a commitment to open and honest feedback complement these characteristics.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will participate in and finally lead architecture discussions with our clients as well as our architects and platform team to help define best approaches. You will also participate in design reviews and recommend improvements. You will be part of a team that is committed to writing test-backed, clean and reusable code.\u003c/p\u003e\n\u003cp\u003eYou ...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003etake an active role in the development process of customized omnichannel solutions.\u003c/li\u003e\n\u003cli\u003eparticipate in all phases of software development: from architecture and design to development and testing in an agile team using the Scrum model.\u003c/li\u003e\n\u003cli\u003econtrol the complete stack from backend to web applications, develop new features in close cooperation with all involved teams.\u003c/li\u003e\n\u003cli\u003eassist in risk assessment and mitigation activities.\u003c/li\u003e\n\u003cli\u003eapplication development and implementation, as well as technical reviews in the postlaunch-phase.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs an experienced Developer / Solution Engineer you are able to identify problems through critical thinking, you have analytical skills and in addition to your technical strengths you distinguish yourself through self-confidence, independent working methods, teamwork and clear communication?\u003c/p\u003e\n\u003cp\u003eYou ...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehold an University degree or successfully completed an IT related education program.\u003c/li\u003e\n\u003cli\u003e5+ years of professional development experience ideally using ReactJS, JavaScript/TypeScript, Python, Golang, NodeJS or similar languages.\u003c/li\u003e\n\u003cli\u003econfident with AWS Cloud components and relevant services, e.g. Serverless, Lambda, DynamoDE, Mocking, SQS Scalbility, API Gateway, CloudWatch, EMR, S3, EC2\u003c/li\u003e\n\u003cli\u003ehave experience with business critical SaaS applications based on MicroServices Architecture.\u003c/li\u003e\n\u003cli\u003ehave the general understanding of Service-Oriented approach, Domain-Driven Design, S.O.L.I.D. principles.\u003c/li\u003e\n\u003cli\u003ehave experience collaborating with other Engineers in planning, prioritizing and executing assigned tasks within deadlines.\u003c/li\u003e\n\u003cli\u003edevelop CI/CD-conform and test compatible code.\u003c/li\u003e\n\u003cli\u003edeveloper experience in Salesforce with Service Cloud or Sales Cloud is also advantageous\u003c/li\u003e\n\u003cli\u003ehave good written and spoken English language skills.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent personal and professional opportunities\u003c/li\u003e\n\u003cli\u003eFast and short decision paths\u003c/li\u003e\n\u003cli\u003eFlexible work organization with home office possibilities\u003c/li\u003e\n\u003cli\u003eFree choice of your work tools: Work with a Macbook Pro or use open systems such as Linux or Windows.\u003c/li\u003e\n\u003cli\u003eTeam meetings and events - professional and fun\u003c/li\u003e\n\u003cli\u003eAnd of course a great atmosphere in the team\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://positiveminds.join.com/jobs/1737952-developer-solution-engineer-f-m-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=developer%2Bsolution%2Bengineer%2Bf%2Bm%2Bd\"\u003ehttps://positiveminds.join.com/jobs/1737952-developer-solution-engineer-f-m-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=developer%2Bsolution%2Bengineer%2Bf%2Bm%2Bd\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1NWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--35b2bd07e6dcc292c36523b525bc769289f11f20/positive%20minds.png"
  },
  {
    "id": "0d290ab5-e308-48ff-a66a-ae0f768f0cab",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0d290ab5-e308-48ff-a66a-ae0f768f0cab",
    "created_at": "Thu Jan 14 16:09:30 UTC 2021",
    "company": "Pensa Systems",
    "company_url": "http://www.pensasystems.com",
    "location": "Remote",
    "title": "Python Backend Developer (Cloud)",
    "description": "\u003cp\u003eAbout Pensa Systems\u003c/p\u003e\n\u003cp\u003ePensa is an Austin-headquartered tech company and a leading innovator in autonomous perception systems for retail inventory visibility. Our system uses breakthrough technology including artificial intelligence, autonomous drones and computer vision to understand what is on store shelves. We are building really cool things that are disrupting the multi-trillion-dollar global retail industry. Our in-store inventory data-as-a-service is used by both very large consumer-packaged goods manufacturers and their retailer partners.\u003c/p\u003e\n\u003cp\u003eToday we practice social distancing and mostly work remotely, but when we are in the office we have snacks in the kitchen, beer in the fridge and flexible work hours.  We appreciate diversity of all stripes and are an equal opportunity employer. If you would like to know more about us, please visit \u003ca href=\"http://www.pensasystems.com\"\u003ewww.pensasystems.com\u003c/a\u003e and stay connected via Twitter and LinkedIn.\u003c/p\u003e\n\u003cp\u003eJob Description\u003c/p\u003e\n\u003cp\u003ePensa builds highly scalable cloud-based services in support of our machine learning and data subscription business.  We value collaboration, continuous testing, and iterative development models.  Our software runs is runs in several IaaS cloud services for production scalability.  We use Python as our primary development language, and appreciate a good microservice-based REST architecture.\u003c/p\u003e\n\u003cp\u003eOur Cloud Application Developers are responsible for:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eDesigning and building efficient, scalable, and resilient RESTFul and batch based services that run in an IaaS provider such as AWS or Azure.  Our developers are responsible for understanding the full scope of a feature, how it will be realized in our UI, used by our customers, and how our system will perform and scale.\u003c/li\u003e\n\u003cli\u003eCommitting tested, documented, and reviewed code on a frequent basis, ideally daily.  Code reviews and automated testing are core to our quality approach.  Task decomposition and continuous iterative delivery are a way of life at Pensa.\u003c/li\u003e\n\u003cli\u003eCollaborating with Product Management, UX, and other engineers to clarify requirements and design, and accurately estimating scope.  A clear understanding of our customers needs, and how to make large amounts of data easy to consume is instrumental in this process.\u003c/li\u003e\n\u003cli\u003eDeep architectural understanding of good SaaS deployment patterns, and the technical options available from the various IaaS providers such as AWS or Azure.\n5)Actively supporting our continuous journey of applying good architecture and design patterns so that we can do our best work every day.  Strong opinions are encouraged.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e5 or more years building production software, ideally in a commercial environment with experience supporting a shipping product\u003c/li\u003e\n\u003cli\u003e3 or more years of experience building and delivering SaaS based products, ideally in AWS or Azure\u003c/li\u003e\n\u003cli\u003e2 or more years of recent experience with Python\u003c/li\u003e\n\u003cli\u003eBachelor's degree in a technical field\u003c/li\u003e\n\u003cli\u003eDirect experience building RESTful services\u003c/li\u003e\n\u003cli\u003eDirect experience writing efficient SQL and familiarity with ORM packages\u003c/li\u003e\n\u003cli\u003eExperience with Python unit and integration test frameworks\u003c/li\u003e\n\u003cli\u003eExperience with Python web frameworks, ideally Flask\u003c/li\u003e\n\u003cli\u003eUnderstanding of client side coding in Javascript, ideally with the Vue framework is a plus\u003c/li\u003e\n\u003cli\u003eExperience with a current ML framework such as Tensorflow or PyTorch is a strong positive\u003c/li\u003e\n\u003cli\u003eExperience with current CV and/or Data Science libraries such as OpenCV, PIL, Numpy, SciPy is a strong positive\u003c/li\u003e\n\u003cli\u003ePosition is ideally based in Austin, Texas but not required\u003c/li\u003e\n\u003c/ol\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail CV to \u003ca href=\"mailto:hr@pensasystems.com\"\u003ehr@pensasystems.com\u003c/a\u003e with subject \"Github - Python Backend Developer\"\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbkNWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b3ab086151f1ec4f116e29055e1befcc189d9fc6/Copy%20of%20Pensa_logo_boxed.jpg"
  },
  {
    "id": "0443c998-b07a-43f7-8b4d-2679116ab3c0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0443c998-b07a-43f7-8b4d-2679116ab3c0",
    "created_at": "Thu Jan 14 16:03:43 UTC 2021",
    "company": "AVA \u0026 MAY",
    "company_url": "https://www.ava-may.de/",
    "location": "Berlin",
    "title": "Shopify Senior Frontend Developer (m/f/x) - Berlin",
    "description": "\u003cp\u003e\u003cstrong\u003eDescription\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHashtag You\u003c/strong\u003e is a young, ambitious and fast growing technology-enabled brand builder in the field of direct-to-consumer e-commerce. Founded by an experienced team with a track record of launching and scaling DTC brands, we set ourselves apart with state of the art technology \u0026amp; operations, best in class marketing, creative content and a strong community of loving customers. All these provide the backbone to the fast growth of our brand portfolio.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAVA \u0026amp; MAY\u003c/strong\u003e is the first brand incubated in the vertical of home \u0026amp; wellness and is one of the fastest growing DTC brands in Europe. We are just about to launch the next chapter of our journey - with new categories, products, collaborations and manifold growth opportunities!\u003c/p\u003e\n\u003cp\u003eWe are searching for a \u003cstrong\u003eSenior Frontend Developer\u003c/strong\u003e (m/f/x) who gets excited about building products and designing features for social media driven consumer brands.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour tasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeliver a high quality application from designing and iterating new features into production\u003c/li\u003e\n\u003cli\u003eEnsure technical feasibility of UI/UX designs and their translation into user-friendly features\u003c/li\u003e\n\u003cli\u003eWork closely with all engineering teams to ensure seamless UX and scalable architecture\u003c/li\u003e\n\u003cli\u003eConduct A/B test and web optimization to drive sales\u003c/li\u003e\n\u003cli\u003eOwnership of the website front-end in a multisite environment\u003c/li\u003e\n\u003cli\u003eTest, optimize and troubleshoot features before and after deployment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years experience building modern front end applications (with minimum 2 years on Shopify)\u003c/li\u003e\n\u003cli\u003eExperience of building custom themes / and or plugins for ShopifyPlus, WordPress or any other popular CMS\u003c/li\u003e\n\u003cli\u003eExperience creating responsive, modern user interfaces with JavaScript ES6, HTML5, Liquid and CSS3\u003c/li\u003e\n\u003cli\u003eProficient with the React / Redux stack\u003c/li\u003e\n\u003cli\u003eExperience working with GraphQL, Shopify APIs or willingness to learn\u003c/li\u003e\n\u003cli\u003eExperience working Git, CI/CD\u003c/li\u003e\n\u003cli\u003ePassionate about quality, testing and code reviews\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSolve technical problems unique to social media driven e-commerce\u003c/li\u003e\n\u003cli\u003eSee the real time impact of your work in a business critical, high traffic environment\u003c/li\u003e\n\u003cli\u003eBecome part of an ambitious, international team in the heart of Berlin\u003c/li\u003e\n\u003cli\u003eObtain high degree of responsibility and freedom from day one\u003c/li\u003e\n\u003cli\u003eProfit from clear development paths, trainings and salary possibilities\u003c/li\u003e\n\u003cli\u003eYour own Macbook, public transport ticket, office drinks \u0026amp; snacks\u003c/li\u003e\n\u003cli\u003eSounds like a fit? We can’t wait to meet you!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/95b096102ab7ca680d8f3f8d5ff942cc9b73a4c2/68747470733a2f2f742e676f686972696e672e636f6d2f682f32653535366334333830373838336361626665663238356663333038373964366530353565316631303531353339313937383932643664303231373037303335\"\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/0a88e4f5889cebc79560e9aa8425c63f221d6c9dfc5f28804dc48cc3e1989955\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTZWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b33cdbeb7cde3022cf88bea57ae91d8d4b933c53/AVA%20\u0026%20MAY.png"
  },
  {
    "id": "199c6911-28ee-491d-be3b-3514da4e63d9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/199c6911-28ee-491d-be3b-3514da4e63d9",
    "created_at": "Thu Jan 14 14:44:50 UTC 2021",
    "company": "COMPASS Pathways",
    "company_url": "https://compasspathways.com/",
    "location": "London, UK or New York",
    "title": "UI/UX Designer",
    "description": "\u003cp\u003e\u003cstrong\u003eJob overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe UI/UX Designer will be responsible for shaping and developing the user experience and interface for an online training platform. for therapists. The platform will be used to provide theoretical and practice-based training to psychological therapists. We want to develop a world class platform that supports and enables therapist to be the best they can be so that we are well placed to transform mental health care.\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is a mental health care company dedicated to accelerating patient access to evidence-based innovation in mental health (\u003ca href=\"https://compasspathways.com\"\u003ehttps://compasspathways.com\u003c/a\u003e). Our focus is on improving the lives of those who are suffering with mental health challenges and who are not helped by current treatments. We are pioneering the development of a new model of psilocybin therapy, in which our proprietary formulation of synthetic psilocybin, COMP360, is administered in conjunction with psychological support.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRoles and responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePartner with the therapy research and training team, eLearning Designer and Developer, engineers and product manager to design an elegant and easy-to-use learning management system\u003c/li\u003e\n\u003cli\u003eTake broad and conceptual ideas and turn them into prototypes and features for our therapists\u003c/li\u003e\n\u003cli\u003eDevelop design flows and experiences that are incredibly simple and elegant for both web and mobile platforms\u003c/li\u003e\n\u003cli\u003eContribute to the overall creative strategy and vision (both “what should we build” and “how it should look”)\u003c/li\u003e\n\u003cli\u003eTake broad and conceptual ideas and turn them into prototypes and features for our therapists\u003c/li\u003e\n\u003cli\u003eConduct user research and interviews, and share insights with various stakeholders and integrate into design decisions through insight decks, user journeys, personas, design principles and strategic roadmaps and product features\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDetailed responsibilities/accountabilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe position reports into the Product Manager\u003c/li\u003e\n\u003cli\u003eKey internal partners include; Therapy Research and Training team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eProfile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in designing, building and shipping quality mobile and web platforms in the online education and/or healthcare space\u003c/li\u003e\n\u003cli\u003eHighly creative, empathetic and detail oriented - please attach an online portfolio to the application\u003c/li\u003e\n\u003cli\u003eExperience in interaction and visual design and prototyping\u003c/li\u003e\n\u003cli\u003eHighly skilled in Adobe XD/Figma/Sketch, Photoshop, Illustrator, and other design tools\u003c/li\u003e\n\u003cli\u003eDemonstrate ability to prototype in HTML/CSS/JavaScript, AfterEffects, or other tools\u003c/li\u003e\n\u003cli\u003eDemonstrate communications skills while articulating design decisions\u003c/li\u003e\n\u003cli\u003eExperience running user interviews and testing various prototypes with users\u003c/li\u003e\n\u003cli\u003eStrong analytical, project management, written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eAbility to operate independently and in cross-functional teams under uncertainty in an entrepreneurial and rapid growth-oriented environment\u003c/li\u003e\n\u003cli\u003eStrong alignment with core company mission and values\u003c/li\u003e\n\u003cli\u003eAbility to work in the UK or US (London or New York offices)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUS applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is proud to be an equal opportunity employer. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, and related medical conditions), ethnicity, age, disability, sexual orientation, gender identity, gender expression, military service, genetic information, familial or marital status, or any other status, category, or characteristic protected by applicable law.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUK applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are proud of our commitment to diversity and equality (pursuant to the Equality Act 2010). We do not discriminate based upon race, religion or belief, colour, nationality, ethnic or national origin, gender, pregnancy or maternity, marital or civil partner status, sexual orientation, gender reassignment, age or disability.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHlWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6a5a3b57793a7b746b366eaf2f19a75609ba774b/5e7a01fc6ed7b90015809a872f3de85ebd.jpeg"
  },
  {
    "id": "2bab688a-f8cf-4588-aa44-defbd86a4493",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2bab688a-f8cf-4588-aa44-defbd86a4493",
    "created_at": "Thu Jan 14 10:04:45 UTC 2021",
    "company": "fotograf.de / GotPhoto",
    "company_url": "https://www.fotograf.de/",
    "location": "Berlin",
    "title": "Senior BackEnd Engineer - Finance (f/m/d)",
    "description": "\u003cp\u003e\u003cstrong\u003e\u003ca href=\"http://fotograf.de/GotPhoto\"\u003efotograf.de/GotPhoto\u003c/a\u003e is the market leading workflow and sales solution for professional photographers in Europe and has a strong footprint in the US market.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe move the world of kindergarten and school - and nursery photography from analog to digital, making the life of our photographer clients easier and their business more successful. We are reviving an industry in which changes are long overdue.\u003c/p\u003e\n\u003cp\u003eToday we have built a profitable business and, together with our international brand GotPhoto, we are one of the world's most important players in school and kindergarten photography.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy work with us? \u003ca href=\"http://t3u1.mjt.lu/lnk/AMAAAI-AyqkAAAAAAAAAAAM-ElIAAAAA-nQAAAAAAAZPNgBf-HWEfor3NK_qS7OLfks0IXlm_gAGCXo/2/Nhyug0Xd1pd-_bHUWTecqg/aHR0cHM6Ly93d3cuZm90b2dyYWYuZGUvam9icw\"\u003eLearn more\u003c/a\u003e\nConnect with us on \u003ca href=\"http://t3u1.mjt.lu/lnk/AMAAAI-AyqkAAAAAAAAAAAM-ElIAAAAA-nQAAAAAAAZPNgBf-HWEfor3NK_qS7OLfks0IXlm_gAGCXo/3/VpfY_HT66YD1Cdw-4SuQSQ/aHR0cHM6Ly93d3cuZmFjZWJvb2suY29tL2dvdHBob3RvLnVrLw\"\u003eFacebook\u003c/a\u003e\nConnect with us on \u003ca href=\"http://t3u1.mjt.lu/lnk/AMAAAI-AyqkAAAAAAAAAAAM-ElIAAAAA-nQAAAAAAAZPNgBf-HWEfor3NK_qS7OLfks0IXlm_gAGCXo/4/MS-ca6R1DFt-ErcySLFxvA/aHR0cHM6Ly9iaXQubHkvMkx5dlhSZA\"\u003eLinkedIn\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are an equal opportunity employer\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a Senior Backend Engineer, you will work in our HQ in the heart of Berlin in one of our autonomous teams. We \u003cstrong\u003evalue strong engineering skills, a deep understanding of business, full ownership, high velocity, collaboration, and initiative.\u003c/strong\u003e\nWe're looking for a strong BackEnd Engineer to offer the best experience to all of our users at all points of their journey.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork in small collaborative \u003cstrong\u003eagile teams\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eYou and your team will have a clear mission and ownership of an important outcome that \u003cstrong\u003esupports GotPhoto and our customers\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eTo do this we focus on \u003cstrong\u003eend-to-end ownership, continuous improvement, testing, monitoring and experimentation\u003c/strong\u003e. We aim for teams that are inclusive, helpful, and have a strong sense of ownership for the things they build\u003c/li\u003e\n\u003cli\u003eWe are \u003cstrong\u003escaling up our engineering organization\u003c/strong\u003e and we are looking for people to evolve our backend, and engineering practices to support the growth and work in many autonomous teams. We welcome new ideas!\u003c/li\u003e\n\u003cli\u003eYou will \u003cstrong\u003eprototype and build new features\u003c/strong\u003e, update existing ones, and fix bugs\u003c/li\u003e\n\u003cli\u003eWe need your participation in \u003cstrong\u003egrowing a solid microservice architecture, stable interfaces\u003c/strong\u003e, and contracts for API, metrics, etc\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSkills we are looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou write \u003cstrong\u003esolid, maintainable documented clean code\u003c/strong\u003e and have a pragmatic engineering approach \"shortcuts\" easy to delete in a crunch\u003c/li\u003e\n\u003cli\u003eYou are able to \u003cstrong\u003eapply software design principles\u003c/strong\u003e, know a few software design patterns and you are able to explain the trade-offs of your engineering decisions\u003c/li\u003e\n\u003cli\u003eYou \u003cstrong\u003edocument your code\u003c/strong\u003e and your product so that your co-workers can continue your task if needed\u003c/li\u003e\n\u003cli\u003eYou know \u003cstrong\u003ewhat to test, why to test it, and how\u003c/strong\u003e to write meaningful tests\u003c/li\u003e\n\u003cli\u003eYou have a proactive attitude and a \u003cstrong\u003eproduct mindset\u003c/strong\u003e − you own what you build\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eKnowledge of API-Structures\u003c/strong\u003e, like REST or GraphQL and their respective tradeoffs\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eStrong knowledge of PHP7\u003c/strong\u003e as you will be working with that primarily\u003c/li\u003e\n\u003cli\u003ePrior experience with \u003cstrong\u003eDocker\u003c/strong\u003e is a plus\u003c/li\u003e\n\u003cli\u003eWorking knowledge in \u003cstrong\u003eJavascript and HTML\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eGood knowledge in \u003cstrong\u003erelational database systems\u003c/strong\u003e (preferably MySql)\u003c/li\u003e\n\u003cli\u003eExperience with \u003cstrong\u003eagile engineering practices\u003c/strong\u003e such as TDD or BDD\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTeam player\u003c/strong\u003e, proactive and result-driven\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eAWS services knowledge\u003c/strong\u003e would be a strong plus\n-Experience working with \u003cstrong\u003edistributed back-end systems\u003c/strong\u003e, especially in the financial industry, will enable you to dive deep into the product very quickly, but not required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWith us, you can look forward to this\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe a part of an \u003cstrong\u003einternational team with an established brand in Germany and strong growth in the US\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eStructured promotion process\u003c/strong\u003e in order to give everyone the same chance to grow\u003c/li\u003e\n\u003cli\u003eStructured \u003cstrong\u003eregular feedback process\u003c/strong\u003e - enabling personal development\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eFlexible working hours\u003c/strong\u003e - we trust you to deliver\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCountless opportunities to connect within and outside of work\u003c/strong\u003e with regular team events and trips, partnership events with other companies and local organizers\u003c/li\u003e\n\u003cli\u003eRegular get-togethers, such as monthly team brunches, team events, Brownbag Sessions\u003c/li\u003e\n\u003cli\u003eSpendit-card with \u003cstrong\u003emonthly lunch money\u003c/strong\u003e (after successfully passing the trial period)\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eRegular training and coaching\u003c/strong\u003e, external/internal training and a budget for books and courses\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/4f7f46759a7194ae075acf148a8ceae8d06efb61/68747470733a2f2f742e676f686972696e672e636f6d2f682f30336436363562646466356338376439373863323039616165393633623232343934623064663462393433663537316139326131316563373166646237356631\"\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/0918d923e7132344c5d0bdce8d89714ba5b2dd985abb8ec9e346a63553798713\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFNWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--60d7d859bb67619f9cc4c103c183211722a58481/fotograf.de%20-%20GotPhoto.png"
  },
  {
    "id": "6f7ca396-7c8f-4cac-9e3d-40a95ef4e333",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6f7ca396-7c8f-4cac-9e3d-40a95ef4e333",
    "created_at": "Wed Jan 13 17:17:15 UTC 2021",
    "company": "Vaultoro",
    "company_url": "http://www.vaultoro.com",
    "location": "Berlin",
    "title": "Back End Developer",
    "description": "\u003cp\u003eVaultoro Limited is an international Fintech company operating since 2015, the world's first exchange platform where users from +94 countries trade precious metals and cryptocurrencies. Our business is rapidly expanding and we offer challenging tasks in a dynamic and multicultural environment. Our -corporate values include creative freedom, ownership of responsibilities, a flat hierarchy, high performance and professional guidance in the expanding Fintech industry. Join our Berlin office and become part of our core team, creating the future of the crypto economy.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we are looking for\u003c/strong\u003e\nWe are searching for a knowledgeable developer, fluent in all things Javascript who wants to be part of a friendly growing team. We’re based in Berlin but we’re happy if you’re remote.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking with our founders to build and scale our trading platform\u003c/li\u003e\n\u003cli\u003eUnderstanding the DevOps process from start to finish\u003c/li\u003e\n\u003cli\u003eBuilding backend services\u003c/li\u003e\n\u003cli\u003eDelivering high-quality and well-structured code in a timely manner\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA minimum of 3 years of professional web application development\u003c/li\u003e\n\u003cli\u003eExperience working with Javascript, Mongodb, Redis, Docker, NodeJS,\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNICE TO HAVE\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAn interest in cryptocurrencies\u003c/li\u003e\n\u003cli\u003eKnowledge of Kubernetes, Go and Cloud service providers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive remuneration\u003c/li\u003e\n\u003cli\u003eFlat hierarchy\u003c/li\u003e\n\u003cli\u003eUnique opportunity to make an impact on a growing start-up\u003c/li\u003e\n\u003cli\u003eAbsolute and encouraged creative freedom\u003c/li\u003e\n\u003cli\u003eAn amazing office space in Berlin (with garden)\u003c/li\u003e\n\u003cli\u003eBeing part of an expanding team and department\u003c/li\u003e\n\u003cli\u003eUnlimited coffee and tea\u003c/li\u003e\n\u003cli\u003eRegular team events\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf building an alternative financial system sounds interesting to you, apply to work at Vaultoro! Send your CV, Cover letter, first available entry date and desired salary to \u003ca href=\"mailto:jobs@vaultoro.com\"\u003ejobs@vaultoro.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe strive to to provide equal employment opportunity to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status etc.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your CV to \u003ca href=\"mailto:jobs@vaultoro.com\"\u003ejobs@vaultoro.com\u003c/a\u003e\nSubject: Github Back End\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEtWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--439c426a666188b0a1b239aceb72fa16d1a5417c/logo-transparent.png"
  },
  {
    "id": "e55930c6-0db3-4fad-ab97-094b074a3648",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e55930c6-0db3-4fad-ab97-094b074a3648",
    "created_at": "Wed Jan 13 15:59:23 UTC 2021",
    "company": "Excelerate America",
    "company_url": "https://www.excelerateamerica.com/",
    "location": "Detroit, MI",
    "title": "Back End Developer",
    "description": "\u003ch2\u003eCompany Overview:\u003c/h2\u003e\n\u003cp\u003eExcelerate America (EA) is a network for small business entrepreneurs to transform their businesses from small to mighty. Collaborating with a diverse set of partners and communities, EA brings together a community wanting to help each other thrive; through inspiration, problem-solving, and access to curated products and services. The next phase of EA’s growth is to develop a dynamic and engaging mobile community platform driven by peer-to-peer problem-solving. This platform will help EA scale and connect its existing communities to power-up entrepreneurs' abilities to work together, get guidance from peers, and have a greater impact in their local communities.\u003c/p\u003e\n\u003ch2\u003eJob Overview:\u003c/h2\u003e\n\u003cp\u003eThe Backend engineer works as a leading member of EA’s growing software and product technology team to help architect, develop, and launch EA’s platform.\u003c/p\u003e\n\u003cp\u003eAs a critical member of the product team, the Backend Engineer will work closely with the founding leadership and product development team to architect EA’s data structure, learning algorithms, and front-end integrations to build a platform that delivers a personalized and cutting edge experience to our users and partners. You will be one of the founding software engineers working closely with our Engineering Lead to design our new platform, help to scale it, and establish the way we work as a software-oriented organization. We are a company focused on our users and instill a human-centered approach, thus giving you the opportunity to go beyond development and participate in the design and creative thinking needed to build an exceptional end to end platform for our members.\u003c/p\u003e\n\u003cp\u003eExcelerate America is a Detroit-based organization. We believe in a flexible work environment with 3 days in-office, 2 days remote approach to allow for cross-disciplinary collaboration. The Back End Engineer role is preferred to be co-located in Detroit with the product team. Remote will be considered.\u003c/p\u003e\n\u003ch2\u003eResponsibilities and Duties:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWork with EA Dev team to develop EA APIs and EA Server-side Apps and documentation\u003c/li\u003e\n\u003cli\u003eDocument and test all EA APIs and EA Server-Side Apps and help build a culture of testing throughout our build process\u003c/li\u003e\n\u003cli\u003eSetup, configure and monitor the various EA servers, hosting, and databases including dev, staging, production for both EA marketing sites and EA platform\u003c/li\u003e\n\u003cli\u003eSetup, maintain, test, and create authentication, payment, and other gateways\u003c/li\u003e\n\u003cli\u003eSetup repos in Git and workflows for continuous integration\u003c/li\u003e\n\u003cli\u003eTroubleshoot server issues and performance bottlenecks\u003c/li\u003e\n\u003cli\u003eCapable of scaling applications to handle the load changes.\u003c/li\u003e\n\u003cli\u003eDesign, implement, maintain and automate the appropriate backup and recovery architecture as required\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifications:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eBachelors of Computer Science or equivalent learning/experience\u003c/li\u003e\n\u003cli\u003e5+ years of experience in engineering including experience building, launching and scaling a consumer or enterprise product or platform\u003c/li\u003e\n\u003cli\u003eDeep understanding of NodeJs programming language and framework, including the development and optimization of server-less functions\u003c/li\u003e\n\u003cli\u003eDeep understanding of databases NoSQL, MySQL as well as experience with and/or familiarity with GraphQL\u003c/li\u003e\n\u003cli\u003eProven experience working with multiple disciplines including business, front-end, and design and enjoy a highly collaborative environment\u003c/li\u003e\n\u003cli\u003eExperience with agile development and/or sprint-based development\u003c/li\u003e\n\u003cli\u003eAbility to set up development and production environments or the engineering teams including virtualization and container technology, GIT, and continuous integration workflows..\u003c/li\u003e\n\u003cli\u003eKnowledge of security, privacy, and compliance as it applies to online users and payment gateways\u003c/li\u003e\n\u003cli\u003eBasic knowledge of front-end technologies, such as HTML, CSS, and JavaScript, so that you can work closely with EA’s front-end development and design team\u003c/li\u003e\n\u003cli\u003eBasic Knowledge of Machine Learning\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://www.linkedin.com/jobs/view/2334165591\"\u003ehttps://www.linkedin.com/jobs/view/2334165591\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazJWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e26dcd3bdc87a8d444428f600e5e4722b40e9cef/LogoEaStacked-20.jpg"
  },
  {
    "id": "5d895623-9318-4477-842c-2bdc59ee7bf0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/5d895623-9318-4477-842c-2bdc59ee7bf0",
    "created_at": "Wed Jan 13 15:59:02 UTC 2021",
    "company": "cusati media GmbH",
    "company_url": null,
    "location": "Remote",
    "title": "Senior UX Designer/Web-Developer/Senior Web-Designer Frontend (m/w/d)",
    "description": "\u003cp\u003eWir bauen unser Entwicklungs-Kernteam für unsere Eigenentwicklungen aus und suchen motivierte Entwickler, welche den Wert einer Gewinnbeteiligung schätzen.\u003c/p\u003e\n\u003cp\u003eZu uns: Die cusati media GmbH aus Dresden realisiert seit 2011 mit einem kleinen, professionellen Team performante Web-Lösungen für den E-Commerce und Corporate Websites und entwickelt modernste eigene E-Commerce Lösungen der Zukunft.\u003c/p\u003e\n\u003cp\u003eDabei fließen sehr konkret E-Commerce und kaufmännische Erfahrungen und Anforderungen aus eigenen Webprojekten ein.\u003c/p\u003e\n\u003cp\u003eWir setzen auf Technologie, Performance, Struktur, Analyse und funktionales Design als Kernelemente performanter E-Commerce-Lösungen. Den Umsatz des Kunden stets im Blick konzentrieren wir uns auf das Wesentliche. Weniger ist mehr.\u003c/p\u003e\n\u003cp\u003eWir suchen einen Profi, der uns auf dieser “Reise” begleiten möchte und unsere obsessive Faszination an E-Commerce-Lösungen und Cloud-Themen teilt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDu bist sowohl für die technische Umsetzung des Web-Developer-Tagesgeschäfts als auch für langfristige Web-Projekte und primär für unsere Eigenentwicklungen verantwortlich.\u003c/p\u003e\n\u003cp\u003eDie Schwerpunkte deiner Arbeit liegen in der Entwicklung und Umsetzung des dynamischen Layouts von Frontends und Backends für unsere Eigenentwicklungen und derzeit noch für Shopware sowie WordPress. Dazu gehört auch die kreative Weiterentwicklung bestehender Internetpräsenzen.\u003c/p\u003e\n\u003cp\u003eDu bist primärer Ansprechpartner und Schnittstelle für unsere Core-Entwickler und steuerst ausgelagerte Kapazitäten mit zuverlässigen Freelancern.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKonzeption und Umsetzung sehr anspruchsvoller, moderner Weblösungen in unserem kleinen Team, derzeit noch mit Shopware und Wordpress, primärer Fokus werden jedoch die eigenen Lösungen\u003c/li\u003e\n\u003cli\u003eMitwirkung bei der Entwicklung eigener headless E-Commerce-Lösungen\u003c/li\u003e\n\u003cli\u003eAuswahl und Steuerung von Freelancern zur Erweiterung deiner Kapazitäten\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifikation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eErfahrung zählt. Du löst deine Aufgaben kreativ, aber strukturiert und dein eigener Qualitätsanspruch ist erst dann erfüllt, wenn die von dir erstellten Systeme performant, barrierefrei und w3c-konform sind sowie höchstes Niveau erreichen.\u003c/p\u003e\n\u003cp\u003eDu bist stark an den Themen E-Commerce und Cloud-Lösungen interessiert und empfindest körperlichen und seelischen Schmerz, wenn etwas nicht wie gewünscht läuft.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEigenverantwortliche, sorgfältige und absolut zuverlässige Arbeitsweise\u003c/li\u003e\n\u003cli\u003eSehr gute UI Design Skills. Tendenz Material Design\u003c/li\u003e\n\u003cli\u003eProfessionelle VueJS Erfahrung, Referenzen gewünscht\u003c/li\u003e\n\u003cli\u003eProfessionelle Erfahrungen mit VueJS, ES6, Referenzen gewünscht\u003c/li\u003e\n\u003cli\u003eProfessionelle Erfahrungen mit vuex, vuelidate, vuetify, vuei18n\u003c/li\u003e\n\u003cli\u003eSehr guter Umgang mit JavaScript, JQuery, AJAX, Smarty ode Twig und PHP5+ sowie gute Fähigkeit, sich in gängige CMS-Systeme einzuarbeiten\u003c/li\u003e\n\u003cli\u003eSehr gutes Händchen für zeitgemäßes Layout und stets am Puls der aktuellen Trends\u003c/li\u003e\n\u003cli\u003eBesonderes Gespür für Usability und Entwicklung von einfach zu bedienenden Web-Oberflächen\u003c/li\u003e\n\u003cli\u003eDu hast die Website-Performance stets im Blick und achtest auf perfekte Ladezeiten der von Dir entwickelten Systeme\u003c/li\u003e\n\u003cli\u003eMind. 2 bis 3 Jahre Berufserfahrung im Web Development/Webdesign Abgeschlossenes Studium der Informatik, Medieninformatik/Mediengestaltung oder vergleichbare Ausbildung\u003c/li\u003e\n\u003cli\u003eSicherer Umgang mit Versionskontrollsystem Git\u003c/li\u003e\n\u003cli\u003eVorhandene Grundlagen in der allgemeinen Funktionsweise des Internets und Suchmaschinen inkl. SEO\u003c/li\u003e\n\u003cli\u003eErfahrung in der Aufbereitung von Grafiken für das Internet (Photoshop o. ä.)\u003c/li\u003e\n\u003cli\u003eHohe Flexibilität und Qualitätsbewusstsein\u003c/li\u003e\n\u003cli\u003eProblemlösungsorientierter, schneller, sauberer und teamorientierter Arbeitsstil\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAusgezeichnete Entwicklungsmöglichkeiten in einem gezielt gesteuerten Wachstums-Umfeld\u003c/li\u003e\n\u003cli\u003eRegelmäßiger Austausch und Feedbacks, flache Hierarchien, Respekt, Lob, Anerkennung, Wertschätzung und verbale Streicheleinheiten, wenn Du das benötigst\u003c/li\u003e\n\u003cli\u003eLangfristige Zusammenarbeit\u003c/li\u003e\n\u003cli\u003eSehr attraktive Vergütung, Geld ist jedoch nicht alles.\u003c/li\u003e\n\u003cli\u003eGewinnbeteiligungsoption nach Ablauf der Probezeit\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge mit AG-Anteil\u003c/li\u003e\n\u003cli\u003eWenige, aber sehr spannende Web-Projekte mit guten Kunden\u003c/li\u003e\n\u003cli\u003eKleines Team, schnelle Entscheidungen\u003c/li\u003e\n\u003cli\u003eSCRUMBAN\u003c/li\u003e\n\u003cli\u003eEigenverantwortung: zielorientierte und konsequente Umsetzung\u003c/li\u003e\n\u003cli\u003eIndividuelle Weiterbildung nach eigenen Interessen\u003c/li\u003e\n\u003cli\u003ePerformante Arbeitsmaterialien\u003c/li\u003e\n\u003cli\u003ekostenfreie Getränke (Mate, Kaffee, Tee) \u0026amp; Obst\u003c/li\u003e\n\u003cli\u003eHome-Office bei privatem Bedarf möglich\u003c/li\u003e\n\u003cli\u003eGleitzeit 9 bis 15 Uhr\u003c/li\u003e\n\u003cli\u003egemütliche Räumlichkeiten mit viel Platz\u003c/li\u003e\n\u003cli\u003eRuhm und Ehre, Bier und ausgezeichneter Wein nach getaner Arbeit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWir kennen die Herausforderungen deines Arbeitsbereiches, daher ist uns gleich, woher deine Kenntnisse stammen. Ob Studium, Berufsausbildung oder “learning by doing”, wir freuen uns über deine Bewerbung. \u003cstrong\u003eWir sind seit 2011 am Markt und solide finanziert.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBitte sende deine Bewerbung mit Referenzen und Einkommensvorstellungen an René Harnisch.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://cusatimedia.join.com/jobs/1750624-senior-ux-designer-web-developer-senior-web-designer-frontend-m-w-d-fuer-gruendungs-kernteam?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bux%2Bdesigner%2Bweb-developer%2Bsenior%2Bweb-designer%2Bfrontend%2Bm%2Bw%2Bd%2Bfuer%2Bgruendungs-kernteam\"\u003ehttps://cusatimedia.join.com/jobs/1750624-senior-ux-designer-web-developer-senior-web-designer-frontend-m-w-d-fuer-gruendungs-kernteam?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bux%2Bdesigner%2Bweb-developer%2Bsenior%2Bweb-designer%2Bfrontend%2Bm%2Bw%2Bd%2Bfuer%2Bgruendungs-kernteam\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3lWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fbf98423841e79f63d0aa8c9345b858a99d0d6ab/cusati-media-squarelogo-1577786242540.png"
  },
  {
    "id": "3cc340d4-6662-4a10-8a53-f7cb571427b3",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/3cc340d4-6662-4a10-8a53-f7cb571427b3",
    "created_at": "Wed Jan 13 11:00:56 UTC 2021",
    "company": "Remote",
    "company_url": "http://www.remote.com",
    "location": "Anywhere",
    "title": "Senior Frontend Engineer",
    "description": "\u003cp\u003eRemote is THE global platform that enables companies to employ people anywhere in the world, taking away all legal and compliance complexities. Remote handles global payroll, benefits, taxes, and compliance for businesses big and small. Read more about \u003ca href=\"https://remote.com/how-it-works\"\u003ehow it works\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eRemote is fully remote (ah!) and you can read more about us in our \u003ca href=\"https://remote.com/handbook\"\u003epublic handbook\u003c/a\u003e. More specifically, the team you'll be joining: 25 engineers, spanning across Frontend, Backend, SRE and QA. We're organised into product teams composed with engineers, designers, product managers, operations and finance, each dedicated to achieving the same goals in a specific domain.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow we work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe love \u003ca href=\"https://www.notion.so/Working-Async-80c01cd443ad4c77a8ceaef7c5fba5d0\"\u003eWorking Async\u003c/a\u003e and this means you get to do your own schedule. The Remote Engineering team uses a simple approach to productivity and task management and you can read more about it in \u003ca href=\"https://www.notion.so/remotecom/The-Remote-Flow-4ccc721f6dde40e4b5c91dd8e47e77c7\"\u003eThe Remote Flow\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWe empower ownership and proactivity and when in doubt default to action instead of waiting.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePrevious experience working as Frontend Engineer/Developer for at least 4 years\u003c/li\u003e\n\u003cli\u003eSolid understanding of Javascript ES6\u003c/li\u003e\n\u003cli\u003eProficient with React\u003c/li\u003e\n\u003cli\u003eExperience in writing meaningful tests to React apps, with Jest and React Testing Library or Enzyme\u003c/li\u003e\n\u003cli\u003eInterest in build pages with performance, accessibility and API design in mind\u003c/li\u003e\n\u003cli\u003eAttention to the details when implementing UI mockups made by our amazing design team.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eExperience Bonus\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNext.js\u003c/li\u003e\n\u003cli\u003eCypress\u003c/li\u003e\n\u003cli\u003eElixir/Phoenix\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eGitLab CI\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnlimited personal time off - Read our \u003ca href=\"https://www.notion.so/Time-off-e2e71e5dcdef43ff82515d7c711ed4af\"\u003eTime off\u003c/a\u003e policy\u003c/li\u003e\n\u003cli\u003eThe equipment/tools you need to do your job well and comfortable\u003c/li\u003e\n\u003cli\u003eTraining budget\u003c/li\u003e\n\u003cli\u003eGood salary and company options\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eApplication process\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(async) Application is reviewed by your future manager (CTO)\u003c/li\u003e\n\u003cli\u003eInterview with the recruiter\u003c/li\u003e\n\u003cli\u003eInterview with the CTO\u003c/li\u003e\n\u003cli\u003e(async) Code exercise (async, no deadline, a very simple exercise)\nInterview with the team (no managers on the call, just for you to get a sense of who you'd be working with)\u003c/li\u003e\n\u003cli\u003e(async) Offer\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply at \u003ca href=\"https://grnh.se/f7ebb2123us\"\u003ehttps://grnh.se/f7ebb2123us\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7cbe5144ce9fdf21e6b57c9b1845fb2a64276fd1/pJ-7_0_R_400x400.png"
  },
  {
    "id": "0081e8ff-a2e4-45a1-a433-c8f74407d488",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0081e8ff-a2e4-45a1-a433-c8f74407d488",
    "created_at": "Tue Jan 12 15:54:14 UTC 2021",
    "company": "Unicon Software Entwicklungs- und Vertriebs GmbH",
    "company_url": "https://www.unicon-software.com",
    "location": "Karlsruhe",
    "title": "Software developer Web Application (m/f/d)",
    "description": "\u003cp\u003eUnicon Software is a pioneer and technology leader in software solutions for thin clients. Since our foundation in 1993, we have been able to continuously expand our technical know-how and product portfolio.\u003c/p\u003e\n\u003cp\u003eWith the Linux-based eLux® operating system and the associated management software Scout Enterprise Management Suite®, we offer the most powerful software solution for a central IT architecture. More than 1.5 million end devices in over 65 countries worldwide are currently operated and managed with our software. Our largest customer alone uses eLux® on more than 220,000 end devices and thus operates the world's largest centrally managed, heterogeneous thin client installation.\u003c/p\u003e\n\u003cp\u003eWe have a wide range of customers from various industries that rely on Unicon's technology, such as DATEV, Deutsche Bahn, Sparkassen Finanz Informatik, AOK or Viessmann - all of them benefit from a highly scalable and hardware-agnostic integrated solution portfolio. In addition, we cooperate with several major distribution partners and are OEM partners of Fujitsu, HP and other well-known manufacturers.\u003c/p\u003e\n\u003cp\u003eCurrently, we are strongly growing and want to expand our team significantly for the optimization of existing as well as the development of new applications. You want to design the web version of our management solution? Then you are exactly right with us.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBeing part of the team building our Scout Enterprise Web Application\nDeveloping the backend with Node.js and MongoDB Working on frontend development with React and Redux\nOptimizing the application for high performance, reliability and clustering\nRealizing sophisticated applications and services in an agile development environment\nWorking on requirements engineering and well as the architecture and design of the corresponding components\nBeing the contact person for technical issues and in charge of the decision-making regarding specific components\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUniversity degree in computer science, electrical engineering, physics, mathematics or completed training as an IT specialist\u003c/li\u003e\n\u003cli\u003eSeveral years of experience as full stack developer with Javascript\u003c/li\u003e\n\u003cli\u003eExperience with MongoDB or MS SQL Server\u003c/li\u003e\n\u003cli\u003eStrong knowledge of Linux and git\u003c/li\u003e\n\u003cli\u003eAnalytical mind and a great understanding of complex algorithms\u003c/li\u003e\n\u003cli\u003eCuriosity about how things work and eagerness to improve them\u003c/li\u003e\n\u003cli\u003eGood English skills (spoken and written) and good German skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy Unicon?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou’ll have the chance to design an innovative application according to your ideas and thus further develop our solutions, which are used on more than 1.5 million devices\u003c/li\u003e\n\u003cli\u003eWe see people as the fundamental pillar of our success. Therefore, we invest into the personal growth and skill development of each individual\u003c/li\u003e\n\u003cli\u003eYou will be part of an agile tech company on the path of growth\u003c/li\u003e\n\u003cli\u003eWe are the technological leader in an innovative IT sector\u003c/li\u003e\n\u003cli\u003eIn the 25+ years of our existence, we have reached an extremely high level of professionalism and technical expertise\u003c/li\u003e\n\u003cli\u003eAt the same time, the atmosphere is still start-up-like and very dynamic, with flat hierarchies and flexible working models\u003c/li\u003e\n\u003cli\u003eWe encourage the contribution and implementation of own ideas in the sense of extensive personal responsibility\u003c/li\u003e\n\u003cli\u003eOur teams are characterized by an open communication culture and a strong motivation to perform\u003c/li\u003e\n\u003cli\u003eWe offer you an attractive and performance-oriented compensation package\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://unicon-software.join.com/jobs/1769815-software-developer-web-application-m-f-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=software%2Bdeveloper%2Bweb%2Bapplication%2Bm%2Bf%2Bd\"\u003ehttps://unicon-software.join.com/jobs/1769815-software-developer-web-application-m-f-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=software%2Bdeveloper%2Bweb%2Bapplication%2Bm%2Bf%2Bd\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamlWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b9bb2d086be3549fc8b23d816d726f53500185ff/unicon.jpg"
  },
  {
    "id": "cb287f27-8e08-4677-88e5-4d025a1fee08",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cb287f27-8e08-4677-88e5-4d025a1fee08",
    "created_at": "Mon Jan 11 21:27:35 UTC 2021",
    "company": "PayPal",
    "company_url": "http:",
    "location": "San Jose, CA",
    "title": "Distinguished Eng.-Platform Unification",
    "description": "\u003cp\u003eFueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 305 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.\u003c/p\u003e\n\u003cp\u003eThe Commerce Solutions and Services Engineering (CSSE) team is responsible for building solutions and platforms used by all PayPal’s merchants, focusing on the largest customers – the Enterprise, Channel Partners and Marketplaces customer segments. We build applications, services and platforms that allow PayPal customers to accept payments globally across all channels, including the Commerce Platform for Enterprises (\u003ca href=\"https://www.paypal.com/us/business/enterprise\"\u003ehttps://www.paypal.com/us/business/enterprise\u003c/a\u003e), Commerce Platform for Platforms and Marketplaces (\u003ca href=\"https://www.paypal.com/us/business/platforms-and-marketplaces\"\u003ehttps://www.paypal.com/us/business/platforms-and-marketplaces\u003c/a\u003e), Braintree platform (\u003ca href=\"https://www.braintreepayments.com\"\u003ehttps://www.braintreepayments.com\u003c/a\u003e), Hyperwallet platform (\u003ca href=\"https://www.hyperwallet.com\"\u003ehttps://www.hyperwallet.com\u003c/a\u003e), among many other responsibilities\u003c/p\u003e\n\u003cp\u003eAs a Distinguished Engineer in our team, you will be leading development to define how large-scale merchants worldwide integrate with the current and next-gen PayPal Commerce Platforms. You will play a critical role integrating complex systems and multiple properties into one seamless, unified platform that leverages multiple engines to provide a powerful payments and payouts experience, including API strategy (GraphQL and REST, webhooks, streaming, SDKs), sandbox and playground environments, simulators, and all other aspects of integration and developer experience. These platforms combined are responsible for processing more than half of PayPal’s transactions worldwide, so this is a high-stakes role – there are very few mission critical APIs like this in the world, with this kind of scale and complexity, and that power so much commerce and so many businesses worldwide. You will play a key and critical role defining how the platform developer experience is shown to the world.\u003c/p\u003e\n\u003cp\u003eThe ideal candidate will prefer to have no direct reports, being passionate to focus on very hard and deep technical problems, and collaborating with many teams to move big rocks forward. That said, as one of the senior-most individual contributors in the engineering ladder, the candidate will be expected to lead hundreds of others through influence, providing guidance and mentoring as needed, making the whole team better through experience, knowledge and technical talent, making the entire organization more capable of successfully completing larger projects with higher technical complexity.\u003c/p\u003e\n\u003cp\u003eFinally, the ideal candidate has a proven record of leading efforts to solve large, complex problems. They balance competing technical and product requirements, level up the engineers around them, identify and communicate effectively with all stakeholders, and consider both immediate tactical needs and long-term strategic planning.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cp\u003e· Work with Product, Platform and Engineering leaders across the team to identify the most valuable areas of technical contribution, advancing key valuable initiatives, reducing risk on critical projects and advancing our technology stack.\u003c/p\u003e\n\u003cp\u003e· Drive both technology and product innovation through rapid prototyping and iterative development.\u003c/p\u003e\n\u003cp\u003e· Provide technical guidance and leadership in design, development, scaling and operation of software applications.\u003c/p\u003e\n\u003cp\u003e· Be a technical subject matter expert and represent the full internal and external capabilities of our platforms to enable solutions to complex, large-scale customers.\u003c/p\u003e\n\u003cp\u003e· Mentor, coach, advise and level up engineering talent across the organization.\u003c/p\u003e\n\u003cp\u003eSkillset and requirements:\u003c/p\u003e\n\u003cp\u003e· Bachelors degree in Computer Engineering/Computer Science or related field.\u003c/p\u003e\n\u003cp\u003e· Track record leading, developing, and delivering significant software projects.\u003c/p\u003e\n\u003cp\u003e· Expertise in designing and troubleshooting large scale distributed systems.\u003c/p\u003e\n\u003cp\u003e· Proficiency in managing cloud based large-scale infrastructure. Experience with building solutions on the Cloud (ideally GCP and AWS). Experience designing and building systems with Docker containers and Kubernetes.\u003c/p\u003e\n\u003cp\u003e· Experience in Domain Driven Design and modeling complex business domains.\u003c/p\u003e\n\u003cp\u003e· Demonstrable experience building complex customer facing platforms, inclusive of complex APIs and other aspects of developer experiences (sandbox, playgrounds, simulators, etc.).\u003c/p\u003e\n\u003cp\u003e· Demonstrable and in-depth experience with Java stack. Ruby on Rails very desirable.\u003c/p\u003e\n\u003cp\u003e· Some experience with JavaScript and Node.js is highly desired.\u003c/p\u003e\n\u003cp\u003e· Experience with Unix/Linux operating systems internals and administration.\u003c/p\u003e\n\u003cp\u003e· Established experience with monitoring/logging tools and best practices.\u003c/p\u003e\n\u003cp\u003e· Experience in software release lifecycle with modern distributed version control (e.g. git).\u003c/p\u003e\n\u003cp\u003e· Experience working in an Agile environment, including Extreme Programming practices like Iterative Development, Continuous Integration (and Deployment) and Test-Driven Development.\u003c/p\u003e\n\u003cp\u003e· Great analytical and problem-solving skills.\u003c/p\u003e\n\u003cp\u003e· Strong communicator, both written and spoken.\u003c/p\u003e\n\u003cp\u003eBehaviors:\u003c/p\u003e\n\u003cp\u003e· Approach problems with humility, rigor, and decisiveness.\u003c/p\u003e\n\u003cp\u003e· Demonstrate a high emotional quotient and empathy for your colleagues, creating psychological safety while tackling tough problems and navigating conflicts.\u003c/p\u003e\n\u003cp\u003e· Identify and solicit input from all stakeholders, balancing competing needs and distilling a coherent strategy.\u003c/p\u003e\n\u003cp\u003e· Lead by meeting people where they are at and building bridges to where you need them to go.\u003c/p\u003e\n\u003cp\u003e· Emphasize iterative progress, risk management, and delivering value.\u003c/p\u003e\n\u003cp\u003e· Leave the campsite cleaner and people stronger.\u003c/p\u003e\n\u003cp\u003eWe're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.\u003c/p\u003e\n\u003cp\u003ePayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at \u003ca href=\"mailto:paypalglobaltalentacquisition@paypal.com\"\u003epaypalglobaltalentacquisition@paypal.com\u003c/a\u003e.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease email: \u003ca href=\"mailto:mamunro@paypal.com\"\u003emamunro@paypal.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHFWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1bcca8c1ef0e38811264e5d86c556bd4c368cb48/paylog.png"
  },
  {
    "id": "bb7b1579-105c-44f8-9d8a-d0c7d7160806",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/bb7b1579-105c-44f8-9d8a-d0c7d7160806",
    "created_at": "Mon Jan 11 21:27:52 UTC 2021",
    "company": "SocialVenu",
    "company_url": "http://www.socialvenu.com",
    "location": "Remote (North America Only)",
    "title": "Full Stack Engineer",
    "description": "\u003cp\u003eJob Description: Full Stack Engineer\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNorth American Applicants Only\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eAbout\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSocialVenu enables brands to incentivize their customers to become micro-influencers, driving brand awareness \u0026amp; sales through social word-of-mouth (eWOM) marketing.\u003c/li\u003e\n\u003cli\u003eWe provide micro-influencers with tools to showcase the things they love, share that love on Social media and in return they are rewarded.\u003c/li\u003e\n\u003cli\u003eWe provide our clients the tools to manage, track and reward these micro-influencers.\u003c/li\u003e\n\u003cli\u003eThis channel can be the most powerful marketing method, rivaling the current social marketing spend of $110B annually.\u003c/li\u003e\n\u003cli\u003eImportantly we also possess camera technology used to capture live event experiences, deepening the engagement delivered to brands and consumers.\u003c/li\u003e\n\u003cli\u003eWe’re a group of highly ambitious and equally open-minded, proven professionals.\u003c/li\u003e\n\u003cli\u003eWe are looking to bring on innovative, creative and passionate individuals who want to disrupt the traditional Social Media marketing machine. Our markets include Sports, Entertainment, Athletes, Brands and Non-Profits.\u003c/li\u003e\n\u003cli\u003eBased in Emeryville, California with a globally dispersed team. All team members are currently working remotely.\u003c/li\u003e\n\u003cli\u003eTo see more visit: \u003ca href=\"http://www.socialvenu.com\"\u003ewww.socialvenu.com\u003c/a\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout Team\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCEO is successful entrepreneur. Previously the Co-founder of Demandforce, Inc.\u003c/li\u003e\n\u003cli\u003eBoard Members include: Drew Brees, David West, George Killebrew, Cameron Scholvin, and Chris Gallagher\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFront-End Developer\u003c/p\u003e\n\u003cp\u003eCompensation:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBased on experience\u003c/li\u003e\n\u003cli\u003eAttractive equity and benefits package\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAs one of 4 core engineers you will build the core product with support from our Fullstack \u0026amp; Backend engineers, Designer \u0026amp; Head of Product\u003c/li\u003e\n\u003cli\u003eAble to quickly iterate \u0026amp; test various concepts\u003c/li\u003e\n\u003cli\u003eUser \u0026amp; customer focused to understand and contribute towards features \u0026amp; solutions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExperience/Our Stack:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePreviously built complex web applications (ideally viewable)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExperience in:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWebapp development\u003c/li\u003e\n\u003cli\u003eEmail \u0026amp; other user prompts\u003c/li\u003e\n\u003cli\u003eDashboards \u0026amp; reporting\u003c/li\u003e\n\u003cli\u003eImage \u0026amp; Video processing\u003c/li\u003e\n\u003cli\u003eE-commerce \u0026amp; redemption codes\u003c/li\u003e\n\u003cli\u003eMembership profiles, gamification \u0026amp; rewards\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTech stack \u0026amp; languages:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHtml, CSS, JavaScript (NodeJS), TypeScript, Kotlin, (Python as a plus)\nFrameworks:\u003c/li\u003e\n\u003cli\u003eReact/Redux\u003c/li\u003e\n\u003cli\u003eBootstrap\u003c/li\u003e\n\u003cli\u003eSpring Boot\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDatabase:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePostgreSQL\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExternal tools:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAWS (EC2 instances and Lambda functions)\u003c/li\u003e\n\u003cli\u003eFirebase\u003c/li\u003e\n\u003cli\u003eCloudinary\u003c/li\u003e\n\u003cli\u003eSegment\u003c/li\u003e\n\u003cli\u003eSentry\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail resume to: \u003ca href=\"mailto:sessl@socialvenu.com\"\u003esessl@socialvenu.com\u003c/a\u003e\n\u003cem\u003eNorth American Applicants Only\u003c/em\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHlWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--056b69045767e4388504f30fa3b8d67df382c106/logo_sv_box-super-blue-v%20copy%202.png"
  },
  {
    "id": "46ab84b4-12dc-4a95-ab08-422428554dfc",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/46ab84b4-12dc-4a95-ab08-422428554dfc",
    "created_at": "Fri Oct 09 19:42:30 UTC 2020",
    "company": "Playco",
    "company_url": "http://www.play.co",
    "location": "Remote",
    "title": "Core/Backend Engineer",
    "description": "\u003cp\u003eHere at Playco, we make games that bring the world closer together through play.\u003c/p\u003e\n\u003cp\u003eOur ideal teammates are thoughtful, humble, and passionate professionals who can both zoom into the details and zoom out to embrace the big picture. We are inspired by makers and tinkerers, who are unafraid to experiment with a healthy disregard for constraints. We hope you'll enrich our team with your enthusiasm and passion, both for games and for life.\u003c/p\u003e\n\u003cp\u003eOur engineers are generally amazing at something and great at everything else. We write scalable backend systems, cross-compilers, JavaScript / TypeScript game APIs and tools, and whatever else it takes. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team.\u003c/li\u003e\n\u003cli\u003eArchitect and code sophisticated client/server systems for instant gaming.\u003c/li\u003e\n\u003cli\u003ePlay a critical role in day-to-day coding, performance profiling, optimization, and general troubleshooting.\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.\u003c/li\u003e\n\u003cli\u003eLearn from and mentor other engineers on your team.\u003c/li\u003e\n\u003cli\u003eTake ownership of your projects to make them the best they can possibly be.\u003c/li\u003e\n\u003cli\u003eProvide valuable input on the company’s long-term engineering roadmap and help identify areas of opportunity for improvement.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience.\u003c/li\u003e\n\u003cli\u003eExperience writing clean, testable, high-quality code and designing highly scalable systems in production.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with deployment on cloud environments (AWS, GCP, Azure, etc.).\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in software systems design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eAbility to interact with peers in a constructive and productive style.\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn, or other VCS.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpert knowledge of NodeJS and ES6 / TypeScript.\u003c/li\u003e\n\u003cli\u003eDevOps experience -- setting up CI/CD environments, orchestrating deployments, creating monitoring dashboards, anything that makes the development process easier, more enjoyable and more accountable.\u003c/li\u003e\n\u003cli\u003eExperience in game development and shipped titles.\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/playco/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003eApply Here\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb29d1ab0fec648aee52b0ad6e7ec0a0485551ca/Round_Logo1%20(1).png"
  },
  {
    "id": "85ba20ff-912e-40c9-98c2-1cfe050dfe90",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/85ba20ff-912e-40c9-98c2-1cfe050dfe90",
    "created_at": "Fri Jan 08 06:16:54 UTC 2021",
    "company": "DocVocate, Inc.",
    "company_url": "http://docvocate.com",
    "location": "Portland, Oregon or US West Coast",
    "title": "Lead SaaS Engineer - AWS React Django",
    "description": "\u003cp\u003e\u003cstrong\u003eTitle:\u003c/strong\u003e Lead Engineer\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLocation:\u003c/strong\u003e Portland, OR or US West Coast\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation:\u003c/strong\u003e $200k-$300k/year\u003c/p\u003e\n\u003cp\u003eThe US healthcare system does not cover all Americans, and is often frustrating for those that it does. The frustration comes from unnecessarily high medical care costs and a complete lack of cost transparency. At DocVocate, we’re out to fix that!\u003c/p\u003e\n\u003cp\u003eDocVocate is a VC-backed, rapidly growing health tech startup on a mission to make medical claim processing easy for doctors and patients. Our API-driven platform is a first of its kind: universal, AI-driven claims management solution for healthcare providers.\u003c/p\u003e\n\u003cp\u003eWe are looking for a Lead Engineer with a mix of hands-on software development and agile management skills to join our team.  We are seeking a Lead Engineer looking to develop into a company leader. The ideal candidate resides in or near the US Pacific Time Zone. If you are passionate about building a deeply impactful and innovative platform, and working tirelessly to achieve success, we’d love to meet with you.\u003c/p\u003e\n\u003cp\u003eIn partnership with DocVocate’s leadership team, the Lead Engineer will be responsible for building, leading, and managing our engineering team to deliver the AI-driven healthcare financial platform of the future.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eWhat You Will Do\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCoordinate and direct our existing SW development, DevOps, and QA resources.\u003c/li\u003e\n\u003cli\u003eBuild our capabilities by adding and developing staff as necessary, and maturing our software - development lifecycle.\u003c/li\u003e\n\u003cli\u003ePrioritize engineering team backlogs and plan releases.\u003c/li\u003e\n\u003cli\u003eLead agile rituals such as standups, grooming sessions, retrospectives, and demos.\u003c/li\u003e\n\u003cli\u003eContribute to our products directly by developing software.\u003c/li\u003e\n\u003cli\u003eParticipate in relationships with key customers and partners that inform engineering plans.\u003c/li\u003e\n\u003cli\u003eRegularly and proactively communicate delivery schedules and achievements to key stakeholders.\u003c/li\u003e\n\u003cli\u003eTravel occasionally to industry events as well as internal, customer and partner meetings (when it is safe to do so).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eWho You Are\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have played a major role in building a successful, high-volume SaaS solution.\u003c/li\u003e\n\u003cli\u003eYou are an experienced engineer or engineering manager that can be effective right away in a cloud-native AWS environment that uses the following technologies:\u003c/li\u003e\n\u003cli\u003ePython, JavaScript, PostgreSQL\u003c/li\u003e\n\u003cli\u003eReact, Django\u003c/li\u003e\n\u003cli\u003eAWS Cloudfront, EC2. S3, Lambda, Fargate, Athena\u003c/li\u003e\n\u003cli\u003eGithub, CircleCI\u003c/li\u003e\n\u003cli\u003eTerraform, Packer, Cypress\u003c/li\u003e\n\u003cli\u003eElastic Cloud\u003c/li\u003e\n\u003cli\u003eJira, Slack, Confluence, Trello\u003c/li\u003e\n\u003cli\u003eYour primary competence is software development, but you have sufficient knowledge of QA, data engineering, and DevOps to set priorities for these disciplines and gauge the quality of their work.\u003c/li\u003e\n\u003cli\u003eYou have experience personally resolving production issues in multilayered SaaS products.\u003c/li\u003e\n\u003cli\u003eYou have a deep curiosity that drives you to learn, investigate, and constantly ask why.\u003c/li\u003e\n\u003cli\u003eYou have a strong sense of ownership and a \"whatever it takes\" attitude towards getting stuff done.\u003c/li\u003e\n\u003cli\u003eYou have expert communication skills, including the ability to motivate and direct other engineers.\u003c/li\u003e\n\u003cli\u003eYou are comfortable with ambiguity, and have an instinct for moving quickly.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eWhat’s In It For You\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuild revenue cycle products to improve efficiency of health care delivery as COVID-19 continues to expose and overwhelm the U.S. healthcare system.\u003c/li\u003e\n\u003cli\u003eWork closely with top healthcare professionals in a rapidly growing, seed-stage startup.\u003c/li\u003e\n\u003cli\u003eReceive attractive cash and equity compensation, based on experience.\u003c/li\u003e\n\u003cli\u003eThrive in a flexible, open-minded, and supportive culture.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt DocVocate, we are committed to building a diverse and inclusive company. We seek to create a culture where everyone can belong because we believe that people do their best work when they can show up every day as their authentic selves. We welcome people of different backgrounds, experiences, abilities, and perspectives.\u003c/p\u003e\n\u003cp\u003eDocVocate is an equal opportunity employer. We do not make hiring or employment decisions on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, disability status or genetic information, in compliance with applicable federal, state and local law.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply here: \u003ca href=\"https://airtable.com/shrFWheKWwIWuvY1x\"\u003ehttps://airtable.com/shrFWheKWwIWuvY1x\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDJVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2ae04973291e4e16939a8307828ba18f857d4b22/logo-docvocate@2x.png"
  },
  {
    "id": "bbe1e167-f135-4b0c-9d78-2f1825b6dac8",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/bbe1e167-f135-4b0c-9d78-2f1825b6dac8",
    "created_at": "Thu Jan 07 11:35:14 UTC 2021",
    "company": "Hasura",
    "company_url": "https://hasura.io/",
    "location": "Remote",
    "title": "Fullstack Web Developer",
    "description": "\u003cp\u003eWe are looking for a fullstack web developer who can take ownership of multiple frontend sites at Hasura, both on the UI and backend front.\u003c/p\u003e\n\u003cp\u003eYou will be a part of a global team realizing a vision to build the next generation of application development powered by GraphQL. Hasura is focused on making data access fast, secure \u0026amp; scalable; so that developer teams or API consumers can immediately get productive. We want to get to a world where data delivery is just another piece of infrastructure.\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team, with offices in San Francisco \u0026amp; Bangalore.\u003c/p\u003e\n\u003cp\u003eBrief Overview:\nWe are looking for a fullstack web developer (in Bangalore preferably, but we’re open to remote applications as well). Your role will involve creating, improving and maintaining the web assets at Hasura including our main website, docs and learn assets. You will be working closely with the marketing, growth, community and design teams at Hasura.\u003c/p\u003e\n\u003cp\u003eWe’re looking for someone who is very familiar with web technologies and cares deeply about the end-user experience. Our ideal candidate will be someone who has an extremely high attention to detail, is very focussed on performance, automation, accessibility as well as the aesthetic aspects of the website.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuild and maintain reusable UI components for the web platform.\u003c/li\u003e\n\u003cli\u003eSetup APIs for any dynamic functionalities across the website.\u003c/li\u003e\n\u003cli\u003eTake ownership of the website metrics focussed on speed - lighthouse metrics, health and monitoring by setting up tooling around it and constantly monitoring for changes.\u003c/li\u003e\n\u003cli\u003eBuild CMS interfaces for the product and marketing team to be able to quickly make modifications to the website.\u003c/li\u003e\n\u003cli\u003eWork with the Growth team for setting up different integration pipelines (database to different external services).\u003c/li\u003e\n\u003cli\u003eSetup A/B testing pipeline for React apps.\u003c/li\u003e\n\u003cli\u003eTake ownership and initiative of upgrading any legacy components of the architecture in moving to a more modern and maintainable stack.\u003c/li\u003e\n\u003cli\u003eSetup CI/CD pipelines for automating deployments of web apps.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2+ years of work experience as a fullstack engineer\u003c/li\u003e\n\u003cli\u003eIn-depth experience with HTML/CSS/Javascript and React/Gatsby.\u003c/li\u003e\n\u003cli\u003eExperience with writing, managing and testing APIs in either of Node.js/Golang is a must.\u003c/li\u003e\n\u003cli\u003eWorking knowledge of Docker and Kubernetes.\u003c/li\u003e\n\u003cli\u003eExperience in setting up CI/CD pipelines.\u003c/li\u003e\n\u003cli\u003eGood written and verbal communication skills in English.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eGood to have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of GraphQL / Hasura.\u003c/li\u003e\n\u003cli\u003eGood understanding of SEO best practices for frontend.\u003c/li\u003e\n\u003cli\u003eDesign \u0026amp; UX Experience is a plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLocation:\u003c/p\u003e\n\u003cp\u003eThis role is fully remote. We hire in most countries. If you're applying from the US, we hire remotely in these 10 states in the US: Illinois, Virginia, California, Washington State, Maryland, Florida, Colorado, Massachusetts, Oregon, New York.\u003c/p\u003e\n\u003cp\u003eWorking at Hasura:\u003c/p\u003e\n\u003cp\u003eAt Hasura, we help developers build modern apps and APIs faster. Through your work at Hasura, you will have the opportunity to make a lasting impact on both Hasura as well as the larger developer ecosystem.\u003c/p\u003e\n\u003cp\u003eAs a team, we take a lot of pride in our work. We obsess over the developer experience, and our first priority as a company will always be to make things easier for our users.\u003c/p\u003e\n\u003cp\u003eWe offer competitive salaries, have a generous vacation policy and provide health insurance for everyone employed with Hasura.\u003c/p\u003e\n\u003cp\u003eWe are an equal opportunity employer and do not tolerate discrimination of any kind.\u003c/p\u003e\n\u003cp\u003eAbout Hasura:\u003c/p\u003e\n\u003cp\u003eHasura is a venture-backed open-source technology company with offices in San Francisco and Bangalore. Hasura makes your data instantly accessible over a real-time GraphQL API, so you can build and ship modern apps and APIs faster. Hasura connects to your databases, REST servers, GraphQL servers and third party APIs (eg: Stripe, Salesforce) and provides a unified API across all your data sources.\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team, with offices in San Francisco \u0026amp; Bangalore.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eYou can apply by visiting the link:\n\u003ca href=\"https://hasura.info/3s5OANE\"\u003ehttps://hasura.info/3s5OANE\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--06ada3c68c12dc04e0b1429d8f6da0a4cdf2ea43/logo_black.png"
  },
  {
    "id": "37d79e89-f50f-459a-bc29-76e499cd4cba",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/37d79e89-f50f-459a-bc29-76e499cd4cba",
    "created_at": "Thu Jan 07 09:11:18 UTC 2021",
    "company": "VISI/ONE GmbH",
    "company_url": "https://www.visi-one.com/de",
    "location": "Berlin",
    "title": "Senior Fullstack Engineer - Javascript",
    "description": "\u003cp\u003eVISI/ONE is the world's leading company in price labeling systems. Since our foundation in 1998, our products have become today's global standard for more than 40 automotive brands in over 70 countries. We believe in simple, high-quality products that have been developed to perfection. We believe in products that are of inspiring design and quality, surprising our customers with new ideas and unexpected solutions.\u003c/p\u003e\n\u003cp\u003eOur CSI (CarSales Intelligence) Display is the world's first product solution with cutting-edge cloud software and NB-IoT hardware technology for automotive digital pricing. With CSI Display, car dealers can update digital price boards inside cars wirelessly and from anywhere. This game-changing technology innovation not only eliminates the inconvenience and inefficiency of traditional paper-based solutions, but also creates entirely new and innovative opportunities to increase dealership profits.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a Fullstack Engineer at VISI/ONE you are part of a development team of passionate and dedicated developers. In a collaborative and agile environment, you'll work on the next generation of our highly scalable cloud platform, leveraging the latest cutting-edge technology.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDegree in computer science or equivalent or you have acquired a deep understanding of software development in a comparable education or practical experience.\u003c/li\u003e\n\u003cli\u003eSeveral years of professional experience in software development, design and development of object-oriented software.\u003c/li\u003e\n\u003cli\u003eKnowledge of the following web technologies: Node.js, JavaScript/TypeScript, Rest APIs, GraphQL, Test frameworks, React, HTML5 and CSS.\u003c/li\u003e\n\u003cli\u003eGood command of SQL.\u003c/li\u003e\n\u003cli\u003eExperience with Python is a plus.\u003c/li\u003e\n\u003cli\u003eVery good understanding and the passion to write Clean Code with the ability and the need to implement elegant, durable solutions.\u003c/li\u003e\n\u003cli\u003eExperience with cloud, micro-service and serverless architecture, ideally on the AWS platform and with common development tools such as versioning, build and test tools.\u003c/li\u003e\n\u003cli\u003eEnjoyment of solving complex problems.\u003c/li\u003e\n\u003cli\u003eOpen-minded towards new technologies and enjoyment of learning.\u003c/li\u003e\n\u003cli\u003eFluent written and spoken English skills, German is a big plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eInternational team of passionate tech enthusiasts with great team spirit and hands-on mentality.\u003c/li\u003e\n\u003cli\u003eOutstanding career opportunities in a growth oriented environment.\u003c/li\u003e\n\u003cli\u003eContinuous development of skills and knowledge.\u003c/li\u003e\n\u003cli\u003eStartup feeling at a global Market Leader.\u003c/li\u003e\n\u003cli\u003eNew designed office located in the heart of Berlin.\u003c/li\u003e\n\u003cli\u003eCompetitive payment structure.\u003c/li\u003e\n\u003cli\u003eLast, but not least: beverages, organic fruits and delicious sweets at work – enjoy.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe look forward to your application!\u003c/strong\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://visione.join.com/jobs/1726380-senior-fullstack-engineer-javascript?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bfullstack%2Bengineer%2B-%2Bjavascript\"\u003ehttps://visione.join.com/jobs/1726380-senior-fullstack-engineer-javascript?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bfullstack%2Bengineer%2B-%2Bjavascript\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcm1VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--583a643cf1cc2cbba7ecaeb1463e0f3f87551df6/visi%20one.png"
  },
  {
    "id": "75e06ee5-aed7-40c5-8e97-c906f6dff08f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/75e06ee5-aed7-40c5-8e97-c906f6dff08f",
    "created_at": "Wed Jan 06 21:21:59 UTC 2021",
    "company": "InMotion Hosting",
    "company_url": "https://www.inmotionhosting.com/employment/",
    "location": "Virginia Beach ",
    "title": "Senior Software Developer (Remote Available)",
    "description": "\u003cp\u003eOur Development Team is looking for a Senior Software Developer to join them in shaping our company by creating, enhancing, and maintaining PHP based internal and external products. As part of the team, you will work within the LAMP stack in an Agile based environment to help ensure our products provide a great user experience and significant value to the customer.\u003c/p\u003e\n\u003cp\u003eThis role can be filled remotely within the United States or from one of our offices.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You’ll Do:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Develop structured application/interface code, new program documentation, operations documentation and user guides in a casual, flexible environment\u003c/p\u003e\n\u003cp\u003e-Communicate with end users and internal customers to develop, debug, and test application software for accuracy, integrity, interoperability and completeness.\u003c/p\u003e\n\u003cp\u003e-Produce reliable, testable software applications using a disciplined development approach\u003c/p\u003e\n\u003cp\u003e-Utilize your advanced PHP and MySQL skills to create back end tooling\u003c/p\u003e\n\u003cp\u003e-Collaborate with stakeholders and leadership to prioritize and implement features\u003c/p\u003e\n\u003cp\u003e-Develop new functionality and applications on cross functional Agile project teams\u003c/p\u003e\n\u003cp\u003e-Review and test team member’s code to ensure the software meets our high quality standards and operates efficiently\u003c/p\u003e\n\u003cp\u003e-Build your skill set in a collaborative, team-focused environment\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You’ll Get:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Profit-sharing twice yearly\u003c/p\u003e\n\u003cp\u003e-Customizable 401(k) plans that include company matching\u003c/p\u003e\n\u003cp\u003e-Medical, dental, vision, disability, life Insurance\u003c/p\u003e\n\u003cp\u003e-Paid time off and company paid holidays\u003c/p\u003e\n\u003cp\u003e-Reimbursement for tuition, certifications, or professional memberships\u003c/p\u003e\n\u003cp\u003e-Additional paid time off to volunteer in your community\u003c/p\u003e\n\u003cp\u003eAnd when onsite…\u003c/p\u003e\n\u003cp\u003e-Awesome company parties and events\u003c/p\u003e\n\u003cp\u003e-Free weekly lunch and snacks\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIdeal Candidates Have:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-5-8 years progressive development experience, primarily focused on web applications, back end automation\u003c/p\u003e\n\u003cp\u003e-Bachelor’s Degree in Computer Science and/or equivalent experience\u003c/p\u003e\n\u003cp\u003e-Extensive background in LAMP development\u003c/p\u003e\n\u003cp\u003e-Ability to move back and forth between Front End and API Back End work\u003c/p\u003e\n\u003cp\u003e-Experience with UI/UX fundamentals\u003c/p\u003e\n\u003cp\u003e-Advanced experience with PHP and MySQL\u003c/p\u003e\n\u003cp\u003e-Advanced understanding of object oriented principles\u003c/p\u003e\n\u003cp\u003e-Talent for building user interfaces using JS, jQuery, HTML, CSS and AJAX\u003c/p\u003e\n\u003cp\u003e-Background in refactoring/verifying systems through automated testing and test-driven development in large scale systems\u003c/p\u003e\n\u003cp\u003e-Experience with software deployment, Continuous Integration (CI), and Continuous Delivery (CD) concepts, applications, and tools highly preferred\u003c/p\u003e\n\u003cp\u003e-Basic knowledge of the Linux/Unix command-line\u003c/p\u003e\n\u003cp\u003e-Experience with PHP based MVC frameworks required\n-Advanced JavaScript experience and mid-level or better experience with one or more of the common frameworks like React or Vue.js is a plus\u003c/p\u003e\n\u003cp\u003e-A passion for creating a high quality user experience\u003c/p\u003e\n\u003cp\u003e-Experience with development of automated customer processes and systems\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLocation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Virginia Beach, VA\u003c/p\u003e\n\u003cp\u003e-Denver, CO\u003c/p\u003e\n\u003cp\u003e-Permanent remote within the United States\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply Here: \u003ca href=\"https://inmotionhosting.applytojob.com/apply/xAnYXfMgfO/Senior-Software-Developer-Remote-Available?source=GitHub+Sponsored\"\u003ehttps://inmotionhosting.applytojob.com/apply/xAnYXfMgfO/Senior-Software-Developer-Remote-Available?source=GitHub+Sponsored\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXVVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8c966cc914d50b5a7aebfaa03a4c4df03d5e25c4/InMotion%20Hosting.jpg"
  },
  {
    "id": "f72115bb-319a-4d82-beed-e0fd4fb5be39",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f72115bb-319a-4d82-beed-e0fd4fb5be39",
    "created_at": "Wed Jan 06 16:44:43 UTC 2021",
    "company": "NJI Media",
    "company_url": "https://www.njimedia.com/",
    "location": "Alexandria, VA",
    "title": "Full Stack Developer",
    "description": "\u003cp\u003eNJI is a wildly creative and strategically disciplined agency with offices in London, Washington, D.C., and Singapore. We work seamlessly across teams and time zones to align and deliver for our clients.\u003c/p\u003e\n\u003cp\u003eWe seek a versatile web developer to join our Alexandria, VA office with at least 3+ years of experience who enjoys a broad range of both front-end and back-end development responsibilities. The ideal candidate is able to quickly, independently, and precisely build a PHP-driven website from design assets and functional documentation. Maintenance and updates to existing sites also factors heavily into the responsibilities of this position. PHP experience is a must – we frequently build on proven and popular content management systems like Drupal and WordPress.\u003c/p\u003e\n\u003cp\u003eWe hope to find a developer that can build a site from Sketch/Adobe XD into WordPress or Drupal and be able to use WPVIP PHPCS standard.\u003c/p\u003e\n\u003cp\u003eSkills\u003c/p\u003e\n\u003cp\u003ePlease examine the many skills we look for in a candidate. The right technical experience and skill will get you an interview, attitude and professionalism will get you the job.\u003c/p\u003e\n\u003cp\u003eRequired Professional Skills\u003c/p\u003e\n\u003cp\u003eAttention to Detail – You must be naturally precise, and you must take genuine, personal pride in being meticulous about your craft.\nCommunication – Our operational style emphasizes flexibility and encourages autonomy. As a result, uncommonly good common sense, and exceptional communication skills are absolutely indispensable for every team member.\nTime Management – We know that nothing is ever ‘done’. The proven ability to manage your time sensibly and proportionately with project priorities is critical.\u003c/p\u003e\n\u003cp\u003eFront-end Experience\u003c/p\u003e\n\u003cp\u003eHTML – Demonstrated correct and semantic application of markup, including headers, lists, forms, etc, ability to distinguish HTML 5 from XHTML 1, HTML 4.01, etc.\nCSS – Mastery of clean and organized styling techniques, including responsive techniques. Knowledge of graceful degradation/progressive enhancement approaches to browser support\nJavascript – Strong knowledge of syntax, variables, and operators. Experience using basic features of consoles and other debugging tools\njQuery – Capable of leveraging jQuery to modify existing UI behaviors and interactions and to create brand new interactions from scratch\nSketch/Adobe XD – Strong knowledge on creating a site from Sketch and AD files\u003c/p\u003e\n\u003cp\u003eBack-end Experience:\u003c/p\u003e\n\u003cp\u003eWordPress/Drupal – Demonstrated experience installing and developing quality sites in WordPress 5+ or Drupal 7+\nPHP5 – Very strong with PHP syntax and features. Understand variables, constants, arrays, loops, internal functions, php configurations, error logging/reporting, and OOP principles\nLinux – Basic familiarity working from shell or terminal in Mac or Linux\nApache – Background with Apache web server, knowledge of basic configuration, optimization and authentication techniques\nMySQL – Knowledge of schemas, tables, users and privileges, principles of relational databases, and SQL commands. Able to migrate legacy data from unlike management systems\nAnalytics – Familiar with implementing and evaluating results from metric gathering technologies such as Google Analytics\nSSL – Experience requesting and installing certificates, directing traffic through secure ports, and encrypting protected data\nMVC – Good grasp of the MVC architectural pattern\nAPIs and Web Services – Experience working with APIs, and creating and consuming web services, using SOAP and REST protocols\nJSON – Familiar with JSON syntax, asynchronous Javascript, and encoding/decoding JSON data in PHP\nGit – Familiar with Git commands including branching, merging and fixing merge conflicts\nGitHub: Familiar with PR and Merging\nPHPCS – have built site using the PHPCS code standards\nXML – Understand how to properly structure and use XML for transferring data\u003c/p\u003e\n\u003cp\u003eAdditional Skills\u003c/p\u003e\n\u003cp\u003eThese are not required, but would be considered plusses:\u003c/p\u003e\n\u003cp\u003eSass, SCSS\nGulp/Grunt, Bower package manager\nRegEx skills\nOther technologies such as NGINX, PHP–FPM, APC, Memcache, Varnish, and CDN\nWorked locally using Lando or Vagrant\nDrupal 7/8\u003c/p\u003e\n\u003cp\u003eTHANKS, BUT…\u003c/p\u003e\n\u003cp\u003eOh, and thanks for reading this all the way through. To be clear, we’re not interested in hearing from recruiters, recruiters who claim not to be “recruiters,” headhunters, or staffing companies.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply here: \u003ca href=\"https://recruiting.paylocity.com/recruiting/jobs/Details/414298/NJI-Media-LLC/Full-Stack-Developer\"\u003ehttps://recruiting.paylocity.com/recruiting/jobs/Details/414298/NJI-Media-LLC/Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUdVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dd71813ed120cc17d779364c83be1f02a735ca27/NJI-Full-RGB.png"
  },
  {
    "id": "d0814933-08b2-408d-82e6-d4b49ea01b5a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d0814933-08b2-408d-82e6-d4b49ea01b5a",
    "created_at": "Wed Jan 06 14:39:52 UTC 2021",
    "company": "Expert Systems AG",
    "company_url": "https://www.provenexpert.com/de-de/",
    "location": "Berlin",
    "title": "Fullstack Developer (m/w/d)",
    "description": "\u003cp\u003eProvenExpert ist mit über 100.000 glücklichen Kunden führender deutscher Anbieter von Online-Marketing-Software. Immer mehr Unternehmen aus über 50 Branchen boosten mit unserem Tool für professionelles Bewertungsmarketing aktiv ihre Online-Reputation und damit ihren Erfolg. Dafür setzt sich täglich unser wunderbares Team mit viel Spaß und Leidenschaft ein. Wir sind ein Berliner Unternehmen und stolz darauf, dass wir mittlerweile fast 50 Kollegen/innen zählen - bisher in Berlin und Krakau. Langweilig ist es bei uns nie, denn wir greifen nach den Sternen. Um mit unserem weiteren Wachstum Schritt zu halten, suchen wir aktuell 5 neue Kollegen (m/w/d) für unseren Standort Berlin.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls (Senior) Fullstack Developer (m/w/d) optimierst du kontinuierlich unsere Entwicklungs-, Test- und Produktivsysteme. Du bist zuständig für die Automatisierung und kontinuierliche Weiterentwicklung unserer Build- \u0026amp; Deployment-Prozesse. Du realisierst neue Features und Produktupdates in PHP und mit NoSQL-Datenbanken (MongoDB) und bist für die Wartung und Instandhaltung der Plattform zuständig - die Skalierbarkeit und Performance immer im Fokus. In unseren kleinen Teams hast du die Freiheit, deine Nische zu finden, in der du mit Leidenschaft entwickeln (und dich weiterentwickeln) kannst.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualifikation\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMind. 2 Jahre praktische Berufserfahrung als Fullstack Developer (m/w/d)\u003c/li\u003e\n\u003cli\u003eDu verfügst über solide Kenntnisse in der Administration von Linux-Systemen und dem Betrieb von Web-Applikationen\u003c/li\u003e\n\u003cli\u003eDu hast Erfahrungen in PHP, JavaScript/TypeScript, NoSQL, Node.js und Git\u003c/li\u003e\n\u003cli\u003eFolgende Dienste sind für dich kein Neuland: nginx, MongoDB, Gitlab\u003c/li\u003e\n\u003cli\u003eOOP, MVC und Symfony sind für dich keine Fremdwörter\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu hast die Möglichkeit, Verantwortung zu übernehmen, dich fachlich und persönlich weiterzuentwickeln und dich auszuprobieren\u003c/li\u003e\n\u003cli\u003eAuf dich wartet ein vielfältiges Team, das mit dir wachsen und Großes bewegen möchte\u003c/li\u003e\n\u003cli\u003eDu arbeitest in modernen, neu eingerichteten Büroräumen in kleinen Teams\u003c/li\u003e\n\u003cli\u003eDu suchst dir deine Hardware aus, mit der du am liebsten arbeitest (PC/Mac bzw. Desktop/Notebook)\u003c/li\u003e\n\u003cli\u003eWork-Life-Balance ist uns wichtig - wir achten auf eine saubere Zeiterfassung (keine Überstunden) und bieten kostenlose Yoga-Kurse an\u003c/li\u003e\n\u003cli\u003eUnd nicht zu vergessen: neben einem attraktiven Gehalt erwarten dich eine Chill-Out-Lounge mit Massagesesseln und Fußballkickern, regelmäßige Teamevents, Parties sowie täglich frisches Obst, Snacks und Getränke\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDas klingt nach deinem neuen Job? Dann schick uns deine vollständige Bewerbung in einem PDF-Dokument inkl. frühestem Eintrittsdatum und Gehaltsvorstellung! Wir freuen uns, von dir zu hören! Für weitere Informationen besuche gern unsere Website.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://provenexpert.join.com/jobs/1732323-fullstack-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bw%2Bd\"\u003ehttps://provenexpert.join.com/jobs/1732323-fullstack-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGFVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fa28a38cbc7b23987ee9e23d21f3e01eeabfadb7/provenexpert-com_full_1460724201.jpg"
  },
  {
    "id": "7d842069-8242-4a7d-bbda-08d0fd5fcb1b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/7d842069-8242-4a7d-bbda-08d0fd5fcb1b",
    "created_at": "Wed Jan 06 08:58:48 UTC 2021",
    "company": "lengoo GmbH",
    "company_url": "https://www.lengoo.com/",
    "location": "Berlin, Germany",
    "title": "Node.js Backend Engineer (m/f/d)",
    "description": "\u003cp\u003eYOUR MISSION\u003c/p\u003e\n\u003cp\u003eAs a Backend Engineer, you will be working with a dynamic, international tech team based in Berlin that has been operational for the last 2 years. Your mission is to design and develop a micro-service architecture that integrates at its core the best engineering practises and the latest generation of machine translation research.\u003c/p\u003e\n\u003cp\u003eYOUR RESPONSIBILITIES\u003c/p\u003e\n\u003cp\u003eGather, understand, and prioritize requirements, research potential solutions, rapidly build prototypes, and distill and communicate what was learned, expected risks, necessary resources, and potential security concerns.\nProvide high-level technical design, strategy roadmap development, and technical architecture related to our existing and new services and related infrastructure used by our front-end engineers.\nAssure that our architectures are consistent with industry best practices including scalability, availability, maintainability, and flexibility.\nCommunicate strategies and processes around our services to cross-functional groups.\nHack or learn whatever you want during bi-weekly learning afternoon.\nHelping us to select the best talent to join us in our Product Team (code reviews and participation in interviews).\nOnboard new colleagues.\u003c/p\u003e\n\u003cp\u003eYOUR PROFILE\u003c/p\u003e\n\u003cp\u003eYou are an experienced software engineer with 3+ years of experience.\nYou have professional working experience as a software engineer using Javascript / TypeScript / Node.js / NestJS and in writing highly tested software (unit testing, integration testing).\nYou have experience defining and modelling a consumable API.\nYou work autonomously, are energized by missions and goals more than a specific list of tasks.\nExperienced in designing, analyzing, optimising code, and troubleshooting large-scale distributed systems.\u003c/p\u003e\n\u003cp\u003eWHY US?\u003c/p\u003e\n\u003cp\u003eA fast-growing startup which is financially secured by EU research grants and well-known investors and already serves more than 3,000 business clients.\nThe opportunity to contribute to cutting edge developments in the field of machine learning.\nRegular feedback and check-ins on your well-being.\nFlexible work environment.\nA modern office in the heart of Berlin with lots of bars and restaurants closeby.\nOutstanding team atmosphere through regular team events, hackathons, and lunches.Development opportunities through conferences and own learning time slots.\nSubsidized gym membership (Urban Sports Club), free breakfast, coffee, drinks, fruits and dinner (after 8 pm).\nWe give you one additional day of vacation, both 24.12 and 31.12. are half day off\u003c/p\u003e\n\u003cp\u003eABOUT US\u003c/p\u003e\n\u003cp\u003eLengoo makes AI work for translation. As a language tech company, we supercharge human translators with AI technology. We custom-train neural machine translation systems for our clients using their own data. Our language models learn all about the enterprise’s individual way to communicate and produce high-quality machine translations. The feedback of human translators constantly improves our language models and allows us to provide professional translations 3 times faster and 50% cheaper than average. We support global enterprises like the car rental company Sixt, Swiss telecommunication provider Sunrise Communications, or French tire manufacturer Michelin. Join our fast-growing, international team and let’s shape the future of translation together!\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply directly on the career page or send an email to \u003ca href=\"mailto:lengoo-jobs@m.personio.de\"\u003elengoo-jobs@m.personio.de\u003c/a\u003e, mentioning the job post on GitHub!\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "adc996fe-5e04-40ec-bb50-45f4059f0de6",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/adc996fe-5e04-40ec-bb50-45f4059f0de6",
    "created_at": "Wed Jan 06 07:44:28 UTC 2021",
    "company": "Binance",
    "company_url": "http://binance.com",
    "location": "Singapore",
    "title": "Front-end Team Lead (React / Blockchain)",
    "description": "\u003cp\u003eWe are looking for a Front-end Team Lead to join the Binance Chain team.\u003c/p\u003e\n\u003cp\u003eThe ideal candidate should have a solid engineering skills as well as people management capabilities. Crypto/blockchain experience (DApps, Wallets, etc) would be a huge advantage.\nIf you think you have what it takes to be part of a high performing team, we would like to hear from you.\nThis is a full-time position that can be remote or in one of our locations (e.g. Singapore). Our preference is Asian timezones.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplement new user-facing features in Binance’s products which have a huge amount of PV everyday\u003c/li\u003e\n\u003cli\u003eManage the team\u003c/li\u003e\n\u003cli\u003eWrite client-side code to create super-fast, easy-to-use, web-based applications which include website for both desktop and mobile browsers, and hybrid in-app pages\u003c/li\u003e\n\u003cli\u003eOptimize web applications to maximize speed and scale\u003c/li\u003e\n\u003cli\u003eBuild libraries and frameworks that support complex web applications, speedup development efficiency and improve code quality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eMinimum qualifications:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years developing production JavaScript code and strong knowledge of React.JS\u003c/li\u003e\n\u003cli\u003eFluent English. Proficiency in Chinese would be of an advantage, to communicate with a variety of stakeholders across the company\u003c/li\u003e\n\u003cli\u003eFamiliar with crypto technology, experience in using dApp and wallets\u003c/li\u003e\n\u003cli\u003eUnderstanding of state-management patterns such as Redux, Flux or similar\u003c/li\u003e\n\u003cli\u003eProven track record of delivering projects with high quality UI\u003c/li\u003e\n\u003cli\u003eBachelor’s/Master’s degree in computer science, engineering or equivalent industry experience\u003c/li\u003e\n\u003cli\u003eExperience in developing responsive web sites for diverse clients from high powered desktop computers to small footprint mobile devices\u003c/li\u003e\n\u003cli\u003eExperience with modern front end technologies (Styled System, Webpack, etc)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePreferred:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOpen-source contributor, especially in the crypto/blockchain area\u003c/li\u003e\n\u003cli\u003eFamiliarity with the whole web stack, including protocols and server side techniques\u003c/li\u003e\n\u003cli\u003eFamiliar with server-side rendering\u003c/li\u003e\n\u003cli\u003eFamiliar with the source code of one or two famous front-end libraries\u003c/li\u003e\n\u003cli\u003eTypeScript\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply via: \u003ca href=\"https://jobs.lever.co/binance/94e2b754-d49b-4606-b92b-74818f74646c\"\u003ehttps://jobs.lever.co/binance/94e2b754-d49b-4606-b92b-74818f74646c\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzZVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a4796cb9addb3eca55f27d40c91af110cf7ad3fe/binance_logo.png"
  },
  {
    "id": "43ddd9a4-4c49-46a0-8b3e-6f1b3e7c522b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/43ddd9a4-4c49-46a0-8b3e-6f1b3e7c522b",
    "created_at": "Tue Jan 05 19:31:47 UTC 2021",
    "company": "Welcome",
    "company_url": "https://heywelcome.com",
    "location": "Remote | NYC",
    "title": "Senior Software Engineer",
    "description": "\u003ch1\u003eAbout the role\u003c/h1\u003e\n\u003cp\u003eThe Senior Software Engineer is a experienced technical leader who drives the development of new products and initiatives. Collaborating closely with Design, Product Management, and Engineering teams, this role works with others to determine what to build and how to build it. Senior software engineers @ Welcome are highly autonomous user-focused professionals that know how to deliver rapid value while building software with a high degree of craftsmanship.\u003c/p\u003e\n\u003ch2\u003eAbout Welcome\u003c/h2\u003e\n\u003cp\u003eOur mission is to help companies build lasting relationships with candidates and employees. We're reimagining the closing experience with the goal of improving close and retention rates, while building the first real-time compensation data set to help companies make better offers and level-set pay equity.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eFor Employees\u003c/strong\u003e: We make it easy to understand their total compensation and how their financial relationship with the company grows and evolves over time (cash, equity, refresher grants, benefits/perks, etc).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eFor Candidates\u003c/strong\u003e: We make it easy to understand their offer (digital and fully branded), which includes total compensation, equity, benefits, perks, the team they’ll work with, and the culture of the company.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eFor HR \u0026amp; People teams\u003c/strong\u003e: With a heavy focus on the candidate experience, we streamline offer creation and collaboration to run a more effective closing process, better explain total compensation through our digital offer experience, and integrate our real-time comp and equity data to make better offers.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur team is deeply invested in encouraging a culture that promotes design thinking, collaboration and a passion for excellence. We work together as a team to build exceptional products that transform the hiring experience.\u003c/p\u003e\n\u003ch2\u003eResponsibilities\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWrite server-side functionality using Python / Django and develop client-side interfaces using Javascript / ReactJs.\u003c/li\u003e\n\u003cli\u003eDrive the creation, shipping, and maintenance of capabilities across the Welcome Platform.\u003c/li\u003e\n\u003cli\u003eParticipate in the entire product creative process, including user interviews, design meetings, technical architecture decisions, and resulting implementation.\u003c/li\u003e\n\u003cli\u003eContinually collaborate with other members of the Engineering team, in addition to Product and Design teams.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eTL;DR\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://heywelcome.com\"\u003eWelcome\u003c/a\u003e (100% remote, NYC based) is looking for \u003cstrong\u003eSenior Software engineers\u003c/strong\u003e in any of the following domains: backend, frontend, and data. Our stack is 100% Python on the backend and ReactJS on the frontend. We like you already and hope the feeling is mutual.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eemail your resume to \u003ca href=\"mailto:dan@heywelcome.com\"\u003edan@heywelcome.com\u003c/a\u003e 💌\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3lVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2dd272482033bb28b0310ed0d882496cb19a575f/Green%20Avatar.png"
  },
  {
    "id": "a01151be-f939-48e7-9ce8-2d15cf88ce65",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a01151be-f939-48e7-9ce8-2d15cf88ce65",
    "created_at": "Tue Jan 05 18:56:16 UTC 2021",
    "company": "Parade",
    "company_url": "https://yourparade.com",
    "location": "Remote",
    "title": "Frontend Engineer",
    "description": "\u003cp\u003eParade is growing! We are hiring another remote, full-time frontend developer to join our Digital team as we continue to rewrite the American underwear story.\u003c/p\u003e\n\u003cp\u003eAs a front-end developer, you’ll build innovative e-commerce digital products to provide our community with a seamless and fun shopping experience. You’ll do much more than just write code - you’ll be an integral part of the entire digital product development process, from ideation through delivery and iteration.\u003c/p\u003e\n\u003cp\u003eYou’ll work on our Digital team, made up of folks across growth, design, and engineering, to drive our business forward and bring Parade to hundreds of thousands of people across the United States over the next year. This role reports to the Head of Engineering and will work closely with both them and our current engineer.\u003c/p\u003e\n\u003cp\u003eOur Stack \u0026amp; Process:\nNew frontend projects typically start with a set of Figma designs, coupled with detailed interaction notes, which we’d hand off to you. You’ll take these and turn them into live code on a weekly cadence. We value good software and believe in nimbleness as a defining characteristic of our success.\u003c/p\u003e\n\u003cp\u003eOur storefront runs on Shopify Plus, so you should be comfortable with Liquid templating and generally know your way around Shopify theme development and deployment. Strong HTML, CSS, and JS skills are a must-have. You should also be comfortable doing performance optimization on the frontend (and it’s a bonus if you’ve also previously optimized Liquid code.) It’s also important to have experience collaborating on complex, multi-developer projects.\u003c/p\u003e\n\u003cp\u003eIt’s also a plus if you’ve ever worked with (or are comfortable building) Ruby on Rails apps -- we have a custom backend that powers a bunch of missing Shopify features, as well as supports our Product and Community teams’ internal processes; you’d periodically be helping ship features there, too. We typically operate on a one- to three-week sprint cycle, but are not overly dogmatic and prioritize opportunities to impact the business day-to-day.\u003c/p\u003e\n\u003cp\u003eRole \u0026amp; Responsibilities:\nThis is a fully-remote, full-time position. We’d start with a paid sample project, building a hypothetical new feature for our live storefront, as well as doing some brainstorming exercises around how you think about product. We’re mostly in LA and NYC, so at minimum you should be able to be available for a chunk of time during Eastern Time working hours. Ideally you’re someone who has always worked remotely, are comfortable communicating over Slack and email, and can self-manage your time and priorities.\u003c/p\u003e\n\u003cp\u003eRequired Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have 4+ years of web development experience in E-Commerce, with at least some Shopify experience\u003c/li\u003e\n\u003cli\u003eStrong JavaScript development skills and understanding of new ES6 concepts\u003c/li\u003e\n\u003cli\u003eExpert knowledge of CSS/SCSS and implementing web animations\u003c/li\u003e\n\u003cli\u003eExperience with integrating front-end frameworks like React with Shopify\u003c/li\u003e\n\u003cli\u003eKnowledge of build tools like Webpack and Babel for web performance and optimization.\u003c/li\u003e\n\u003cli\u003eStrong design instincts and enjoys working collaboratively with a team of designers\u003c/li\u003e\n\u003cli\u003eA commitment to creating readable, clean, and well documented code\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eVery Nice to Have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA website or a portfolio\u003c/li\u003e\n\u003cli\u003eExperience with Shopify Plus, Storefront API, GraphQL, and Ruby on Rails\u003c/li\u003e\n\u003cli\u003eExperience with headless architecture\u003c/li\u003e\n\u003cli\u003eExperience managing projects end to end\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits + Perks\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical, dental, and vision insurance\u003c/li\u003e\n\u003cli\u003eCompetitive compensation, including equity\u003c/li\u003e\n\u003cli\u003ePaid time off including Vacation PTO, Sick Leave, and Quarterly Company-wide Wellness Days\u003c/li\u003e\n\u003cli\u003eWFH setup stipend\u003c/li\u003e\n\u003cli\u003eCommuter benefits\u003c/li\u003e\n\u003cli\u003eEmployee discounts on Parade products\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eApply via Lever: \u003ca href=\"https://jobs.lever.co/ParadeInc/115b5c46-5880-427e-bd18-76618a89d2e7?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/ParadeInc/115b5c46-5880-427e-bd18-76618a89d2e7?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb21VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e1ac88258fbd6286ab8c24e4ebb39d803ae1f613/parade-logo.png"
  },
  {
    "id": "6bb39f1f-18a1-45ec-b985-696e2f5a698b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6bb39f1f-18a1-45ec-b985-696e2f5a698b",
    "created_at": "Tue Jan 05 15:03:07 UTC 2021",
    "company": "advalyze GmbH",
    "company_url": "https://www.advalyze.com/de/",
    "location": "Berlin",
    "title": "Marketing Data Engineer (m/w/d)",
    "description": "\u003cp\u003eadvalyze steht für analyze | advice | advertise\u003c/p\u003e\n\u003cp\u003eÜber 25 Digitalexperten aus den Bereichen Growth, Creative, MarTech und Reach helfen Startups, mittelständischen Unternehmen und Konzernen bei der Skalierung ihrer Geschäftsmodelle. Growth Marketing, Marketing Automation, Sales Automation, Lean Startup, A/B Tests – Digitalisierung wird bei advalyze gelebt und spannende Herausforderungen sind garantiert. Ganz nach unserem Motto „Dream big, get shit done, know how to have fun” suchen wir Leute mit derselben Hands-On-Attitude, die Spaß an ihrer Arbeit haben, sich einbringen und über ihren Tellerrand hinausschauen können. Spaß und eine sehr steile Lernkurve sind garantiert!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDEINE HERAUSFORDERUNG\u003c/p\u003e\n\u003cp\u003eWir suchen ab sofort einen Data Engineer (m/w/d), der für unsere Kunden die technische Infrastruktur der Datenerfassung und -verarbeitung aufbaut sowie in der datengetriebenen Analyse digitaler Marketingkampagnen berät. Zusätzlich unterstützt du uns mit deiner Kompetenz unsere eigenen Operations datengetrieben zu steuern.\u003c/p\u003e\n\u003cp\u003eDEINE AUFGABEN\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu übernimmst das Tracking und Monitoring unserer Kundenprojekte und unterstützt unsere Marketers mit Segmentierungen in unseren DMP, CDP, CRM, DWH und Marketing Automation Systemen.\u003c/li\u003e\n\u003cli\u003eDu bist für den Aufbau unseres eigenen MarTech-Stacks zur Datenanalyse verantwortlich und entwickelst ein Standard-Reporting-Framework mit relevanten KPI’s für unsere Kunden.\u003c/li\u003e\n\u003cli\u003eDu konzipierst und entwickelst unser DWH mit den Daten unserer Zeiterfassung, Finanzen, Sales etc. in Google Bigquery und wertest die Daten für die Businessplanung, People Analytics und das Client Reporting aus.\u003c/li\u003e\n\u003cli\u003eDu bereitest Daten und Reportings mit Hilfe von Visualisierungstools wie Google Data Studio, Looker, Chartio oder Power BI auf und kannst komplexe Zusammenhänge einfach erklären.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifikation\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu hast erste Berufserfahrung im Bereich Data und/oder Analytics eines digitalen Umfelds (z.B. Startup, Agentur, Beratung, digitaler PurePlayer etc.) sammeln können.\u003c/li\u003e\n\u003cli\u003eDu bist Experte in der Daten- und Prozessmodellierung und programmierst bereits einige Jahre in Python, SQL und idealerweise auch JavaScript.\u003c/li\u003e\n\u003cli\u003eDu verfügst über solide Kenntnisse im Web Tracking (z.B. Tag Manager, Google Analytics, Snowplow) und der Datenanalyse in einschlägigen Tools wie Google Data Studio, R, Power BI.\u003c/li\u003e\n\u003cli\u003eDu sprichst Deutsch und Englisch fließend.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDie Möglichkeit mit einem dynamischen Unternehmen zu wachsen und schnell viel Verantwortung zu übernehmen\u003c/li\u003e\n\u003cli\u003eEine unbefristete Anstellung mit attraktiver Vergütung\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten mit einer ehrlichen 40-Stunden-Woche und die Option auf Homeoffice\u003c/li\u003e\n\u003cli\u003eAgile Prozesse, flache Hierarchien und kurze Entscheidungswege Moderne, klimatisierte Büroräume in Berlin Weißensee mit sehr guter Anbindung an die öffentlichen Verkehrsmittel\u003c/li\u003e\n\u003cli\u003eBudget für deine persönliche Weiterbildung\u003c/li\u003e\n\u003cli\u003eRegelmäßige Teamevents wie ein Besuch im Freizeitpark, die Teilnahme am ToughMudder und eine jährliche Weihnachtsfeier\u003c/li\u003e\n\u003cli\u003eLust mit uns zu arbeiten? Dann klick auf den Button und bewirb dich jetzt. Nach Bewerbungseingang und sorgfältiger Prüfung melden wir uns innerhalb einer Woche bei dir.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWiebke Schmidt HR Managerin\u003c/p\u003e\n\u003cp\u003eUm die Gesundheit unserer MitarbeiterInnen und BewerberInnen zu gewährleisten, ist unser Interviewprozess aktuell zu 100% remote.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://advalyze.join.com/jobs/1749662-marketing-data-engineer-m-w-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=marketing%2Bdata%2Bengineer%2Bm%2Bw%2Bd\"\u003ehttps://advalyze.join.com/jobs/1749662-marketing-data-engineer-m-w-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=marketing%2Bdata%2Bengineer%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0dVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--583d3f4280cc871761f21cb44456105918a5dbb7/advalyze_Logo_Rz-2-e1597052637998.png"
  },
  {
    "id": "912fc53b-1b7f-427a-bc69-25f03b597f8c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/912fc53b-1b7f-427a-bc69-25f03b597f8c",
    "created_at": "Fri Oct 30 15:33:27 UTC 2020",
    "company": "Defendify",
    "company_url": "https://www.defendify.io/",
    "location": "Portland, ME (Remote OK)",
    "title": "Senior Full Stack Developer",
    "description": "\u003cp\u003eThanks for your interest in working with us! Defendify is a fast-growing, fun-loving cybersecurity startup with a small, vibrant team based in Portland, Maine. Resourcefulness, responsiveness, problem-solving, and simplicity are values that shape who we are, what we do, and how we deliver amazing customer experiences.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePosition Details\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe're looking for a senior level full stack developer to join us full-time, locally and/or in a remote capacity. This is a unique and exciting opportunity as we continue to expand the footprint of our groundbreaking, all-in-one cybersecurity platform. Every team member is a valuable contributor to our core SaaS product with day-to-day responsibilities covering a variety of development needs including building, maintaining, QA, and support for every aspect of the Defendify platform.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe are looking for a team player who:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHas a passion for solving problems and is eager to grow, learn, and tackle daily and long-term challenges and goals.\u003c/li\u003e\n\u003cli\u003eWill dig in and ask questions from users to understand requirements; make a plan; dive into an existing codebase and learn where to make changes, or where to start new code.\u003c/li\u003e\n\u003cli\u003eIs a good communicator who enjoys collaboration and thrives in a development culture that values clean code, automation and testability.\u003c/li\u003e\n\u003cli\u003eMaintains excellent knowledge of how modern web applications work, including REST API usage, application security, cloud deployment and development best practices.\u003c/li\u003e\n\u003cli\u003eIs comfortable self-directing their own work. No micro-management here!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements – Experience\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of Full-Stack Development experience\u003c/li\u003e\n\u003cli\u003eHas been responsible for the entire lifecycle of code in at least one project, from scratch to QA to deployment to maintenance.\u003c/li\u003e\n\u003cli\u003eHas experience implementing a RESTful API and an application which consumes it.\u003c/li\u003e\n\u003cli\u003eIs familiar with the philosophy and implementation of development automation: tests, continuous integration, cloud deployment, and frequent production releases using an Agile/SCRUM process.\u003c/li\u003e\n\u003cli\u003eDevOps experience is a plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements – Technical\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperienced in JavaScript including ES6, await/async, linting and front-end frameworks. We use libraries and frameworks as needed, but you need to be able to write and understand plain JS.\u003c/li\u003e\n\u003cli\u003eExperience with Node and Browser based environments is required.\u003c/li\u003e\n\u003cli\u003eUnderstand REST APIs and their role in application architectures.\u003c/li\u003e\n\u003cli\u003eExperience with front end development: HTML, CSS, and familiarity with the ecosystem of related technologies (SASS, DOM). In addition, Vue (or similar framework) experience and knowledge of static site generators such as Jekyll/Hugo are helpful.\u003c/li\u003e\n\u003cli\u003eUnderstand how to use Git(+Hub) and GitHub Flow.\u003c/li\u003e\n\u003cli\u003eSome relational database experience is needed. Pluses include: Experiences in relational and in-memory databases (MySQL, Postgres, Redis) as well as knowledge in generic SQL.\u003c/li\u003e\n\u003cli\u003eSome experience with Amazon Web Services (AWS), Heroku, or similar services.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Success\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are not alone in your role – Defendify's development team is made up of \"A\" players dedicated to your training and success. We thrive on an open-door policy and transparent management system that fosters team collaboration.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation and Benefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is a flexible position open to candidates with varying levels of experience and offers long term growth potential via a well-defined career path. Compensation is competitive and commensurate with experience, and is variable based on personal and team performance. Our benefits package is comprehensive and includes health, dental, and vision coverage, educational reimbursement, a 401(k) program, paid time-off and more.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLove What You Do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDefendify employees enjoy a modern work environment and culture where everyone genuinely cares about the work they do. We're passionate about our product, the problems we're solving, our customers, our partners, and our team. We're in it together, enjoying work and play every day from team lunches, impromptu social outings and celebrations, and charity missions. And yes, there is coffee, lots and lots of coffee!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpportunity Knocks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis position offers a great opportunity to make an impact as a part of a small team solving big problems, making cybersecurity possible for Small Business. Are you a creative self-starter with an appetite to learn and grow? If so, we'd love to hear from you!\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply now at \u003ca href=\"https://defendify.breezy.hr/p/267bbae0c690-senior-full-stack-developer\"\u003ehttps://defendify.breezy.hr/p/267bbae0c690-senior-full-stack-developer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBblNOIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a2730d55401adcd2e1832cebe43cc72f28ecbf83/Defendify_grey_R.png"
  },
  {
    "id": "b003b45c-6abb-4206-8a5c-171c6efb7d00",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/b003b45c-6abb-4206-8a5c-171c6efb7d00",
    "created_at": "Tue Jan 05 12:09:20 UTC 2021",
    "company": "dirico",
    "company_url": "https://dirico.io/",
    "location": "Koblenz",
    "title": "Fullstack Developer (m/w/d)",
    "description": "\u003cp\u003eWir sind die 247GRAD Labs GmbH, das IT-Unternehmen hinter dirico, der All-in-one-Plattform für Kommunikations- und Marketingteams.\u003c/p\u003e\n\u003cp\u003edirico unterstützt Unternehmen weltweit dabei, ihren Content besser zu planen, zu erstellen und zu veröffentlichen als jemals zuvor. Das macht unsere Kunden so glücklich, dass sie dirico bereits in über 20 Ländern einsetzen. Unser Kundenkreis wächst stetig und beinhaltet einige der Top-50-Unternehmen Deutschlands.\u003c/p\u003e\n\u003cp\u003eDeshalb suchen wir Dich als Unterstützung für unser Team in Koblenz und Oradea (Rumänien).\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://t3u1.mjt.lu/lnk/AMoAAJAQ2_8AAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBf9E3hBOk8hPn6TLWSxTHCe0ChBAAGCXo/2/vrL58i3wIjjrjnoVeddf-g/aHR0cHM6Ly9kaXJpY28uaW8vdWViZXItdW5zLw\"\u003eErfahre mehr über uns und wirf einen Blick hinter die Kulissen.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDas sind deine Aufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNeu- und Weiterentwicklung unserer Softwarelösung mit den Schwerpunkten C#, .NET, React und Angular\u003c/li\u003e\n\u003cli\u003eErstellung von Systemarchitektur und Softwaredesign\u003c/li\u003e\n\u003cli\u003eAktive Mitgestaltung der Infrastruktur und eingesetzten Prozesse im Entwicklungsteam\u003c/li\u003e\n\u003cli\u003eEinsatz und Test modernster Praktiken und Umsetzung neuer Ideen\u003c/li\u003e\n\u003cli\u003eEvaluierung und Auswahl neuer Technologien für die Nutzung in der Entwicklung\u003c/li\u003e\n\u003cli\u003eZusammenarbeit in einem international agierenden Umfeld von Entwicklungsteams\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas solltest Du mitbringen\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSehr gute Kenntnisse in .NET und C#\u003c/li\u003e\n\u003cli\u003eKenntnisse in mindestens einem der JavaScript-Frameworks wie React, Angular oder Vue.js\u003c/li\u003e\n\u003cli\u003eErfahrungen mit TypeScript, HTML und CSS sind gerne gesehen\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse im Bereich von relationalen Datenbanken/SQL, Design Pattern sowie gängigen Frameworks (z.B. EF)\u003c/li\u003e\n\u003cli\u003eOptimalerweise bringst du Erfahrungen zu Schnittstellen von Social-Media-Plattformen mit\u003c/li\u003e\n\u003cli\u003eSicherer Umgang mit objektorientiertem Code, UML und Design Patterns\u003c/li\u003e\n\u003cli\u003eScrum, Git und Clean Code sind keine Fremdwörter, sondern alte Bekannte\u003c/li\u003e\n\u003cli\u003eSehr gute Kenntnisse der deutschen und der englischen Sprache\u003c/li\u003e\n\u003cli\u003eEine analytische und strukturierte Arbeitsweise, Zuverlässigkeit und Lösungskompetenz zeichnen dich aus, messbare Ergebnisse sind Dir wichtig\u003c/li\u003e\n\u003cli\u003eDu bist bereit, dich weiterzuentwickeln und neuen Herausforderungen zu stellen\u003c/li\u003e\n\u003cli\u003eErfahrungen mit der Azure Plattform runden Dein Profil ab\u003c/li\u003e\n\u003cli\u003eSelbstständige Arbeitsweise\u003c/li\u003e\n\u003cli\u003eDu bist engagiert und hast Interesse daran, Dich mit Deiner Meinung aktiv im Team einzubringen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas erwartet dich bei uns\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEin innovatives Softwareprodukt im spannenden Marketing-Kontext\u003c/li\u003e\n\u003cli\u003eRenommierte Referenzkunden wie ThyssenKrupp, Lanxess, WetterOnline, R+V, Dr. Oetker, Sport2000 und viele mehr\u003c/li\u003e\n\u003cli\u003eEin stark wachsendes und motiviertes Team mit Weltklasse-Kollegen\u003c/li\u003e\n\u003cli\u003eAbwechslungsreiche und anspruchsvolle Aufgaben, die Spaß machen\u003c/li\u003e\n\u003cli\u003eEchte Start-up-Atmosphäre in einem mittelständischen Unternehmen\u003c/li\u003e\n\u003cli\u003eFlache Hierarchien und schnelle Entscheidungswege für Deine kreativen Ideen\u003c/li\u003e\n\u003cli\u003eAgile Arbeitsprozesse und modernste Hardware\u003c/li\u003e\n\u003cli\u003eEin jährliches Weiterbildungsbudget zur Unterstützung Deiner fachlichen und persönlichen Weiterentwicklung\u003c/li\u003e\n\u003cli\u003eFlexible Vertrauensarbeitszeit in Gleitzeit\u003c/li\u003e\n\u003cli\u003eDie Möglichkeit auf Homeoffice nach Absprache\u003c/li\u003e\n\u003cli\u003eErgonomisches Arbeitsumfeld mit höhenverstellbaren Tischen und rückenschonenden Stühlen\u003c/li\u003e\n\u003cli\u003eZuschuss zum Premium-Fitnessstudio Danys\u003c/li\u003e\n\u003cli\u003eRegelmäßige Teamevents\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge\u003c/li\u003e\n\u003cli\u003eFrisches Obst, Kaffeevariationen und Wasser for free\u003c/li\u003e\n\u003cli\u003eKein Dresscode – wir wollen, dass Du dich wohlfühlst, also: come as you are\u003c/li\u003e\n\u003cli\u003eUnsere Bürohunde sind ausgebildete Feelgood-Manager\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/2c6be01ea691c2ce642d9d67af9c220690ea857a/68747470733a2f2f742e676f686972696e672e636f6d2f682f61353530396230363535633464323339623366666165373563323732366135363632623963633034303638313937336635376461386463636135343734323136\"\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/c5a40ff4193b71eca19e915c274117af6c2052975787abf3de0ec28707a69775\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmlVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6c0b3a4b1af8460136574669056b869a55cd7205/dirico.png"
  },
  {
    "id": "6d3173e8-15bb-46b0-b24d-7bbc6d8def32",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6d3173e8-15bb-46b0-b24d-7bbc6d8def32",
    "created_at": "Tue Jan 05 07:52:00 UTC 2021",
    "company": "Construyo",
    "company_url": "https://construyo.de",
    "location": "Berlin",
    "title": "Senior Javascript Developer",
    "description": "\u003cp\u003eBeing one of the biggest industries in Germany and the world, construction failed to take advantage of the new opportunities offered by digitalization.\u003c/p\u003e\n\u003cp\u003eConstruyo offers a project management tool that connects the architecture, engineering and real estate, the goal is to increase transparency and optimize stakeholders by applying the latest technologies in order to support and implement projects efficiently.\u003c/p\u003e\n\u003cp\u003eWe are a growing startup with the mission to shape the construction industry in a new and future-oriented way. To meet our ambitious product roadmap we are looking for a Senior JavaScript Developer to join our team located in the Berlin. You will be part of an agile and talented team that applies the newest technologies across all domains of our product.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSupporting our Tech team in executing our product roadmap both front and back.\u003c/li\u003e\n\u003cli\u003eDiscovering and implementing new technologies that yield competitive advantage.\u003c/li\u003e\n\u003cli\u003eMaintaining and improving our JavaScript tech stack, primarily using NodeJS and React.\u003c/li\u003e\n\u003cli\u003eImproving our infrastructure built on Firebase, Google Cloud, Salesforce and Heroku to name a few.\u003c/li\u003e\n\u003cli\u003eContributing to the development of our product vision.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou should be a team player with a keen eye for detail and problem-solving skills with experience in Agile frameworks, and deep knowledge in both front-end and back-end.\u003c/li\u003e\n\u003cli\u003e5 years + hands-on experience in JavaScript (NodeJS \u0026amp; React), in maintaining and developing a digital product.\u003c/li\u003e\n\u003cli\u003eA sharp thinker who can leverage all information available at Construyo to define strategies and creative solutions.\u003c/li\u003e\n\u003cli\u003eSomeone who thrives in agile environments where feedback exchange is constant, being capable of giving and receiving.\u003c/li\u003e\n\u003cli\u003eA curious and passionate professional who can go beyond the expectations. Who leans into action, capable of making decisions and that seeks autonomy.\u003c/li\u003e\n\u003cli\u003eSomeone committed to develop the best work experience of their career and who will add to our incredible culture.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Construyo, our most valuable resource is our people - with a diversity of backgrounds, ideas and life experiences. We hire smart and creative professionals that have demonstrated excellence through their skills and character.\u003c/p\u003e\n\u003cp\u003eEmployees are more than just coworkers, our dynamic company culture encourages meaningful interactions between colleagues. We face challenges together and we celebrate together; our work environment is vibrant!\u003c/p\u003e\n\u003cp\u003eWe offer all of the perks of Berlin startups: team events, urban sports, beer fridays and much more! All in an office located in the heart of Europe´s most exciting capital.\nMore importantly, we are helping people living in a home that they love. Data shows that in Germany alone the time spent at home increased by up to 17% due to the pandemic. Thus, living in an environment that feels like home is more important than ever!\u003c/p\u003e\n\u003cp\u003eCome Build with us!\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://construyo.join.com/jobs/1751035-senior-javascript-developer?pid=\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bjavascript%2Bdeveloper\"\u003ehttps://construyo.join.com/jobs/1751035-senior-javascript-developer?pid=\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bjavascript%2Bdeveloper\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbkdVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bc02aa9af48683beb8ce22c1b4126a7fa3f00012/construyo-logo-l.png"
  },
  {
    "id": "903ceca2-52e9-443c-a639-b2f032204589",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/903ceca2-52e9-443c-a639-b2f032204589",
    "created_at": "Mon Jan 04 17:49:33 UTC 2021",
    "company": "Spanflug Technologies GmbH",
    "company_url": "https://spanflug.de/",
    "location": "Munich",
    "title": "Software Engineer – Web (Python, React.js)",
    "description": "\u003cp\u003eSpanflug is a Munich-based start-up running an online-platform for custom manufactured parts.\nThe user can upload the CAD-Model of the part they want to have manufactured and our algorithm then analyses the CAD file and calculates an instant price quote. If the customer submits the order, we broker it to our network of suppliers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDescription\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for an experienced, self-driven and conscientious full-stack web-developer with experience in React.js and Python to complement our small web-development (and devops) team.\u003c/p\u003e\n\u003cp\u003eThe responsibilities of the web-development team are extremely diverse and include among others designing the software-architecture, developing specific customer-facing features, automating our own internal processes, integrating external services, designing APIs, and dev-ops activities in order to ensure smooth deployments and reliable service.\u003c/p\u003e\n\u003cp\u003eOur web-team works in close collaboration with our algorithm and marketing/sales/operations teams and is therefore involved in the full product lifecycle. We work in very short product iteration cycles based on a GitHub-workflow so that contributions will usually be deployed immediately after completion.\u003c/p\u003e\n\u003cp\u003eOur web-stack currently includes the following technologies:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReact.js / Redux / Semantic UI\u003c/li\u003e\n\u003cli\u003eFlask\u003c/li\u003e\n\u003cli\u003ePostgreSQL\u003c/li\u003e\n\u003cli\u003eRedis\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop, test and deploy new frontend and backend features for the spanflug web-platform\u003c/li\u003e\n\u003cli\u003eDesign and implement APIs\u003c/li\u003e\n\u003cli\u003eIntegrate external services\u003c/li\u003e\n\u003cli\u003eContribute to the design and software architecture of the spanflug web-platform\u003c/li\u003e\n\u003cli\u003eSet up and manage server infrastructure\u003c/li\u003e\n\u003cli\u003ePerform deployments and ensure smooth operations\u003c/li\u003e\n\u003cli\u003ePractice test-driven development\u003c/li\u003e\n\u003cli\u003eCollaborate closely with our algorithm team to ensure ensure timely and seamless deployment of algorithm updates\u003c/li\u003e\n\u003cli\u003eCollaborate closely with our sales/marketing and customer success team in order to help define new requirements\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s and/or Master’s degree in computer science or equivalent qualifications\u003c/li\u003e\n\u003cli\u003e3+ years of relevant industry experience\u003c/li\u003e\n\u003cli\u003eExcellent Python and Javascript skills and experience collaborating on larger projects\u003c/li\u003e\n\u003cli\u003eExperience with React.js\u003c/li\u003e\n\u003cli\u003eExperience with Dev-Ops and basic Linux system administration\u003c/li\u003e\n\u003cli\u003eExperience working with relational databases\u003c/li\u003e\n\u003cli\u003eA good understanding of web-technologies\u003c/li\u003e\n\u003cli\u003eA good grasp of security best-practices and common vulnerabilities\u003c/li\u003e\n\u003cli\u003eExperience with CI/CD development workflows\u003c/li\u003e\n\u003cli\u003eProficiency with git and Docker\u003c/li\u003e\n\u003cli\u003eExcellent communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy Spanflug?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGreat office location in the centre of Munich near the Sendlinger Tor\u003c/li\u003e\n\u003cli\u003e30 vacation days\u003c/li\u003e\n\u003cli\u003eFlexible workhours\u003c/li\u003e\n\u003cli\u003eBudget for conferences and trainings\u003c/li\u003e\n\u003cli\u003eSubsidised lunches\u003c/li\u003e\n\u003cli\u003eFree snacks and drinks\u003c/li\u003e\n\u003cli\u003eFriday afternoon „mini-hackathons“\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/b18f10a8003ec3431cfbf1879837ae811e9bea4e/68747470733a2f2f742e676f686972696e672e636f6d2f682f31383935303630373832613464376637613337333262633339306434373138363634656230323962626235646430336564333961613938336561353232306664\"\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/c4c8e633cec4d8e537966a0542eb18263c8990f86810ab57973dfafe6edc9bce\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbStVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--169cc427b5cf198a85f76614e526e9d6677e034e/Spanflug%20Technologies%20GmbH.png"
  },
  {
    "id": "703a5132-4062-42d8-bb80-3a08ddbc8f94",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/703a5132-4062-42d8-bb80-3a08ddbc8f94",
    "created_at": "Mon Jan 04 15:39:16 UTC 2021",
    "company": "neubau kompass AG",
    "company_url": "https://www.neubaukompass.de/",
    "location": "Munich",
    "title": "Senior Frontend Developer (m/w/d)",
    "description": "\u003cp\u003eneubau kompass ist nicht umsonst eine der bekanntesten Online-Plattformen für Neubau-Wohnimmobilien. Wir sind so erfolgreich, weil wir nie stehen bleiben und unsere Leistungsqualität immer wieder auf den Prüfstand stellen und verbessern. Unsere Mitarbeiter wissen, dass wir ihnen viel zutrauen. Wir schätzen sie nicht nur als Fachkräfte, sondern auch als Menschen.\u003c/p\u003e\n\u003cp\u003eWir arbeiten mit flachen Hierarchien, bieten spannende Karrieremöglichkeiten sowie eine faire Bezahlung. Unser guter Teamgeist wird von unseren Werten getragen: Engagement, Empathie, Teamgeist und der Willen, sich fachlich weiterzuentwickeln.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEinleitung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSie haben Spaß am Erstellen von Web-Designs, Blog-Designs und nutzerfreundlichen Website-Elementen wie Formularen oder Listenansichten? Sie sind sicher im Umgang mit HTML und CSS und JS? Bewerben Sie sich bei neubau kompass! Für unseren Standort in München suchen wir zum nächstmöglichen Termin eine(n) engagierte(n) \u003cstrong\u003eSenior Frontend Developer (m/w/d)\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDiese Aufgaben erwarten Sie bei uns\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFrontend-Entwicklung unseres Immobilien-Portals\u003c/li\u003e\n\u003cli\u003eOptimierung unserer Plattform für verschiedene Endgeräte\u003c/li\u003e\n\u003cli\u003eUmsetzung und Ausarbeitung von Screendesigns in HTML und CSS und JavaScript\u003c/li\u003e\n\u003cli\u003eVerbesserung von Usability und Micro-Interactions\u003c/li\u003e\n\u003cli\u003eBeratung und Unterstützung bei der Erstellung von Konzepten und Lösungen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas bringen Sie mit\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIdealerweise Studium oder Ausbildung im Bereich  Informatik, Web-Entwicklung oder vergleichbare Qualifikation\u003c/li\u003e\n\u003cli\u003eMindestens 3 Jahre Berufserfahrung\u003c/li\u003e\n\u003cli\u003eSehr gute Kenntnisse in HTML5, CSS3, Bootstrap, Tailwind, JS und JQuery\u003c/li\u003e\n\u003cli\u003eErfahrung mit gulp, sass, less, composer, node.js und anderen modernen Frameworks\u003c/li\u003e\n\u003cli\u003eErfahrung mit GIT\u003c/li\u003e\n\u003cli\u003eGute PHP Skills\u003c/li\u003e\n\u003cli\u003eEine eigenständige und lösungsorientierte Arbeitsweise, Teamfähigkeit, Kommunikationsstärke\u003c/li\u003e\n\u003cli\u003eQualitätsbewusstsein, eigenverantwortliches Arbeiten und Lösen von Problemstellungen\u003c/li\u003e\n\u003cli\u003eEine hohe Motivation und Auffassungsgabe sowie ein schnelles Umsetzungsvermögen\u003c/li\u003e\n\u003cli\u003eBelastbarkeit, auch unter Zeitdruck\u003c/li\u003e\n\u003cli\u003eGrundkenntnisse in Englisch\u003c/li\u003e\n\u003cli\u003eErfahrung mit UX, Customer Journey und Conversion-Optimierung\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas bieten wir Ihnen\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFestanstellung in Vollzeit\u003c/li\u003e\n\u003cli\u003eFaire Bezahlung\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten\u003c/li\u003e\n\u003cli\u003eMöglichkeit im Homeoffice zu arbeiten\u003c/li\u003e\n\u003cli\u003eUnterstützung bei der fachlichen Weiterbildung\u003c/li\u003e\n\u003cli\u003eRaum für Eigeninitiative und spannende Aufgaben\u003c/li\u003e\n\u003cli\u003eModerne und hochwertige Büroräume\u003c/li\u003e\n\u003cli\u003eMac oder Windows Notebook\u003c/li\u003e\n\u003cli\u003eKurze Kommunikationswege\u003c/li\u003e\n\u003cli\u003eEin angenehmes Arbeitsklima\u003c/li\u003e\n\u003cli\u003eKompetente, hilfsbereite und engagierte Kollegen\u003c/li\u003e\n\u003cli\u003eKostenlose Getränke: (Milch-)Kaffee, Tee, Mineralwasser\u003c/li\u003e\n\u003cli\u003eHervorragende Anbindung an den MVV\u003c/li\u003e\n\u003cli\u003eKostenfreie Parkplätze\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eMöchten Sie Teil unseres engagierten Teams werden?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDann senden Sie uns Ihre aussagekräftige Bewerbung (inkl. Anschreiben und CV im PDF-Format) über unser Bewerberportal. Bitte geben Sie den frühestmöglichen Eintrittstermin sowie Ihre Gehaltsvorstellungen an!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/75b21d34340386254b0d84efe7f06440fbc7666e/68747470733a2f2f742e676f686972696e672e636f6d2f682f35616235633739313661353163666563386663316264643334393038303934393138333634383863396638393837666438343563353832376436356561623566\"\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/4935a92404e4fc8c87eba02ca6471a9b6c54e9e19a8bed0dd9cd5900fac1e60a\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTJVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9d83c8393c731ec15b17323991c15b980314999f/neubau%20kompass%20AG.png"
  },
  {
    "id": "1f0bc6cd-6347-48a1-8754-98b09c264cf2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/1f0bc6cd-6347-48a1-8754-98b09c264cf2",
    "created_at": "Mon Jan 04 13:58:41 UTC 2021",
    "company": "Superside",
    "company_url": "https://www.superside.com",
    "location": "Remote",
    "title": "Frontend Engineer (React/NextJS)",
    "description": "\u003cp\u003eSuperside is looking for a talented, driven and ambitious Frontend Engineer to join our talented growing team.\u003c/p\u003e\n\u003cp\u003eWe are growing fast and need help to build our product into a great design platform that includes project  management features, real time chat, staffing, file annotation and more.\u003c/p\u003e\n\u003cp\u003eWork from wherever you want with a highly competitive salary, responsibility from day one and exciting learning opportunities.\u003c/p\u003e\n\u003cp\u003eWHAT YOU’LL DO\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplement the features and user interfaces of the internal Superside app (Superspace) like the Superchat and the staffing system\u003c/li\u003e\n\u003cli\u003eArchitect efficient and reusable front-end systems that drive complex web applications\u003c/li\u003e\n\u003cli\u003eCollaborate with Product Designers, Product Managers, and Software Engineers to deliver compelling user-facing products\u003c/li\u003e\n\u003cli\u003eIdentify and resolve performance and scalability issues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWHAT YOU’LL NEED TO SUCCEED\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with React and Node.js\u003c/li\u003e\n\u003cli\u003eHTML/CSS experience, including concepts like layout, specificity, cross-browser compatibility, and accessibility\u003c/li\u003e\n\u003cli\u003eJavaScript experience, including concepts like asynchronous programming, closures, types, and ES6.\u003c/li\u003e\n\u003cli\u003eExperience with browser APIs and optimizing front end performance\u003c/li\u003e\n\u003cli\u003eExcellent communication skills in English\u003c/li\u003e\n\u003cli\u003eHard-working team player\u003c/li\u003e\n\u003cli\u003eFast and stable internet connection\u003c/li\u003e\n\u003cli\u003eBS/MS in Computer Science or a related technical field preferred\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eABOUT SUPERSIDE\u003c/p\u003e\n\u003cp\u003eSuperside is a remote future-of-work startup that delivers great design at scale to global brands 24/7 — from everyday production work to large-scale strategic design solutions. By building workflow technology and an instant and fully-managed process, Superside makes design hassle-free for customers like Facebook, Redbull, Puma, Amazon, Salesforce, Cisco, HP, Twitch, Airbus, L'Oreal, Tiffany \u0026amp; Co. and more. Superside is backed by Y Combinator, Slack Fund, Freestyle Capital and High Alpha Capital. We're a fully distributed team of ex tier one agency designers and project managers located all around the world, spanning 58 countries and 19 timezones.\u003c/p\u003e\n\u003cp\u003eMission: Create more equal economic opportunities globally\u003c/p\u003e\n\u003cp\u003eVision: We find and grow the world’s best creative talent\u003c/p\u003e\n\u003cp\u003eWHY JOIN US\u003c/p\u003e\n\u003cp\u003eWe are a global community with people across 58 countries\nBe part of a highly talented tech team, and work with people with background in Spotify, Yandex and Booking.com\nCompetitive salary with the potential for earning equity in the company\nWe function in a trusting environment while seeking the truth in an ego-free manner\nPioneering the remote future of work with a fair, meritocratic and supportive community\nDisrupting a massive global industry with a huge market opportunity\nPaid vacation\u003c/p\u003e\n\u003cp\u003eTECHNICAL STACK\u003c/p\u003e\n\u003cp\u003eFrontend\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eNodeJS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLambda Edge\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eNext.js/ React\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStyled Components\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eTypescript\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSanity Headless CMS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBackend\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eJava/Kotlin\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSpring Boot 2\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHibernate/ AWS RDS / MySql\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eRedisson/Redis\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eJunit for testing\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eElasticSearch\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInfrastructure\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTerraform\u003c/li\u003e\n\u003cli\u003eAWS SQS/SNS, ECS, Cloudfront, Route53,  EC2, S3, WAF, PageDuty, ParameterStore, ALB\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eJenkins\u003c/li\u003e\n\u003cli\u003ePusher\u003c/li\u003e\n\u003cli\u003eMailgun\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf you think Superside is the right place for you, get in contact!\u003c/p\u003e\n\u003cp\u003ePlease note that we receive many applications for this position and reply times will therefore vary. We screen applications continuously and will reach out to you as soon as we can after you have completed the assessments.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eSubmit here: \u003ca href=\"https://superside.vervoe.net/job-page/frontend-engineer-full-time-remote/50bd7a7c-7354-4c7d-bb8d-02ef2a702832\"\u003ehttps://superside.vervoe.net/job-page/frontend-engineer-full-time-remote/50bd7a7c-7354-4c7d-bb8d-02ef2a702832\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbU9VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--062afe27ff39c811c45fb63c1c56145fca8490c5/last%20ned%20(2).jpeg"
  }
]
