[
  {
    "id": "21135644-ddee-4259-8370-6759d9915168",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/21135644-ddee-4259-8370-6759d9915168",
    "created_at": "Thu Jan 21 14:52:51 UTC 2021",
    "company": "G-Research",
    "company_url": "https://www.gresearch.co.uk/",
    "location": "London, UK",
    "title": "Full Stack Software Engineer (C#/Angular)",
    "description": "\u003cp\u003eG-Research is Europe's leading quantitative finance research firm. We hire the brightest minds in the world to tackle some of the biggest questions in finance. We pair this expertise with machine learning, big data, and some of the most advanced technology available to predict movements in financial markets.\u003c/p\u003e\n\u003cp\u003eSoftware Engineering is core to our business. By designing and implementing real-time systems, our engineers are solving some of the world's most complex financial problems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Trading Platform Services Engineering group at G-Research consists of more than a dozen Software Engineers, and we are seeking additional engineers to join us. We are a customer-centric Engineering team working closely with our clients, with a strong focus on UX. Many of our projects involve working with other Engineering teams, making this an excellent opportunity to gain a good understanding of the business and trading platform.\u003c/p\u003e\n\u003cp\u003eWe are building cutting-edge systems to allow our clients to monitor and manage a complex platform in realtime. This includes platform configuration and release management for tens of thousands of trading services, and realtime processing of data streamed from systems all over the world. We leverage the latest technologies such as Kafka and Kubernetes to address the huge scale of the problems we are solving.\u003c/p\u003e\n\u003cp\u003eOur engineers are encouraged to take ownership of projects and deliver the best results using whichever technologies and methodologies they and the team see fit.\u003c/p\u003e\n\u003cp\u003eKey responsibilities of the role include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking in an agile, self-organising environment to develop full-stack web applications, with an emphasis on software engineering principles, effective UX, and polished UI design\u003c/li\u003e\n\u003cli\u003eIntegrating with trading platform components via a variety of mechanisms, e.g. REST APIs, Kafka\u003c/li\u003e\n\u003cli\u003eLiaising directly with customers to scope out, design and iterate on solutions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho are we looking for?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe ideal candidate will be an intelligent, passionate and creative software engineer with a proven ability to develop and deliver high-quality software. They will have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent OO programming skills, ideally in C# (or Java)\u003c/li\u003e\n\u003cli\u003eExperience with a frontend technology, e.g. Angular\u003c/li\u003e\n\u003cli\u003eA proven track record of full-stack engineering\u003c/li\u003e\n\u003cli\u003eExcellent communication skills\u003c/li\u003e\n\u003cli\u003eA self-starting attitude\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAdvantageous experience and skills include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with modern JavaScript frameworks and PWAs\u003c/li\u003e\n\u003cli\u003eUnderstanding of CI/CD principles and implementation, e.g. Jenkins\u003c/li\u003e\n\u003cli\u003eExposure to an agile and collaborative team environment\u003c/li\u003e\n\u003cli\u003eExperience with containers and cloud-native technologies, e.g. Docker, Kubernetes, Prometheus, .NET Core\u003c/li\u003e\n\u003cli\u003eExperience with messaging middlewares and stream processing technologies, e.g. Kafka\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy should you apply?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHighly competitive compensation plus annual discretionary bonus\u003c/li\u003e\n\u003cli\u003eInformal dress code and excellent work/life balance\u003c/li\u003e\n\u003cli\u003eComprehensive healthcare and life assurance\u003c/li\u003e\n\u003cli\u003e25 days holiday\u003c/li\u003e\n\u003cli\u003e9% company pension contributions\u003c/li\u003e\n\u003cli\u003eCycle-to-work scheme\u003c/li\u003e\n\u003cli\u003eSubsidised gym membership\u003c/li\u003e\n\u003cli\u003eMonthly company events\u003c/li\u003e\n\u003cli\u003eCentral London office close to 5 stations and 6 tube lines\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eApply on our website at \u003ca href=\"https://www.gresearch.co.uk/role/R524-Full-Stack-Software-Engineer/\"\u003ehttps://www.gresearch.co.uk/role/R524-Full-Stack-Software-Engineer/\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9326763f3832955eb1dbfa169a9842e8e447633b/logo.jpg"
  },
  {
    "id": "dcf7cacf-ac39-4e6e-a5df-83135f69cff0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/dcf7cacf-ac39-4e6e-a5df-83135f69cff0",
    "created_at": "Wed Jan 20 14:03:36 UTC 2021",
    "company": "whynow",
    "company_url": "https://whynow.co.uk/",
    "location": "London",
    "title": "Full Stack Developer / WooCommerce Wizard",
    "description": "\u003cp\u003ewhynow is a new arts and culture digital platform promoting personal, powerful and positive stories in the capital and beyond.\u003c/p\u003e\n\u003cp\u003eAs a subscription platform, members of whynow get access to a growing range of videos, articles, podcasts and more.  We are looking for a woocommerce wizard who will work with us and be responsible for the maintenance and growth of both our frontend checkout system, built in React and the accompanying custom woocommerce extensions written in PHP running on our headless CMS.\u003c/p\u003e\n\u003cp\u003eThis position requires full stack programming skills in the following technologies: (Woocommerce, React, PHP, SQL, writing tests). The candidate should have a strong understanding of woocommerce and wordpress as a content management system. Although this is a focused position the ideal candidate should have a good grasp on the entire web development process from UX design through to development, testing and deployment. The candidate would need to have the ability to follow and track issues, write code and test changes on both the frontend and backend of our checkout system.\u003c/p\u003e\n\u003cp\u003eAs we are a young company in constant evolution our long term goal for this role would also be to facilitate moving away from the dependency on woocommerce at scale. This would involve consultancy on the alternative e-commerce packages available and working on the migration itself which would involve some nifty script writing and SQL query abilities.\nResponsibilities\nDeveloping and optimising the overall frontend checkout process\nDeveloping and maintaining the backend of the checkout\nMonitoring woocommerce version updates and addressing breaking changes\nBuild on and develop and test our coupon and promotional systems\nWrite tests for edge cases to catch potential bugs on checkout\nTroubleshooting customer subscription reporting that feeds into google analytics and hubspot\nConsulting and research on viable ecommerce platform alternatives\nFacilitating potential migration to another CMS and ecommerce platform at scale\nWorking on the development of new ecommerce features such as a store\u003c/p\u003e\n\u003cp\u003eSkills Required\nComplete understanding of web development basics:\nHTML5\nCSS3\nJavaScript\nStrong understanding of the woocommerce platform and some experience developing in this environment\nSolid understanding of development in the following web technologies relevant to our stack:\nReact\nPHP\nSQL\nExperience developing fully responsive ecommerce websites and applications\nComfortable working with chrome inspector debugging tools\nKnowledge of headless cms architecture and how to interact with RESTful APIs and data in JSON format\nProficient working knowledge of git version control\nStrong understanding of PHP development and wordpress\u003c/p\u003e\n\u003cp\u003ePLEASE NOTE:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eThis is a programming job. You MUST have 4+ years experience in web and software development technology.\u003c/li\u003e\n\u003cli\u003eYou MUST have experience in woocommerce or have completed some online training in this platform to be considered for this role.\u003c/li\u003e\n\u003cli\u003eYou MUST be in London and able to come into the office and work on location.\u003c/li\u003e\n\u003cli\u003eYou MUST be fluent in English.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eSalary competitive\nHoliday standard\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease email your CV and a cover letter to me at \u003ca href=\"mailto:connor@whynow.co.uk\"\u003econnor@whynow.co.uk\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1NXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--65a93ab1c962ad69d2724d5791201cb0f2377646/whynow-login-logo.png"
  },
  {
    "id": "145d3951-2bf2-45ab-a1ce-1c93095672a5",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/145d3951-2bf2-45ab-a1ce-1c93095672a5",
    "created_at": "Tue Jan 19 19:12:58 UTC 2021",
    "company": "COMPASS Pathways",
    "company_url": "https://compasspathways.com/",
    "location": "London, UK or New York",
    "title": "Director of IT \u0026 Enterprise Applications",
    "description": "\u003cp\u003e\u003cstrong\u003eJob overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Director of IT and Enterprise applications will be responsible for the overall IT, Informatics \u0026amp; Enterprise Application strategy for COMPASS Pathways to drive operational excellence. This individual will work closely with the Leadership team, system \u0026amp; business process owners, our third-party vendors and the rest of the organization to evaluate, deploy and integrate new and current systems and services. The Director of IT \u0026amp; Enterprise applications will be responsible for ensuring best-in-class data and infrastructure security protocols and work closely with other departments to ensure compliance with GDPR and other relevant regulatory policies such as GxP and CCPA.\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is a mental health care company dedicated to accelerating patient access to evidence-based innovation in mental health (\u003ca href=\"https://compasspathways.com\"\u003ehttps://compasspathways.com\u003c/a\u003e). Our focus is on improving the lives of those who are suffering with mental health challenges and who are not helped by current treatments. We are pioneering the development of a new model of psilocybin therapy, in which our proprietary formulation of synthetic psilocybin, COMP360, is administered in conjunction with psychological support.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRoles and responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLead the IT, Informatics \u0026amp; Enterprise Applications efforts companywide for COMPASS while building the strategy and long-term vision for the technology infrastructure for the company\u003c/li\u003e\n\u003cli\u003eHelp lead the technical GDPR, DPIA assessments, \u0026amp; other data privacy efforts\u003c/li\u003e\n\u003cli\u003eDevelop and own the enterprise IT application stack while managing associated budgets and supports\u003c/li\u003e\n\u003cli\u003eWork closely with Finance, Legal \u0026amp; other operational groups to deploy necessary infrastructure for ongoing operations\u003c/li\u003e\n\u003cli\u003eLiaise with the clinical and pre-clinical organizations to help develop the data storage and analysis infrastructure\u003c/li\u003e\n\u003cli\u003eWork closely with Digital Health Research Team and Data Engineering for the rapid deployment of custom AI \u0026amp; Machine learning applications\u003c/li\u003e\n\u003cli\u003eTest and evaluate business applications using industry-wide best practices to ensure quality, flexibility, and security\u003c/li\u003e\n\u003cli\u003eWork with 3rd party providers to do appropriate penetration testing and other appropriate audits of computer systems\u003c/li\u003e\n\u003cli\u003eWork with all parties to ensure compliance with Sarbanes Oxley IT General Controls (ITGC)\u003c/li\u003e\n\u003cli\u003eOversee large and small IT projects to completion while supervising staff, consultants, contractors and other resources\u003c/li\u003e\n\u003cli\u003eCreate, drive, and deliver appropriate training materials, associated internal policies, and presentations regarding company IT policies and best practices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDetailed responsibilities/accountabilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe position reports into SVP, Data Science, Machine Learning and Digital Health Research.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eProfile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSignificant prior experience leading the IT function at other companies with a strong data focus. Regulated digital health care start-up and/or Life Science companies are strongly preferred.\u003c/li\u003e\n\u003cli\u003eBachelor’s degree in Computer Science, Information Systems or related field. Master’s degree preferred.\u003c/li\u003e\n\u003cli\u003eStrong hands-on experience of modern enterprise cloud platforms and technologies (AWS \u0026amp; Azure experience required).\u003c/li\u003e\n\u003cli\u003eGood understanding of CI/CD, Atlassian, Github and other common SAAS platforms used for development. Familiarity with JIRA/Agile and other development environments.\u003c/li\u003e\n\u003cli\u003eSignificant experience with eQMS, QC CRM, Document Management systems and other common life science / SaMD technical infrastructure.\u003c/li\u003e\n\u003cli\u003eExperience with 21 CFR 11, GxP document control systems and Sarbanes Oxley IT General Controls (ITGC) a very strong plus, along with knowledge of FDA/EMA compliance principles.\u003c/li\u003e\n\u003cli\u003eGood grasp of pharmaceutical R\u0026amp;D model, including regulatory and market access pathways, processes and requirements.\u003c/li\u003e\n\u003cli\u003eDemonstrable experience of Information Technology compliance programs and industry leading practices/frameworks including ISO 27001, GDPR, HIPAA, and cloud principles.\u003c/li\u003e\n\u003cli\u003eStrong analytical, project management, written and verbal communication skills.\u003c/li\u003e\n\u003cli\u003eAbility to operate independently and in cross-functional teams under uncertainty in an entrepreneurial and rapid growth-oriented environment.\u003c/li\u003e\n\u003cli\u003eStrong alignment with core company mission and values.\u003c/li\u003e\n\u003cli\u003eFlexibility  to work remotely from  UK or US.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf interested, please send your CV and statement of interest to \u003cstrong\u003e\u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUS applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is proud to be an equal opportunity employer. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, and related medical conditions), ethnicity, age, disability, sexual orientation, gender identity, gender expression, military service, genetic information, familial or marital status, or any other status, category, or characteristic protected by applicable law.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUK applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are proud of our commitment to diversity and equality (pursuant to the Equality Act 2010). We do not discriminate based upon race, religion or belief, colour, nationality, ethnic or national origin, gender, pregnancy or maternity, marital or civil partner status, sexual orientation, gender reassignment, age or disability.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eHow to apply\u003c/p\u003e\n\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdktWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--abcc8f0f4451c9511d64b37c1db919c8b69fd52f/5eea52d76325600015dfb3fcce8eba0928.jpeg"
  },
  {
    "id": "c7b1822a-61f8-44c6-9afb-6e841f7fe8e1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c7b1822a-61f8-44c6-9afb-6e841f7fe8e1",
    "created_at": "Thu Jan 14 15:01:13 UTC 2021",
    "company": "COMPASS Pathways",
    "company_url": "https://compasspathways.com/",
    "location": "London, UK or New York",
    "title": "Machine Learning Scientist ",
    "description": "\u003cp\u003e\u003cstrong\u003eJob overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Machine Learning Scientist will support a diverse set of initiatives to improve patient selection, treatment and follow-up via the development of novel machine learning \u0026amp; AI algorithms. You will partner with internal and external stakeholders to develop insights and models to advance discoveries in mental health care.\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is a mental health care company dedicated to accelerating patient access to evidence-based innovation in mental health (\u003ca href=\"https://compasspathways.com\"\u003ehttps://compasspathways.com\u003c/a\u003e). Our focus is on improving the lives of those who are suffering with mental health challenges and who are not helped by current treatments. We are pioneering the development of a new model of psilocybin therapy, in which our proprietary formulation of synthetic psilocybin, COMP360, is administered in conjunction with psychological support.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRoles and responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProvide expertise company-wide on a variety of Machine Learning and AI topics in order to improve the patient journey and provide mission-critical applications as COMPASS grows\u003c/li\u003e\n\u003cli\u003eDevelop algorithms \u0026amp; methodologies that incorporate digital and traditional biomarkers (voice, vision, smart device, etc.) in order to improve the treatment process\u003c/li\u003e\n\u003cli\u003eWork collaboratively with engineering (back-end/front-end/UI+UX/ and others) to deploy these algorithms in a highly scalable and distributed infrastructure to help patients in real time\u003c/li\u003e\n\u003cli\u003eCommunicate insights with stakeholders with the ability to extract therapeutic intelligence by leveraging external and internal data sources\u003c/li\u003e\n\u003cli\u003eWork closely with stakeholders to identify quantitative and technological needs for various COMPASS projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDetailed responsibilities/accountabilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe position reports to the VP of Digital Health Research\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eProfile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSubstantial experience in the field either through industry and/or academia. Biotech \u0026amp; start-up experience a strong plus (Degree in: Statistics, Computer Science, Neuroscience, Engineering, Mathematics, Physics or related)\u003c/li\u003e\n\u003cli\u003eStrong analytical, project management, written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eProficient in Python (scikit-learn, numpy, pandas, matplotlib, scipy) and experience with Tensorflow/Keras and/or Pytorch\u003c/li\u003e\n\u003cli\u003eDeep experience with at least one of the following: Computer Vision, Natural Language Processing, time-series signal processing, audio signal processing.\u003c/li\u003e\n\u003cli\u003eUnderstanding of at least 2-3 common machine learning \u0026amp; AI architectures (convolutional neural nets, reinforcement learning, attention \u0026amp; transformer-based networks, graph neural nets, generative adversarial networks, etc.)\u003c/li\u003e\n\u003cli\u003eComfortable with Linux and the AWS cloud environment\u003c/li\u003e\n\u003cli\u003eAbility to operate independently and in cross-functional teams in an entrepreneurial and rapid growth-oriented environment\u003c/li\u003e\n\u003cli\u003eStrong alignment with core company mission and values; Compassionate, Bold, Rigorous, and Inclusive\u003c/li\u003e\n\u003cli\u003eAbility to work in the UK or US\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional qualifications - preferred\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA PhD in a computational field (Degree in Statistics, Computer Science, Neuroscience, Engineering, Mathematics, Physics or related)\u003c/li\u003e\n\u003cli\u003eIndustry experience in a machine learning or AI role within a digital health organisation, pharma, or biotech\u003c/li\u003e\n\u003cli\u003eExperience in R (tidyr, dplyr, ggplot2, Rstudio)\u003c/li\u003e\n\u003cli\u003eBackground in EEG, fMRI, and other brain measurement technologies a strong plus\u003c/li\u003e\n\u003cli\u003eFamiliar with R Shiny and/or other app development technologies such as Django/Angular/Clojure\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUS applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is proud to be an equal opportunity employer. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, and related medical conditions), ethnicity, age, disability, sexual orientation, gender identity, gender expression, military service, genetic information, familial or marital status, or any other status, category, or characteristic protected by applicable law.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUK applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are proud of our commitment to diversity and equality (pursuant to the Equality Act 2010). We do not discriminate based upon race, religion or belief, colour, nationality, ethnic or national origin, gender, pregnancy or maternity, marital or civil partner status, sexual orientation, gender reassignment, age or disability.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXFWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--50f2b5c49e938cfe97f4701dc1290d0a82cd0783/5e7a01fc6ed7b90015809a872f3de85ebd.jpeg"
  },
  {
    "id": "ced5b561-e6f7-47fd-a342-cf3649d5a999",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ced5b561-e6f7-47fd-a342-cf3649d5a999",
    "created_at": "Thu Jan 14 14:58:38 UTC 2021",
    "company": "COMPASS Pathways",
    "company_url": "https://compasspathways.com/",
    "location": "London, UK or New York",
    "title": "Software Engineering and IT Project Manager ",
    "description": "\u003cp\u003e\u003cstrong\u003eJob overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Software Engineering and IT Project Manager will support a diverse set of initiatives to  improve patient selection, treatment and follow-up by coordinating and driving the various AI \u0026amp; machine learning development efforts under way at COMPASS.\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is a mental health care company dedicated to accelerating patient access to evidence-based innovation in mental health (\u003ca href=\"https://compasspathways.com\"\u003ehttps://compasspathways.com\u003c/a\u003e). Our focus is on improving the lives of those who are suffering with mental health challenges and who are not helped by current treatments. We are pioneering the development of a new model of psilocybin therapy, in which our proprietary formulation of synthetic psilocybin, COMP360, is administered in conjunction with psychological support.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRoles and responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eManage and facilitate the overall project management process from inception to design to implementation and value follow up\u003c/li\u003e\n\u003cli\u003eWork closely with the product manager to ensure each project is integrated into the broader strategic vision of COMPASS and help define metrics of project success\u003c/li\u003e\n\u003cli\u003eFacilitate the creation and adherence to project plans and timelines (both for internal and external stakeholders) by:\u003c/li\u003e\n\u003c/ul\u003e\n\u003cul\u003e\n\u003cli\u003eEnabling discussions to generate requirements, cross-functional interdependencies, and required resources which lead to measurable KPIs and OKRs\u003c/li\u003e\n\u003cli\u003eOrganizing projects into distinct, measurable objectives and activities and bringing together the correct stakeholders to execute on agreed upon objectives\u003c/li\u003e\n\u003cli\u003eManage and coordinate tasks, schedules, issues, risks and status to ensure timely delivery of ongoing development work\u003c/li\u003e\n\u003cli\u003eMaintain a regular reporting cadence both within the project team as well as to management and additional stake holders in terms of project/program scope, time, resourcing and costs to ensure changes are appropriate and agreed upon\u003c/li\u003e\n\u003cli\u003eMonitor and apply appropriate governance policies to projects and data\u003c/li\u003e\n\u003c/ul\u003e\n\u003cul\u003e\n\u003cli\u003eWork very closely with data and machine learning scientists, engineering (back-end/front-end/ data/UI+UX/ and others) and IT to successfully deliver on ongoing project\u003c/li\u003e\n\u003cli\u003eEnable transparency in terms of deliverables to all internal and external stakeholders\u003c/li\u003e\n\u003cli\u003eWork closely with stakeholders to identify quantitative and technological needs for various COMPASS projects\u003c/li\u003e\n\u003cli\u003eWrite various project documentations to inform and update internal and external stakeholders\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDetailed responsibilities/accountabilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSupporting Data Science, Engineering and IT teams\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eProfile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree in Business, IT, Engineering or other relevant academic discipline\u003c/li\u003e\n\u003cli\u003eProject management experience\u003c/li\u003e\n\u003cli\u003eExperience with Scrum/Agile/Kanban/Waterfall project management methods\u003c/li\u003e\n\u003cli\u003eLeadership and executive presence combined with fantastic interpersonal skills and relationship management skills\u003c/li\u003e\n\u003cli\u003eAbility to influence direction and processes without direct authority\u003c/li\u003e\n\u003cli\u003eStrong oral, written and analytical abilities\u003c/li\u003e\n\u003cli\u003eStrong alignment with core company mission and values Compassionate, Bold, Rigorous, and Inclusive\u003c/li\u003e\n\u003cli\u003eAbility to work in the UK or US\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional qualifications - preferred\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAdvanced degree (Master’s/MBA) in relevant academic discipline\u003c/li\u003e\n\u003cli\u003eFamiliarity with AI \u0026amp; Machine learning algorithms a strong plus\u003c/li\u003e\n\u003cli\u003eExperience in the Biotech and/or Health tech fields a strong plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUS applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is proud to be an equal opportunity employer. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, and related medical conditions), ethnicity, age, disability, sexual orientation, gender identity, gender expression, military service, genetic information, familial or marital status, or any other status, category, or characteristic protected by applicable law.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUK applicants\u003c/strong\u003e\nWe are proud of our commitment to diversity and equality (pursuant to the Equality Act 2010). We do not discriminate based upon race, religion or belief, colour, nationality, ethnic or national origin, gender, pregnancy or maternity, marital or civil partner status, sexual orientation, gender reassignment, age or disability.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWlWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--24deb237ec79429ca2b0d9f58741a047247ddfc1/5e7a01fc6ed7b90015809a872f3de85ebd.jpeg"
  },
  {
    "id": "46ab8bfe-de3b-4210-9fa6-656b728f2508",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/46ab8bfe-de3b-4210-9fa6-656b728f2508",
    "created_at": "Thu Jan 14 14:56:08 UTC 2021",
    "company": "COMPASS Pathway",
    "company_url": "https://compasspathways.com/",
    "location": "London, UK or New York",
    "title": "Data Scientist",
    "description": "\u003cp\u003e\u003cstrong\u003eJob overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Data Scientist will support a diverse set of initiatives including statistical computational modelling, advanced analytics and AI projects. You will partner with internal and external stakeholders to develop insights and models to advance discoveries in mental health care.\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is a mental health care company dedicated to accelerating patient access to evidence-based innovation in mental health (\u003ca href=\"https://compasspathways.com\"\u003ehttps://compasspathways.com\u003c/a\u003e). Our focus is on improving the lives of those who are suffering with mental health challenges and who are not helped by current treatments. We are pioneering the development of a new model of psilocybin therapy, in which our proprietary formulation of synthetic psilocybin, COMP360, is administered in conjunction with psychological support.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRoles and responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProvide expertise company-wide ranging from data science \u0026amp; analytics to more traditional statistical and computer science analysis in order to improve the patient journey and provide mission-critical applications as COMPASS grows\u003c/li\u003e\n\u003cli\u003eDevelop algorithms \u0026amp; analyses that incorporate digital and traditional biomarkers (voice, vision, smart device, EEG, others) in order to improve the treatment process via more accurate intervention, personalized therapeutics or real time post-treatment follow up\u003c/li\u003e\n\u003cli\u003eWork collaboratively with engineering (back-end/front-end/UI+UX/ and others) to deploy these algorithms in a highly scalable and distributed infrastructure to help patients in real time\u003c/li\u003e\n\u003cli\u003eCommunicate insights with stakeholders with the ability to extract therapeutic intelligence by leveraging external and internal data sources\u003c/li\u003e\n\u003cli\u003eWork closely with stakeholders to identify quantitative and technological needs for various COMPASS projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDetailed responsibilities/accountabilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe position reports into the VP of Digital Health Research\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eProfile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSubstantial experience in the field either through industry and/or academia. Biotech \u0026amp; start-up experience a strong plus (Degree in: Statistics, Computer Science, Neuroscience, Engineering, Mathematics, Physics or related)\u003c/li\u003e\n\u003cli\u003eStrong analytical, project management, written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eProficient in at least one of Python (scikit-learn, numpy, pandas, matplotlib) or R (tidyr, dplyr, ggplot2, Rstudio)\u003c/li\u003e\n\u003cli\u003eUnderstanding of a variety of statistical and/or machine learning methods (regression, statistical hypothesis testing and design of experiments, tree-based algorithms, supervised vs unsupervised learning). Expert knowledge in a selection of several key areas\u003c/li\u003e\n\u003cli\u003eComfortable with Linux and the AWS cloud environment\u003c/li\u003e\n\u003cli\u003eAbility to operate independently and in cross-functional teams in an entrepreneurial and rapid growth-oriented environment\u003c/li\u003e\n\u003cli\u003eStrong alignment with core company mission and values Compassionate, Bold, Rigorous, and Inclusive\u003c/li\u003e\n\u003cli\u003eAbility to work in the UK or US\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional qualifications - preferred\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA PhD in a computational field (Degree in Statistics, Computer Science, Neuroscience, Engineering, Mathematics, Physics or related)\u003c/li\u003e\n\u003cli\u003eIndustry experience as a data scientist in a digital health organisation, pharma, or biotech\u003c/li\u003e\n\u003cli\u003eBackground in EEG, fMRI, and other brain measurement technologies a strong plus\u003c/li\u003e\n\u003cli\u003eExperience with Tensorflow/Keras and/or Pytorch. Previous background in NLP and/or computer vision a strong plus\u003c/li\u003e\n\u003cli\u003eExperience in modern front-end development and data visualisation\u003c/li\u003e\n\u003cli\u003eFamiliar with R Shiny and/or other modern front-end development and data visualization technologies\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUS applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is proud to be an equal opportunity employer. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, and related medical conditions), ethnicity, age, disability, sexual orientation, gender identity, gender expression, military service, genetic information, familial or marital status, or any other status, category, or characteristic protected by applicable law.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUK applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are proud of our commitment to diversity and equality (pursuant to the Equality Act 2010). We do not discriminate based upon race, religion or belief, colour, nationality, ethnic or national origin, gender, pregnancy or maternity, marital or civil partner status, sexual orientation, gender reassignment, age or disability.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWFWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--63a1a5c0d3a67c8b2cdaac5c3cb8c0b9a79d4119/5e7a01fc6ed7b90015809a872f3de85ebd.jpeg"
  },
  {
    "id": "bc7fe726-f520-4ed1-83eb-82774852f794",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/bc7fe726-f520-4ed1-83eb-82774852f794",
    "created_at": "Thu Jan 14 14:53:12 UTC 2021",
    "company": "https://compasspathways.com/",
    "company_url": null,
    "location": "London, UK or New York",
    "title": "Full Stack Software Engineer",
    "description": "\u003cp\u003e\u003cstrong\u003eJob overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Full Stack Software Engineer will be responsible for delivering COMPASS’s online learning platform. The interactive platform will be used to provide theoretical and practice-based training to psychological therapists and. We want to develop a world class data-driven platform that supports and enables therapists to be the best they can be so that we are well placed to transform mental health care. Emphasis is on user experience and security, while maintaining the best practices.\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is a mental health care company dedicated to accelerating patient access to evidence-based innovation in mental health (\u003ca href=\"https://compasspathways.com\"\u003ehttps://compasspathways.com\u003c/a\u003e). Our focus is on improving the lives of those who are suffering with mental health challenges and who are not helped by current treatments. We are pioneering the development of a new model of psilocybin therapy, in which our proprietary formulation of synthetic psilocybin, COMP360, is administered in conjunction with psychological support.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRoles and responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOwn the technical part of the learning management platform, both frontend and backend\u003c/li\u003e\n\u003cli\u003eEnsure the system is scalable, secure and robust\u003c/li\u003e\n\u003cli\u003eActively contribute to product iteration and development to ensure product is delivering an excellent experience to users\u003c/li\u003e\n\u003cli\u003eHire, train, mentor and grow fellow engineers\u003c/li\u003e\n\u003cli\u003eWrite and ship high quality, best-practice grade code, ensure technical documentation is up to date\u003c/li\u003e\n\u003cli\u003eTest software to ensure responsiveness and efficiency\u003c/li\u003e\n\u003cli\u003eWork across functional teams in the company to translate requirements into technical features, and with data scientists and analysts to develop software.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDetailed responsibilities/accountabilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe position reports into the Head of Engineering\u003c/li\u003e\n\u003cli\u003eThe position works closely with the Therapy Research and Training Team, UI/UX designer, data scientists, and learning designer\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eProfile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in product software development (both front-end and back-end) Ideally have worked on a Learning Management System or within the education sector\u003c/li\u003e\n\u003cli\u003eLanguage agnosticism, understanding of strengths and weaknesses of various languages, systems and frameworks\u003c/li\u003e\n\u003cli\u003eExpert knowledge of React or Angular ecosystem. Experience with Typescript and Next.js are a plus\u003c/li\u003e\n\u003cli\u003eExpertise in Python and experience with other programming languages, ideally Java\u003c/li\u003e\n\u003cli\u003eGood understanding of how relational DBMS (ideally Postgres) work, proficiency in SQL and query performance tuning\u003c/li\u003e\n\u003cli\u003eExperience with infrastructure-as-code frameworks (e.g., Terraform) is a plus\u003c/li\u003e\n\u003cli\u003eStrong analytical, project management, written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eAbility to operate independently and in cross-functional teams under uncertainty in an entrepreneurial and rapid growth-oriented environment\u003c/li\u003e\n\u003cli\u003eStrong alignment with core company mission and values\u003c/li\u003e\n\u003cli\u003eAbility to work in the UK or US (London or New York offices)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUS applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is proud to be an equal opportunity employer. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, and related medical conditions), ethnicity, age, disability, sexual orientation, gender identity, gender expression, military service, genetic information, familial or marital status, or any other status, category, or characteristic protected by applicable law.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUK applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are proud of our commitment to diversity and equality (pursuant to the Equality Act 2010). We do not discriminate based upon race, religion or belief, colour, nationality, ethnic or national origin, gender, pregnancy or maternity, marital or civil partner status, sexual orientation, gender reassignment, age or disability.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbU9WIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e2f80a8d2410c2af7715cb3fde10de0de9d4b56b/5eea52d76325600015dfb3fcce8eba0928.jpeg"
  },
  {
    "id": "c708e6b8-b786-4ee6-8c7a-0d93eb9c557a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c708e6b8-b786-4ee6-8c7a-0d93eb9c557a",
    "created_at": "Thu Jan 14 14:50:20 UTC 2021",
    "company": "COMPASS Pathways plc",
    "company_url": "https://compasspathways.com/",
    "location": "London, UK or New York",
    "title": "DevOps Engineer",
    "description": "\u003cp\u003e\u003cstrong\u003eJob overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for a DevOps Engineer, who will be owning COMPASS’s cloud, AWS-based infrastructure. It is mostly used by our data scientists, researchers and software engineers developing internal products. We would like to create a secure and scalable (both in terms of users and volumes) place which will protect the privacy of our patients while still allowing space for creativity and experimentation.\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is a mental health care company dedicated to accelerating patient access to evidence-based innovation in mental health (\u003ca href=\"https://compasspathways.com\"\u003ehttps://compasspathways.com\u003c/a\u003e). Our focus is on improving the lives of those who are suffering with mental health challenges and who are not helped by current treatments. We are pioneering the development of a new model of psilocybin therapy, in which our proprietary formulation of synthetic psilocybin, COMP360, is administered in conjunction with psychological support.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRoles and responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOwn our AWS cloud infrastructure and ensure the system is scalable, robust and purpose fit\u003c/li\u003e\n\u003cli\u003eIntroduce and adopt the best practices related to the infrastructure-as-code, continuous delivery and integration in the cloud\u003c/li\u003e\n\u003cli\u003eAutomate and improve development and release processes\u003c/li\u003e\n\u003cli\u003eEnsure that systems are safe and secure against cybersecurity threats\u003c/li\u003e\n\u003cli\u003eAct as the infrastructure domain expert and evangelist\u003c/li\u003e\n\u003cli\u003eTroubleshoot various issues related to networking and load\u003c/li\u003e\n\u003cli\u003eConfigure, troubleshoot and optimize the performance of database systems\u003c/li\u003e\n\u003cli\u003eAssist in project management decisions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDetailed responsibilities/accountabilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe position reports into the Head of Engineering\u003c/li\u003e\n\u003cli\u003eThe position works closely with the rest of the engineering department (UI/UX, Full Stack, etc) as well as the data science and IT groups\u003c/li\u003e\n\u003cli\u003eThe person will also liaison cross-functionally as necessary to support infrastructure company-wide\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eProfile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in DevOps, development, systems administration\u003c/li\u003e\n\u003cli\u003eKnowledge of python required. Familiarity with Java and other programming languages is a strong plus.\u003c/li\u003e\n\u003cli\u003eExperience with container systems such as Docker, Kubernetes.\u003c/li\u003e\n\u003cli\u003eExpert knowledge of AWS ecosystem and common Linux platforms (amazon-emi, centOS, others).\u003c/li\u003e\n\u003cli\u003eExperience building AWS infrastructure from the ground up in a fast start-up environment.\u003c/li\u003e\n\u003cli\u003eFamiliarity with GDPR, CCPA and other security regulations.\u003c/li\u003e\n\u003cli\u003eGood understanding of how relational DBMS (ideally Postgres) work under the hood, proficiency query performance tuning\u003c/li\u003e\n\u003cli\u003eExperience with configuration management and orchestration tools (Terraform, Ansible, Cloudformation)\u003c/li\u003e\n\u003cli\u003eStrong analytical, project management, written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eAbility to operate independently and in cross-functional teams under uncertainty in an entrepreneurial and rapid growth-oriented environment\u003c/li\u003e\n\u003cli\u003eStrong alignment with core company mission and values\u003c/li\u003e\n\u003cli\u003eAbility to work in the UK or US (London or New York offices)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUS applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is proud to be an equal opportunity employer. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, and related medical conditions), ethnicity, age, disability, sexual orientation, gender identity, gender expression, military service, genetic information, familial or marital status, or any other status, category, or characteristic protected by applicable law.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUK applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are proud of our commitment to diversity and equality (pursuant to the Equality Act 2010). We do not discriminate based upon race, religion or belief, colour, nationality, ethnic or national origin, gender, pregnancy or maternity, marital or civil partner status, sexual orientation, gender reassignment, age or disability.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUdWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7ae51b09205df231fb8620f689de85474acbd0f9/5e7a01fc6ed7b90015809a872f3de85ebd.jpeg"
  },
  {
    "id": "199c6911-28ee-491d-be3b-3514da4e63d9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/199c6911-28ee-491d-be3b-3514da4e63d9",
    "created_at": "Thu Jan 14 14:44:50 UTC 2021",
    "company": "COMPASS Pathways",
    "company_url": "https://compasspathways.com/",
    "location": "London, UK or New York",
    "title": "UI/UX Designer",
    "description": "\u003cp\u003e\u003cstrong\u003eJob overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe UI/UX Designer will be responsible for shaping and developing the user experience and interface for an online training platform. for therapists. The platform will be used to provide theoretical and practice-based training to psychological therapists. We want to develop a world class platform that supports and enables therapist to be the best they can be so that we are well placed to transform mental health care.\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is a mental health care company dedicated to accelerating patient access to evidence-based innovation in mental health (\u003ca href=\"https://compasspathways.com\"\u003ehttps://compasspathways.com\u003c/a\u003e). Our focus is on improving the lives of those who are suffering with mental health challenges and who are not helped by current treatments. We are pioneering the development of a new model of psilocybin therapy, in which our proprietary formulation of synthetic psilocybin, COMP360, is administered in conjunction with psychological support.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRoles and responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePartner with the therapy research and training team, eLearning Designer and Developer, engineers and product manager to design an elegant and easy-to-use learning management system\u003c/li\u003e\n\u003cli\u003eTake broad and conceptual ideas and turn them into prototypes and features for our therapists\u003c/li\u003e\n\u003cli\u003eDevelop design flows and experiences that are incredibly simple and elegant for both web and mobile platforms\u003c/li\u003e\n\u003cli\u003eContribute to the overall creative strategy and vision (both “what should we build” and “how it should look”)\u003c/li\u003e\n\u003cli\u003eTake broad and conceptual ideas and turn them into prototypes and features for our therapists\u003c/li\u003e\n\u003cli\u003eConduct user research and interviews, and share insights with various stakeholders and integrate into design decisions through insight decks, user journeys, personas, design principles and strategic roadmaps and product features\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDetailed responsibilities/accountabilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe position reports into the Product Manager\u003c/li\u003e\n\u003cli\u003eKey internal partners include; Therapy Research and Training team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eProfile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in designing, building and shipping quality mobile and web platforms in the online education and/or healthcare space\u003c/li\u003e\n\u003cli\u003eHighly creative, empathetic and detail oriented - please attach an online portfolio to the application\u003c/li\u003e\n\u003cli\u003eExperience in interaction and visual design and prototyping\u003c/li\u003e\n\u003cli\u003eHighly skilled in Adobe XD/Figma/Sketch, Photoshop, Illustrator, and other design tools\u003c/li\u003e\n\u003cli\u003eDemonstrate ability to prototype in HTML/CSS/JavaScript, AfterEffects, or other tools\u003c/li\u003e\n\u003cli\u003eDemonstrate communications skills while articulating design decisions\u003c/li\u003e\n\u003cli\u003eExperience running user interviews and testing various prototypes with users\u003c/li\u003e\n\u003cli\u003eStrong analytical, project management, written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eAbility to operate independently and in cross-functional teams under uncertainty in an entrepreneurial and rapid growth-oriented environment\u003c/li\u003e\n\u003cli\u003eStrong alignment with core company mission and values\u003c/li\u003e\n\u003cli\u003eAbility to work in the UK or US (London or New York offices)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUS applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCOMPASS Pathways is proud to be an equal opportunity employer. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, and related medical conditions), ethnicity, age, disability, sexual orientation, gender identity, gender expression, military service, genetic information, familial or marital status, or any other status, category, or characteristic protected by applicable law.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUK applicants\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are proud of our commitment to diversity and equality (pursuant to the Equality Act 2010). We do not discriminate based upon race, religion or belief, colour, nationality, ethnic or national origin, gender, pregnancy or maternity, marital or civil partner status, sexual orientation, gender reassignment, age or disability.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf interested, please send your CV and statement of interest to \u003ca href=\"mailto:hiring@compasspathways.com\"\u003ehiring@compasspathways.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNote that we are not able to sponsor employment visas at this time, and therefore can only accept applications from people who have employment rights in the US or UK.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHlWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6a5a3b57793a7b746b366eaf2f19a75609ba774b/5e7a01fc6ed7b90015809a872f3de85ebd.jpeg"
  },
  {
    "id": "7f8942aa-7eff-445b-8496-a9487cdb68f4",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/7f8942aa-7eff-445b-8496-a9487cdb68f4",
    "created_at": "Thu Jan 14 11:12:22 UTC 2021",
    "company": "Quantcast",
    "company_url": "http://Quantcast",
    "location": "London",
    "title": "Senior Software Engineer",
    "description": "\u003cp\u003eAt Quantcast, data is king, and we know how to process it. The unique features of our custom map/reduce implementation include a revolutionary petabyte sort mechanism; an efficient and flexible petabyte join and lookup, based on innovative data indexing and partitioning mechanisms; dynamic task size adjustment in running jobs; and a self-tuning system that learns and improves job performance without developer intervention.  In the last 5 years, it has allowed Quantcast to scale from processing 400 to 40,000 terabytes of data per day.  For the typical ETL, analytics, and machine learning work at Quantcast, our big data processing platform is on average 4 to 5 times more efficient than the popular open source solutions.\u003c/p\u003e\n\u003cp\u003eQuantcast is looking for Senior Engineers to help build the next generation big data and real time processing platform.  From integrating and improving new open source technologies, to inventing your own, there are many opportunities to have a tremendous impact.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and develop high performance distributed computing systems\u003c/li\u003e\n\u003cli\u003eDiagnose and produce system solutions to big data problems\u003c/li\u003e\n\u003cli\u003ePerform design, architecture, and code reviews\u003c/li\u003e\n\u003cli\u003eMentor and grow more junior team members, Innovate in the big data space: lead, not follow\u003c/li\u003e\n\u003cli\u003eProvide technical input into product roadmaps for the team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS Computer Science or equivalent experience\u003c/li\u003e\n\u003cli\u003e3 years of industry experience in software development\u003c/li\u003e\n\u003cli\u003eExperience working on large-scale distributed systems\u003c/li\u003e\n\u003cli\u003eExperience optimizing the performance of large-scale distributed systems\u003c/li\u003e\n\u003cli\u003eDeep understanding of distributed systems\u003c/li\u003e\n\u003cli\u003eProficient in Java and/or C++\u003c/li\u003e\n\u003cli\u003eStrong software development skills (version control, code review, testing, release, monitoring, debugging)\u003c/li\u003e\n\u003cli\u003eProficiency and high level of insight into Linux OS and running software systems on Linux\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQuantcast is an audience intelligence and measurement company headquartered in San Francisco. Combining machine learning, a privacy-by-design approach, and live data drawn from more than 100 million online destinations, Quantcast provides software, information and advertising services for marketers, publishers and advertising agencies worldwide. Founded in 2006, Quantcast has employees in 20 offices across 10 countries.\u003c/p\u003e\n\u003cp\u003eWe are committed to building an inclusive and diverse environment where everyone can be their authentic self. We work to ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://www.quantcast.com/careers/f1bc0152-a0f9-467a-9235-8621a96b7540/\"\u003ehttps://www.quantcast.com/careers/f1bc0152-a0f9-467a-9235-8621a96b7540/\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGlWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ec702decf1daf7dd3efef5560859ea2b67c67d65/logo-q.png"
  },
  {
    "id": "4d4e3881-d642-42af-81d5-05f996163651",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4d4e3881-d642-42af-81d5-05f996163651",
    "created_at": "Tue Dec 29 12:17:05 UTC 2020",
    "company": "Brandalley UK",
    "company_url": null,
    "location": "London",
    "title": "Senior Frontend Developer",
    "description": "\u003cp\u003eJob Title: Senior User Interface Developer\u003c/p\u003e\n\u003cp\u003eSalary: Competitive\u003c/p\u003e\n\u003cp\u003eBased:  BrandAlley, Telephone House, 69-77 Paul Street, London, EC2A 4NW (remote during Covid-19\u003c/p\u003e\n\u003cp\u003eExperience: Expert User Interface Developer / Magento 1 \u0026amp; 2 Developer\u003c/p\u003e\n\u003cp\u003eReporting to: CTO\u003c/p\u003e\n\u003cp\u003eWho We Are\u003c/p\u003e\n\u003cp\u003eBrand Alley UK Limited is the UK’s largest online flash sale fashion retailer and is currently going through a period of exponential growth. With upwards of 5 million members, we sell top branded fashion and homeware products, process tens of thousands of orders per day and we are one of the most successful E-Commerce brands in the UK.\u003c/p\u003e\n\u003cp\u003eOperating between London and Delhi, our team of developers and Magento specialists work on a wide range of projects for the BrandAlley Web platform. Its dynamic, diverse and an incredibly exciting time as BrandAlley migrates its front-end web platform into Magento 2 and moves its entire back office team into a custom built platform consisting of a PIM, warehousing, merchandising, customer service, and marketing modules. With this new architecture in place 2021 will see a backlog of new features developed for \u003ca href=\"http://www.brandalley.co.uk\"\u003ewww.brandalley.co.uk\u003c/a\u003e and our European site (\u003ca href=\"http://www.brandalley.fr\"\u003ewww.brandalley.fr\u003c/a\u003e) built and migrated onto its own Magento 2 instance and connected into the same back office systems as the UK site.\u003c/p\u003e\n\u003cp\u003eAlong with the launch of our IOS and Android Apps, 2021 can also see the further break-up of the Magento user interface layer into rich Progressive Web Apps making this a truly exciting opportunity.\u003c/p\u003e\n\u003cp\u003eJob Description\u003c/p\u003e\n\u003cp\u003eWe are looking for an experienced User Interface Developer with proven experience of working with large scale web applications to join our team. This role will be perfect for an individual who has been developing Magento User Interfaces for a number of years, has a heightened passion for making Magento work beyond its limits, creating high performance JavaScript, CSS and HTML and either is working with PWA technology right now or has at least begun the journey and is investing time in learning the technology.\u003c/p\u003e\n\u003cp\u003e﻿Duties and Responsibilities\u003c/p\u003e\n\u003cp\u003e●     To develop and progress the website user interface \u0026amp; optimise applications for maximum speed and scalability.\u003c/p\u003e\n\u003cp\u003e●     Work in an Agile environment to develop the latest and greatest code for web and layout guidance for our Mobile App.\u003c/p\u003e\n\u003cp\u003e●     Code user interface changes to existing features and prototyping and building new features.\u003c/p\u003e\n\u003cp\u003e●     Testing the existing website to ensure that it continually meets internal customer’s expectations.\u003c/p\u003e\n\u003cp\u003e●     Ensure high end user stability and performance using manual and automation testing techniques\u003c/p\u003e\n\u003cp\u003e●     Ensure the technical feasibility of user interface designs and control good quality ux output in line with the overall web and mobile strategy\u003c/p\u003e\n\u003cp\u003e●     Promote and drive best practice\u003c/p\u003e\n\u003cp\u003e●     Stay abreast of latest user interface technology trends\u003c/p\u003e\n\u003cp\u003e●     Provide resource quotations to product owners \u0026amp; business analysts\u003c/p\u003e\n\u003cp\u003e●     Provide accurate information into JIRA\u003c/p\u003e\n\u003cp\u003eSkills and Experience Required\u003c/p\u003e\n\u003cp\u003e●     Strong Magento frontend development experience (Magento 1 \u0026amp; 2)\u003c/p\u003e\n\u003cp\u003e●     Strong experience of developing applications using HTML5 / jQuery / Knockout and RequireJs\u003c/p\u003e\n\u003cp\u003e●     Strong experience with CSS3, CSS pre-processors and the differing methodologies (preferred LESS)\u003c/p\u003e\n\u003cp\u003e●     Strong experience of JavaScript\u003c/p\u003e\n\u003cp\u003e●     Strong experience asynchronous control flow, partial page updates, ajax, private Magento content techniques, data layer (Google)\u003c/p\u003e\n\u003cp\u003e●     Strong experience debugging browser behavior \u0026amp; performance issues,\u003c/p\u003e\n\u003cp\u003e●     Can create and operate local development environment using Docker\u003c/p\u003e\n\u003cp\u003e●     Strong Git, GitFlow and Composer skills\u003c/p\u003e\n\u003cp\u003e●     Strong team player\u003c/p\u003e\n\u003cp\u003eTo Stand Out\u003c/p\u003e\n\u003cp\u003e●     Someone who has skills with Progressive Web App (PWA) development\u003c/p\u003e\n\u003cp\u003e●     Someone who is a JavaScript genius and JavaScript has become your life\u003c/p\u003e\n\u003cp\u003e●     Someone who develops with a “performance first” mindset\u003c/p\u003e\n\u003cp\u003e●     Someone who can mentor and guide more junior developers\u003c/p\u003e\n\u003cp\u003e●     Someone who loves to learn new technology\u003c/p\u003e\n\u003cp\u003e●     Someone who can talk tech and none tech when neededz\u003c/p\u003e\n\u003cp\u003eEligibility\u003c/p\u003e\n\u003cp\u003e●     You must be eligible to live and work in the UK\u003c/p\u003e\n\u003cp\u003e●     You must be able to work onsite in London (Old Street)\u003c/p\u003e\n\u003cp\u003eThe Candidate\u003c/p\u003e\n\u003cp\u003eSelf-motivated, adaptable with a positive attitude\nEnthusiastic and respectful of others\nMust have a ‘Can do approach’\nFlexible and willing to go the extra mile with a good sense of humour\nMust be able to work autonomously\u003c/p\u003e\n\u003cp\u003eWhy You’ll Like Working with Us\u003c/p\u003e\n\u003cp\u003eYou’ll have the opportunity to work on some exciting brands supported by an inspiring and friendly team of people\nYou’ll join a great talented team who are all driven to be the best they can be, while having a lot of fun along the way\nWe offer a place to grow, where you can spread your wings\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your CV and Cover Letter to: \u003ca href=\"mailto:andrew.miles@brandalley.co.uk\"\u003eandrew.miles@brandalley.co.uk\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaktVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d6f999da69b3ee922b39f804e919baadbbbad4cb/hBk8VqSR_400x400.jpg"
  },
  {
    "id": "1fa92fe9-1d00-4ee1-b695-a0a39209389f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/1fa92fe9-1d00-4ee1-b695-a0a39209389f",
    "created_at": "Tue Dec 29 12:11:48 UTC 2020",
    "company": "Brandalley UK",
    "company_url": null,
    "location": "London",
    "title": "Lead Developer (magento)",
    "description": "\u003cp\u003eAbout the job\nJob Title: Lead Developer (magento)\u003c/p\u003e\n\u003cp\u003eSalary: Competitive\u003c/p\u003e\n\u003cp\u003eBased:  BrandAlley, Telephone House, 69-77 Paul Street, London, EC2A 4NW (remote during Covid-19)\u003c/p\u003e\n\u003cp\u003eExperience: Expert Engineer / Magento 1 \u0026amp; 2 Developer / Team Lead\u003c/p\u003e\n\u003cp\u003eReporting to: CTO\u003c/p\u003e\n\u003cp\u003eWho We Are?\u003c/p\u003e\n\u003cp\u003eBrand Alley UK Limited is the UK’s largest online flash sale fashion retailer and is currently going through a period of exponential growth. With upwards of 5 million members, we sell top branded fashion and homeware products, process tens of thousands of orders per day and we are one of the most successful E-Commerce brands in the UK.\u003c/p\u003e\n\u003cp\u003eOperating between London and Delhi, our team of developers and Magento specialists work on a wide range of projects for the BrandAlley Web platform. Its dynamic, diverse and an incredibly exciting time as BrandAlley migrates its front-end web platform into Magento 2 and moves its entire back office team into a custom-built platform consisting of a PIM, warehousing, merchandising, customer service, and marketing tools. With this new architecture in place 2021 will see a backlog of new features developed for \u003ca href=\"http://www.brandalley.co.uk\"\u003ewww.brandalley.co.uk\u003c/a\u003e and our European site (\u003ca href=\"http://www.brandalley.fr\"\u003ewww.brandalley.fr\u003c/a\u003e) built and migrated onto its own Magento 2 instance and connected into the same back office systems as the UK site.\u003c/p\u003e\n\u003cp\u003eAlong with the launch of our IOS and Android Apps, 2021 will also see the further break-up of the Magento user interface layer into rich Progressive Web Apps making this a truly exciting opportunity.\u003c/p\u003e\n\u003cp\u003eJob Description\u003c/p\u003e\n\u003cp\u003eWe are looking for an experienced Team Lead with proven experience of working with large scale web applications to join our team in London. This role will be perfect for an individual who has been developing on Magento, PHP and MySQL and running Apps in AWS for a number of years, has a heightened passion for making Magento work beyond its limits and has lead teams that create high performance code and stacks on container environments.\u003c/p\u003e\n\u003cp\u003eDuties and Responsibilities\u003c/p\u003e\n\u003cp\u003e●     Determining project requirements and developing work schedules for the team along with product owners and analysts.\u003c/p\u003e\n\u003cp\u003e●     Delegating tasks and achieving daily, weekly, and monthly goals.\u003c/p\u003e\n\u003cp\u003e●     Liaising with team members, management, and internal clients to ensure projects are completed to standard.\u003c/p\u003e\n\u003cp\u003e●     Identifying risks and forming contingency plans as soon as possible.\u003c/p\u003e\n\u003cp\u003e●     Constantly maintain a secure environment and evaluate security posture.\u003c/p\u003e\n\u003cp\u003e●     Analysis existing system operations and scheduling training sessions and meetings to discuss improvements.\u003c/p\u003e\n\u003cp\u003e●     Provide resource quotations to product owners \u0026amp; business analysts.\u003c/p\u003e\n\u003cp\u003e●     Performing troubleshooting as required.\u003c/p\u003e\n\u003cp\u003e●     Being transparent with the team about challenges, failures, and successes.\u003c/p\u003e\n\u003cp\u003e●     Ensure that all systems and platforms are supported and adequately manned at all times.\u003c/p\u003e\n\u003cp\u003e●     Ensure high end user stability and performance of systems.\u003c/p\u003e\n\u003cp\u003e●     Writing progress reports and delivering presentations to the relevant stakeholders.\u003c/p\u003e\n\u003cp\u003e●     Promote and drive best practice.\u003c/p\u003e\n\u003cp\u003e●     Provide accurate information into JIRA.\u003c/p\u003e\n\u003cp\u003e●     Keeping up to date with industry trends and developments.\u003c/p\u003e\n\u003cp\u003e●     Updating work schedules in JIRA.\u003c/p\u003e\n\u003cp\u003eSkills and Experience Required\u003c/p\u003e\n\u003cp\u003e●     Strong Magento development background experience (Magento 1 \u0026amp; 2).\u003c/p\u003e\n\u003cp\u003e●     Strong Magento troubleshooting experience.\u003c/p\u003e\n\u003cp\u003e●     Strong database skills in MySQL, Performance Schema, MySQL Tuning, Monitoring, and troubleshooting.\u003c/p\u003e\n\u003cp\u003e●     Strong experience debugging performance issues.\u003c/p\u003e\n\u003cp\u003e●     Strong DevOps, AWS, and Server experience.\u003c/p\u003e\n\u003cp\u003e●     Strong Docker, Kubernetes, Container and Terraform experience.\u003c/p\u003e\n\u003cp\u003e●     Strong Security focus.\u003c/p\u003e\n\u003cp\u003e●     Strong Git and Composer experience.\u003c/p\u003e\n\u003cp\u003e●     Strong team player.\u003c/p\u003e\n\u003cp\u003eTo Stand Out\u003c/p\u003e\n\u003cp\u003e●     Someone who has skills and experience managing Progressive Web App (PWA) development.\u003c/p\u003e\n\u003cp\u003e●     Someone who develops with a “performance first” mindset.\u003c/p\u003e\n\u003cp\u003e●     Someone who can mentor and guide developers.\u003c/p\u003e\n\u003cp\u003e●     Someone who loves to learn new technology.\u003c/p\u003e\n\u003cp\u003e●     Someone who can talk tech and non tech when needed.\u003c/p\u003e\n\u003cp\u003eEligibility\u003c/p\u003e\n\u003cp\u003e●     You must be eligible to live and work in the UK.\u003c/p\u003e\n\u003cp\u003e●     You must be able to work onsite in London (Old Street).\u003c/p\u003e\n\u003cp\u003eThe Candidate\u003c/p\u003e\n\u003cp\u003e·      Self-motivated, adaptable with a positive attitude\u003c/p\u003e\n\u003cp\u003e·      Enthusiastic and respectful of others\u003c/p\u003e\n\u003cp\u003e·      Must have a ‘Can do approach’\u003c/p\u003e\n\u003cp\u003e·      Flexible and willing to go the extra mile with a good sense of humour\u003c/p\u003e\n\u003cp\u003e·      Must be able to work autonomously\u003c/p\u003e\n\u003cp\u003eWhy You’ll Like Working with Us\u003c/p\u003e\n\u003cp\u003e·      You’ll have the opportunity to work on some exciting brands supported by an inspiring and friendly team of people\u003c/p\u003e\n\u003cp\u003e·      You’ll join a great talented team who are all driven to be the best they can be, while having a lot of fun along the way\u003c/p\u003e\n\u003cp\u003e·      We offer a place to grow, where you can spread your wings\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your CV and Cover Letter to \u003ca href=\"mailto:andrew.miles@brandalley.co.uk\"\u003eandrew.miles@brandalley.co.uk\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakNVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--92ff99cab33c45f4584e9eb9b2e4dfa8cf9f7721/hBk8VqSR_400x400.jpg"
  }
]
